{
  "site": "https://lioness.io/",
  "items": [
    {
      "title": "Lioness: Pleasure. Proof. Progress",
      "content": "YOU DESERVE BETTER Better Os. Better intimacy. Better sexual health.Improve your orgasms with the Lioness, the award-winning vibrator that puts the power of pleasure in the palm of your hand. SHOP NOW The proof is in your pleasure What would you do if you had the information needed to see and improve your orgasm? No other vibrator can show you how things like sleep, caffeine, stress, medicine, and more impact your orgasm. Don’t just masturbate. Masturbate smarter. SHOP NOW Get to know your \"O\" Most people have one of three orgasm patterns: LEARN MORE Approved by Experts \"Sexuality is multi-faceted, but one of the most important factors is understanding your own body well. Lioness is the only device tailor-built to support this purpose.\" Dr. Michael KrychmanOB/GYN, clinical sexual counselor, & Executive Director of SoCal Center for Sexual Health & Suvivorship Medicine \"What Lioness has done is truly groundbreaking research on what's happening with the pelvic floor muscles during female orgasm, which has been understudied for decades.\" Dee Hartmann, PT, DPTWomen's Health Physical Therapist, Researcher, & Co-author of The Pleasure Prescription The vibrator has been upgraded Masturbation is a normal, healthy part of being human — but finding ways to improve your experience can be hard. Our team at Lioness is here to change that, one orgasm at a time. The Lioness Smart Vibrator perfectly blends the power of technology with the power of pleasure, making it easy to see and improve your orgasms. The Team",
      "content_type": "other",
      "source_url": "https://lioness.io/"
    },
    {
      "title": "How Lioness Works - Experience the Smart Vibrator Made by Women",
      "content": "Search 0 Cart Shop Lioness Vibrator Lioness Charger Cable Everything but the O Bundle How It Works How Lioness Vibrator Works Live View Remote Control Participate in Research Reviews Research FAQ Frequently Asked Questions Sezzle Now, Pay Later How People Have Explored With Lioness Sex Guides Lioness Vibrator Anatomy Orgasm Masturbation Relationships Health See All Guides 0 Cart THE VIBRATOR Lioness Smart VibratorThe Ultimate O BundleSpare charger THE CBD Vella Pleasure SerumForia Intimacy MeltsForia Booty Melts THE MERCH StickersHatsSocksTote bagsShop All Research Lab Technology Delivered Right to your BedroomNo other vibrator delivers technology previously only seen in research labs directly into your hands.Precision Sensors Measure What MattersWith sensors embedded into the insertable portion of the vibrator, the Lioness measures your pelvic floor movements during use. Why does this matter? Because during orgasm, your pelvic floor muscles will rhythmically squeeze and relax — and Lioness can show you the strength and duration of those contractions to make your pleasure better and better.While those movements may be similar from session to session, they can and will change. In fact, your pleasure and orgasm are directly influenced by various factors such as your stress, your health, your sleep, and even the substances you consume daily!What’s the point? By using the Lioness app and vibrator, you can effortlessly keep track of what influences your orgasms and gain a deeper understanding of your body. The results? Better orgasms, better intimacy, and better sexual self-confidence.Shop Lioness NowBacked by Researchers, Doctors, & Sex TherapistsLioness works — and we’re not the only ones who know it. Take a look at what just a few of the many doctors, therapists, and researchers that stand behind our technology have to say:Dee Hartmann, PT, DPTPelvic Floor Therapist, Researcher, Co-author of The Pleasure Prescription\"What Lioness has done is truly groundbreaking research on what's happening with the pelvic floor muslces during female orgasm, which has been understudied for decades.\"Dr. Michael KrychmanOB/GYN, Clinical Sexual Counselor, & Executive Director of SoCal Center for Sexual Health & Survivorship Medicine\"Sexuality is multi-faceted, but one of the most important factors is understanding your own body well. Lioness is the only device tailor-built to support this purpose.\"Sarah Merrill, PhDPhD in Developmental Psychology Cornell University & Sex Researcher \"The fact is, female pleasure has been far more elusive than male pleasure. Lioness could provide a service to women by addressing a large gap in the knowledge and practice of female sexuality.\"See Your Orgasms Like Never BeforeDid you know there are currently three observable orgasm patterns? And the Lioness’s ability to detect them has been validated in the presitigious medical journal, Journal of Sexual Medicine.The ocean wave orgasm lis the most common pattern. The pelvic floor contracts and releases multiple times with similar force, first quickly, and then slows down until rest. Ocean Wave PatternThe avalanche orgasm is similar to the ocean wave in that it’s also a series of pelvic floor movements, but unlike the ocean wave, it starts from a high point and gradually relaxes.Avalanche PatternThe rarest pattern, the volcano orgasm is one, extended pelvic floor movement, instead of a series of pelvic floor movements like the ocean wave orgasm.Volcano PatternSee More O Data Lioness Smart Vibrator$229.00 Violet Purple - $229.00 Granite Grey - $229.00 Take charge with the award-winning smart vibrator that lets you visualize, understand, and improve your pleasure. Award-Winning Technology Loved by Doctors & Sex Therapists Enjoy Solo or Remote-Controlled with Partner Add To CartView DetailsLioness Sexploration BlogHow to Orgasm During Sex: Science-Based Guide for WomenSexperiment Results: Does edging improve orgasms? Lioness users around the world delayed their orgasms for science. Here's what the data shows:How people have explored with Lioness There are a variety of ways people can explore with the Lioness Vibrator. Whether you have a question, want to improve pleasure or intimacy, or just want to have fun, there's always something new to explore. Plus, we are constantly adding new features and functionality via free iOS and Android app updates for even more ways to learn and play. We've included several examples of what you could do with Lioness.Sexperiment Results: Are Orgasms Better with After Warming Up the Clitoris?What does an orgasm look like? Lioness can show you.Who cares if your fingerprint has ridges or whorls. Want to know if your orgasm looks like an avalanche, a volcano, or an ocean wave?Anal Orgasms Are Real: Comparing Vaginal Vs. Anal OrgasmsThat’s right, I’m writing a whole post about showing you my anal orgasm data in response to your sassy question. And even better, I’m going to show you what the anal orgasm data looks like compared to my vaginal orgasm data from the same session through double penetration. Search our shop What are you looking for? What are you looking for? One or more of the items in your cart is a recurring or deferred purchase. By continuing, I agree to the cancellation policy and authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted. Checkout:Agree:",
      "content_type": "other",
      "source_url": "https://lioness.io/pages/how-it-works"
    },
    {
      "title": "Visualize The Female Orgasm Using The Lioness Vibrator",
      "content": "Now you can see your orgasm in-real time by Liz Klinger April 15, 2019 2 min read app data high tech high tech sex toy lioness lioness vibrator sex toy vibrator Available as a free update for the Lioness Vibrator Live view is an option on the Lioness Vibrator if you’re curious to see what your own sexual arousal and orgasm look like in real time. 😱 Check out the video to learn more about live view and how to use it. How you can use Live View With a Partner You can use live view to show a partner what’s going on in the moment. It can be a very intimate and revealing experience because you and your partner are seeing yourself in a totally new way. Unlike the Harry Meets Sally instance of faking a real orgasm, you’re showing what your real orgasm actually looks like. Combined with the in-app remote control, you can play together and see what movements and sensations feel especially great. Solo Play You can also use live view yourself if you want to get visual information on what your body is doing as you’re trying different things with the Lioness. You can start seeing what patterns are happening as you become more aroused or as you climax. Combined with the in-app remote control, you can use the settings or slider(!!!) to quickly jump to any vibration level you desire for the perfect stimulation at the perfect time. === Intrigued? Explore your orgasms and more withThe Lioness Lioness is the first and only vibrator that helps you improve your orgasms. The world’s most advanced rabbit-style vibrator. Precision sensors let you literally see your arousal and orgasm. Experiment, understand yourself, and have better orgasms—after all, as the saying goes, “never measured, never improved.” Click hereto learn more. Related Blog Posts Tips for using Lioness the first time by Liz Klinger January 07, 2022 3 min read Read more Orgasm Data 101 by Liz Klinger January 07, 2022 2 min read Read more Now you can use Lioness as a remote control vibrator In-app remote control for partner play and easier solo play. More than just a remote control — you also have the option to see your arousal and orgasm in real time through visualizations like the one below! Learn more about Lioness's newest feature here, available as a free app update for iOS and Android. app couples guide remote control by Liz Klinger March 12, 2019 2 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/lioness-product-updates/live-view-a-new-way-to-explore-with-lioness"
    },
    {
      "title": "Introducing: Long Distance Remote Control for the Lioness Smart Vibrat",
      "content": "Introducing: Long Distance Remote Control for the Lioness Smart Vibrator by Kate Delgado February 14, 2023 1 min read lioness vibrator long distance news remote control Partner play is here as a free update for all Lioness users! 🎉 You asked for it, Lioness Pride, and we made it happen. For the first time ever, the Lioness 2.0 and mobile app now fully support long-distance remote control. Whether you’re in different rooms or different countries, Partner Play allows you to connect in real-time. Using our existing Live View feature in the Lioness app you know and love, Partner Play makes pleasure data and vibration controls available to anyone you invite to play. No new Lioness account required: just have them download the mobile app, share the secret code, and give as much control over your pleasure as you want. Pleasure is (still) power. And power means you are in control — unless you don’t want to be! 😉 Unlike other long-distance toys, Lioness Partner Play lets you grant and deny permissions as you choose. Give your long-distance lover access to what you want, whether that’s only watching your pleasure in real-time, letting them take control of your Lioness’s vibrations, or kicking them out your pleasure den if needed. The choice is yours! Download the Lioness App here: Download iOS Download Google Play Please note, BOTH partners will need the Lioness app, but only one partner will need a Lioness 2.0 Vibrator. Partner Play requires an app and firmware update, both of which are free to all Lioness users.As always, feel free to reach out at support@lioness.io if you have any questions. Happy (s)exploring! Related Blog Posts How to Orgasm During Sex: Science-Based Guide for Women couples guide orgasm relationship by Anna Lee September 07, 2025 6 min read Read more Sexperiment Results: Does edging improve orgasms? Lioness users around the world delayed their orgasms for science. Here's what the data shows: data edging lioness vibrator by Kate Delgado August 29, 2025 2 min read Read more How people have explored with Lioness There are a variety of ways people can explore with the Lioness Vibrator. Whether you have a question, want to improve pleasure or intimacy, or just want to have fun, there's always something new to explore. Plus, we are constantly adding new features and functionality via free iOS and Android app updates for even more ways to learn and play. We've included several examples of what you could do with Lioness. data guide lioness vibrator vibrator by Anna Lee August 12, 2025 4 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/introducing-long-distance-remote-control-for-the-lioness-smart-vibrator"
    },
    {
      "title": "Lioness Sex Research Platform",
      "content": "Search 0 Cart Shop Lioness Vibrator Lioness Charger Cable Everything but the O Bundle How It Works How Lioness Vibrator Works Live View Remote Control Participate in Research Reviews Research FAQ Frequently Asked Questions Sezzle Now, Pay Later How People Have Explored With Lioness Sex Guides Lioness Vibrator Anatomy Orgasm Masturbation Relationships Health See All Guides 0 Cart THE VIBRATOR Lioness Smart VibratorThe Ultimate O BundleSpare charger THE CBD Vella Pleasure SerumForia Intimacy MeltsForia Booty Melts THE MERCH StickersHatsSocksTote bagsShop All Introducing the LionessSex Research PlatformImagine if we tried to study the heart without knowing much about the heartbeat. That’s the state of our understanding of sexual function for anyone with a vagina.The women-led team at Lioness—the inventors of the first and only smart vibrator that uses biofeedback, precision sensors, and pleasure data to help people learn more about their own arousal and orgasms—have launched the first-of-its-kind Lioness Sex Research Platform.UsersResearchersLIONESS USERSDo it for scienceDid you know that one of the most \"cutting edge\" studies on physiological arousal and orgasm for people with vaginas is a study from the 1980s and included only 11 participants?Let's change that together. Participate in studies from the comfort of your home that could revolutionize our understanding of sexual wellness, behavior, and health—and maybe learn a new thing or two about yourself in the process—all from the comfort of your home.Click below to about the program and how to opt-in.Learn moreRESEARCHERSIncorporate large scale, real world, physiological and behavioral sex data into your workConnect with participants from a variety of demographics who opt-in and are excited to contribute to your research.Learn more about how the platform works, how to work with users, and how you can integrate the platform and technology into your own studies.Learn moreWHAT IS LIONESS?A smart vibrator for smarter orgasmsA powerful sexual discovery tool that uses cutting-edge technology once relegated to specialized research labs, packaged into a sleek, portable device that fits in the palm of your hand.Biofeedback, precision sensors, and pleasure data help people learn more about their own bodies.Learn more01Learn about your own bodyUse like a typical vibrator. Afterwards, use the free app to see your pleasure data.02Improve your pleasureAdd notes or tags to remember what you liked, didn't like, or didn't realize you liked.03Have fun!See patterns over time so you can have more of the good stuff.KEEP UP WITH THE LATEST RESEARCH AND UPDATESSubscribe to our newsletterRelated PostsWhat Lioness means to me: A seriesIn a world where masturbation for people with vaginas is still taboo, it’s important to be able to make space for the learning, exploration, and fun Liz and Anna had in mind when they developed the Lioness Smart Vibrator.This is why we came up with the “What Lioness Means to Me” series. We want to highlight the Lioness’s capabilities while giving all of those in our Pride the chance to speak for themselves.Below is the first in our series, a submission from Rachael. Rachael is a mom, a woman with a Ph.D., a professor, and a self-proclaimed Lioness enthusiast.Read more...How to use Lioness to see your orgasm in real timeLive view is an option on the Lioness Vibrator if you’re curious to see what your own sexual arousal and orgasm look like in real time. 😱Check out the video in this article to learn more about live view and how to use it.Read more...How to use the Lioness Smart Vibrator as a couples sex toyAlthough the Lioness Vibrator is primarily thought of as a product for self-discovery, it’s also a great tool for our-discovery. Basically, what I’m saying is that it can also be one of the best sex toys out there for couples.Read More...Back to Lioness Search our shop What are you looking for? What are you looking for? One or more of the items in your cart is a recurring or deferred purchase. By continuing, I agree to the cancellation policy and authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted. Checkout:Agree:",
      "content_type": "other",
      "source_url": "https://lioness.io/pages/lioness-research-platform"
    },
    {
      "title": "Customer Reviews - See what our customers are saying | Lioness",
      "content": "Lioness Vibrator Customer Reviews Lioness is also reviewed by: Lioness Vibrator Customer Reviews Lioness is also reviewed by:",
      "content_type": "other",
      "source_url": "https://lioness.io/pages/reviews"
    },
    {
      "title": "Frequently Asked Questions and Support Center",
      "content": "Getting Started with LionessRead these articles as you being your journey into the world of smarter orgasms.By Lioness1 author7 articlesTechnology QuestionsQuestions about how Lioness's biofeedback, sensors, and app work.By Lioness1 author15 articlesBuy Now, Pay LaterBy Lioness1 author1 articleGeneral Vibrator Questions\"Lioness sounds cool... but is it a good vibrator?\"By Lioness1 author11 articlesCheckout and ShippingBy Lioness1 author15 articlesLioness User TroubleshootingBy Lioness1 author15 articlesAdditional QuestionsBy Lioness1 author6 articles",
      "content_type": "other",
      "source_url": "https://www.lioness.io/pages/frequently-asked-questions"
    },
    {
      "title": "Sezzle it now. Pay it back later. - Lioness",
      "content": "Search 0 Cart Shop Lioness Vibrator Lioness Charger Cable Everything but the O Bundle How It Works How Lioness Vibrator Works Live View Remote Control Participate in Research Reviews Research FAQ Frequently Asked Questions Sezzle Now, Pay Later How People Have Explored With Lioness Sex Guides Lioness Vibrator Anatomy Orgasm Masturbation Relationships Health See All Guides 0 Cart THE VIBRATOR Lioness Smart VibratorThe Ultimate O BundleSpare charger THE CBD Vella Pleasure SerumForia Intimacy MeltsForia Booty Melts THE MERCH StickersHatsSocksTote bagsShop All How to use Sezzle at checkoutHow does Sezzle work?Check out with Sezzle and split your entire order into 4 interest-﻿free payments over 6 weeks.When you are in the Payment method section of checkout, you can select Sezzle as your payment method (see screenshot).Below are more detailed step-by-step directions of how to select Sezzle during checkout.If you have any issues or questions concerning Sezzle, please email support@lioness.io.How it Works:Pay over time. Your entire online order, split into 4 interest-free payments scheduled over a 6 week period. No interest, ever. As long as you pay on time, there will be no additional fees.No credit impact. Sezzle's instant approval decisioning process has zero impact to your credit score. Sign up here: https://sezzle.com/signupStep-By-Step Instructions1. Add Lioness to cart and begin checkout2. Enter your shipping information as normal.3. Select \"Sezzle\" payment method.4. You'll be redirected to your Sezzle account to finish the process and voila! You're done! Once your order is complete, you can expect it to ship within 1 to 2 business days (unless you've placed an order for a preordered product). Still have questions? Reach out to us at support@lioness.io Search our shop What are you looking for? What are you looking for? One or more of the items in your cart is a recurring or deferred purchase. By continuing, I agree to the cancellation policy and authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted. Checkout:Agree:",
      "content_type": "other",
      "source_url": "https://lioness.io/pages/quadpay"
    },
    {
      "title": "Lioness Smart Vibrator - Erotic Orgasm Stories With Data",
      "content": "How people have explored with Lioness by Anna Lee August 12, 2025 4 min read data guide lioness vibrator vibrator We’ve learned a lot since our debut into the sex toy scene, and a lot of that learning has come from how people have used Lioness on their own journeys to better orgasms. If you’re not sure where to start with your Lioness, look no further than this master list of over 25 ways to explore your pleasure and orgasm data. Table of Contents What Makes Lioness Different Sexual Health Research with Orgasm Data Pleasure Enhancement Techniques and Methods Understanding How Stimulants Affect Your Orgasm Combining Lioness with Other Sex Toys Creating Art from Your Pleasure Data Exploring Anal Play with Data Tracking 1. What Makes Lioness Different The Lioness Smart Vibrator is the next generation of vibrators. Using advanced sensors to monitor your pelvic floor contraction, Lioness brings the sex lab right to your bedroom toshow you what your body is doing. (With or without orgasm!) So whether you're curious about your sexual health, want to enhance intimacy with a partner, or simply love exploring new ways to experience pleasure, the Lioness vibrator offers endless possibilities for discovery. With regular app updates and a growing community of users sharing their experiences, there's always something new to learn about your body. Example of an orgasm before and after a concussion.Graph is force from pelvic floor contractions (vaginally or anally) over time.Read more about their experience here. 2. Using Orgasm Data to Understand Health Impacts Understanding your body's responses during sexual stimulation is a privilege only Lioness can provide. In fact, users have taken their orgasm data to new heights by discovering important patterns and changes in their sexual response under the influence of certain medical conditions. Concussion and Brain Injury Impact:How head injuries can affect orgasm intensity and pelvic floor function Hormonal Changes and Orgasm Patterns:Tracking how menstrual cycles, menopause, and hormonal treatments influence sexual response Stress and Sexual Wellness Correlation:Using orgasm data to understand the connection between stress levels and sexual satisfaction Lisa’s three “dips” while practicing the edging technique — the moments right before orgasm. She uses this visualization to understand what she's feeling in the moments before edging to have better control and maximize her pleasure. 3. Testing New Tools & Techniques Learning different techniques and tracking your body's response can significantly improve your sexual experience. The Lioness app doesn’t just allow you to visualize what works best for your unique physiology, it guides you through various Sexperiments to give you proof of what does and doesn’t work. Edging and Orgasm Control: Master the art of bringing yourself to the brink and backing off for more intense climaxes Breathing Techniques for Better Orgasms:How proper breathing can enhance pelvic floor function and orgasm intensity Couples Play with Real-Time Data: Using Lioness as a couples sex toy to better understand each other's pleasure patterns Effects of using cannabis lube, explored with Lioness. 4. Seeing How Stimulants Affect Sexual Pleasure CBD, Alcohol, THC and more are no stranger to the bedroom these days but figuring out if they help or hinder sexual pleasure can be difficult. Unless you have a Lioness! Users all over the world are getting concrete proof about what substances do and do not improve their orgasms. Alcohol: Our Lioness users tested how orgasms and pleasure would change after one alcoholic drink. Caffeine: The internet rumor that says caffeine makes orgasms 50% stronger- and the Lioness users put it to the test. CBD: Should CBD pre-lubes, suppositories, and flower have their rightful place on the night stand? Lioness users got down and dirty with cannabidiol to find out. Comparing suction and vibration clitoral stimulation. 5. Curious Collaboration of Lioness + Other Toys Why one when you can do two? Enhance your experience by combining the Lioness Smart Vibrator with other pleasure products, just like our team and other users have! Lioness + Magic Wand Lioness + LELO Sona Lioness + Zumio X Lioness + Crave Vesper Creating \"orgasm art\" through data visualization — the circle is the pelvic floor patterns (force), the moving circles are the amount of motion from moving the vibrator, and the speckles in the background is the amount of vibration used. 6. Creating Music from your Pleasure Data This pop star made music from her orgasm data (featured inVice) Create a song with orgasm data Comparing similarities/differences between vaginal and anal contractions during orgasm. 7. Anal Exploration & Smarter Butt Play If you don’t have a vagina, or if you’re just into butt stuff, the Lioness can safely be used for anal stimulation, providing valuable data about different types of sexual response and helping users understand the similarities and differences between various forms of stimulation. Vaginal and anal orgasm data: \"I DPed Myself to Prove that Asses and Vaginas do the Same Thing During Orgasm\" Using Lioness for anal: How to use the Lioness vibrator like a butt plug === Intrigued? Explore your orgasms and more with The Lioness Lioness is the first and only vibrator that helps you improve your orgasms. The world’s most advanced rabbit-style vibrator. Precision sensors let you literally see your arousal and orgasm. Experiment, understand yourself, and have better orgasms—after all, as the saying goes, “never measured, never improved.” Click here to learn more. Related Blog Posts How to Orgasm During Sex: Science-Based Guide for Women couples guide orgasm relationship by Anna Lee September 07, 2025 6 min read Read more Sexperiment Results: Does edging improve orgasms? Lioness users around the world delayed their orgasms for science. Here's what the data shows: data edging lioness vibrator by Kate Delgado August 29, 2025 2 min read Read more Sexperiment Results: Are Orgasms Better with After Warming Up the Clitoris? by Anna Lee August 06, 2025 3 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/how-people-have-explored-with-lioness-smart-vibrator"
    },
    {
      "title": "Sex Guides by Lioness",
      "content": "Sex Guides All Categories accessible alcohol anal anal play anatomy anorgasmia anxiety app asmr bdsm birth blow job bodily functions bondage book books butt caffeine cannabis cbd censorship clit pump clitoris communication coronavirus couples data dating dildo double penetration edging erotica female prostate femtech fetish fingering foreplay g-spot gender gender identity general gift guide guide health high tech high tech sex toy history holidays hormones internet intimacy iud kegel kink lgbtq+ libido lioness lioness vibrator live view long distance long distance relationship lube lubricants marijuana masturbation men menopause menstruation midlife music news non-monogamy oral sex orgasm parenthood parents pegging perimenopause period pleasurable pmdd pornography pregnancy prostate queefing rabbit vibrator relationship remote control research retail review science self-care senior sensory sex sex club sex clubs sex furniture sex life sex machine sex positions sex toy sex toys sexperiments social issues squirting storage storing sex toys swingers techniques technology testosterone traveling vacation vagina vibrator vr vulva women yoni eggs How to Orgasm During Sex: Science-Based Guide for Women by Anna Lee 6 min read Read more Sexperiment Results: Does edging improve orgasms? Lioness users around the world delayed their orgasms for science. Here's what the data shows: by Kate Delgado 2 min read Read more How people have explored with Lioness There are a variety of ways people can explore with the Lioness Vibrator. Whether you have a question, want to improve pleasure or intimacy, or just want to have fun, there's always something new to explore. Plus, we are constantly adding new features and functionality via free iOS and Android app updates for even more ways to learn and play. We've included several examples of what you could do with Lioness. by Anna Lee 4 min read Read more Sexperiment Results: Are Orgasms Better with After Warming Up the Clitoris? by Anna Lee 3 min read Read more What does an orgasm look like? Lioness can show you. Who cares if your fingerprint has ridges or whorls. Want to know if your orgasmlooks like an avalanche, a volcano, or an ocean wave? by Kate Delgado 4 min read Read more Anal Orgasms Are Real: Comparing Vaginal Vs. Anal Orgasms That’s right, I’m writing a whole post about showing you my anal orgasm data in response to your sassy question. And even better, I’m going to show you what the anal orgasm data looks like compared to my vaginal orgasm data from the same session through double penetration. by Anna Lee 3 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides"
    },
    {
      "title": "Sex Guides by Lioness Tagged \"lioness vibrator\"",
      "content": "Sex Guides All Categories accessible alcohol anal anal play anatomy anorgasmia anxiety app asmr bdsm birth blow job bodily functions bondage book books butt caffeine cannabis cbd censorship clit pump clitoris communication coronavirus couples data dating dildo double penetration edging erotica female prostate femtech fetish fingering foreplay g-spot gender gender identity general gift guide guide health high tech high tech sex toy history holidays hormones internet intimacy iud kegel kink lgbtq+ libido lioness lioness vibrator live view long distance long distance relationship lube lubricants marijuana masturbation men menopause menstruation midlife music news non-monogamy oral sex orgasm parenthood parents pegging perimenopause period pleasurable pmdd pornography pregnancy prostate queefing rabbit vibrator relationship remote control research retail review science self-care senior sensory sex sex club sex clubs sex furniture sex life sex machine sex positions sex toy sex toys sexperiments social issues squirting storage storing sex toys swingers techniques technology testosterone traveling vacation vagina vibrator vr vulva women yoni eggs Sexperiment Results: Does edging improve orgasms? Lioness users around the world delayed their orgasms for science. Here's what the data shows: by Kate Delgado 2 min read Read more How people have explored with Lioness There are a variety of ways people can explore with the Lioness Vibrator. Whether you have a question, want to improve pleasure or intimacy, or just want to have fun, there's always something new to explore. Plus, we are constantly adding new features and functionality via free iOS and Android app updates for even more ways to learn and play. We've included several examples of what you could do with Lioness. by Anna Lee 4 min read Read more What does an orgasm look like? Lioness can show you. Who cares if your fingerprint has ridges or whorls. Want to know if your orgasmlooks like an avalanche, a volcano, or an ocean wave? by Kate Delgado 4 min read Read more Anal Orgasms Are Real: Comparing Vaginal Vs. Anal Orgasms That’s right, I’m writing a whole post about showing you my anal orgasm data in response to your sassy question. And even better, I’m going to show you what the anal orgasm data looks like compared to my vaginal orgasm data from the same session through double penetration. by Anna Lee 3 min read Read more Revolutionizing Pleasure: The Lioness Smart Vibrator's Game-Changing Features Whether closing the orgasm gap, improving partner intimacy, or understanding your body better, the Lioness offers a science-backed path to better orgasms. by Kate Delgado 3 min read Read more Sexperiment Results: Does Scheduling Your O's Actually Make Them Better? Spoiler alert: The data says yes, and we're here for it. by Kate Delgado 3 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/tagged/lioness-vibrator"
    },
    {
      "title": "Sex Guides by Lioness Tagged \"anatomy\"",
      "content": "Sex Guides All Categories accessible alcohol anal anal play anatomy anorgasmia anxiety app asmr bdsm birth blow job bodily functions bondage book books butt caffeine cannabis cbd censorship clit pump clitoris communication coronavirus couples data dating dildo double penetration edging erotica female prostate femtech fetish fingering foreplay g-spot gender gender identity general gift guide guide health high tech high tech sex toy history holidays hormones internet intimacy iud kegel kink lgbtq+ libido lioness lioness vibrator live view long distance long distance relationship lube lubricants marijuana masturbation men menopause menstruation midlife music news non-monogamy oral sex orgasm parenthood parents pegging perimenopause period pleasurable pmdd pornography pregnancy prostate queefing rabbit vibrator relationship remote control research retail review science self-care senior sensory sex sex club sex clubs sex furniture sex life sex machine sex positions sex toy sex toys sexperiments social issues squirting storage storing sex toys swingers techniques technology testosterone traveling vacation vagina vibrator vr vulva women yoni eggs Take Your Time: Why 10 Minutes of Clitoral Stimulation Could Be Your Secret to Better Pleasure What if 10 minutes is all it takes to get from here to better orgasms? by Kate Delgado 3 min read Read more Yes, Clitoris Erections are Real If you're reading this with your mouth hanging open and thinking, \"What? Clitoral erection? Internal part of the clitoris?\" you're not alone, and I hold no judgment. But yes, ﻿clitorises have erections. by Lioness Team 4 min read Read more Everything You Need to Know About Vaginal Bleaching There are a lot of expectations around the idea of perfection and how we \"should\" look, and the vulva has not escaped these unrealistic beauty ideals. In the quest for perfect-looking genitalia, many are turning to cosmetic procedures such as labiaplasty, laser hair removal, and the latest trend — vaginal bleaching. by Lioness Team 6 min read Read more Leave it alone!: 3 Tips to Clean Your Vagina the Healthy Way Your vagina works hard for you and sometimes it needs to breathe. Things like scrubbing your vagina with soap and shaving every single day is not only annoying for you, but potentially unhealthy for your vulva and vagina! Remember, your vagina is your BFF. How would you treat them after a hard day’s work? We’re not saying you can’t shave or wash down there every day. You can even stay unshaven! We’re simply saying to take a moment to consider whether you’re promoting your vaginal health or not. by Lioness Team 4 min read Read more Female Prostate: Science, Anatomy & How to Find it What is the female prostate? Is it the same thing as the g-spot? And what in the world do I do with it? We'll explore both scientifically and practically. by James Wang 4 min read Read more What Does A \"Normal\" Vulva Look Like? Between pornography and media portrayals of scantily-clad women, there has become a stereotype of what the ideal vulva looks like. \"Normal\" now almost looks like a Barbie doll. We'll talk about how we got here, and what is actually normal. by Lioness Team 9 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/tagged/anatomy"
    },
    {
      "title": "Sex Guides by Lioness Tagged \"orgasm\"",
      "content": "Sex Guides All Categories accessible alcohol anal anal play anatomy anorgasmia anxiety app asmr bdsm birth blow job bodily functions bondage book books butt caffeine cannabis cbd censorship clit pump clitoris communication coronavirus couples data dating dildo double penetration edging erotica female prostate femtech fetish fingering foreplay g-spot gender gender identity general gift guide guide health high tech high tech sex toy history holidays hormones internet intimacy iud kegel kink lgbtq+ libido lioness lioness vibrator live view long distance long distance relationship lube lubricants marijuana masturbation men menopause menstruation midlife music news non-monogamy oral sex orgasm parenthood parents pegging perimenopause period pleasurable pmdd pornography pregnancy prostate queefing rabbit vibrator relationship remote control research retail review science self-care senior sensory sex sex club sex clubs sex furniture sex life sex machine sex positions sex toy sex toys sexperiments social issues squirting storage storing sex toys swingers techniques technology testosterone traveling vacation vagina vibrator vr vulva women yoni eggs How to Orgasm During Sex: Science-Based Guide for Women by Anna Lee 6 min read Read more What does an orgasm look like? Lioness can show you. Who cares if your fingerprint has ridges or whorls. Want to know if your orgasmlooks like an avalanche, a volcano, or an ocean wave? by Kate Delgado 4 min read Read more Anal Orgasms Are Real: Comparing Vaginal Vs. Anal Orgasms That’s right, I’m writing a whole post about showing you my anal orgasm data in response to your sassy question. And even better, I’m going to show you what the anal orgasm data looks like compared to my vaginal orgasm data from the same session through double penetration. by Anna Lee 3 min read Read more Should I have an orgasm before going to sleep? Lioness's very own Resident Sex Educator Kate gets into what we know (and what we don't) about orgasms before bedtime. by Kate Delgado 3 min read Read more 5 Reasons why you can’t orgasm anymore We know it’s not ALL about the O…but sometimes it is, right? by Kate Delgado 3 min read Read more Edging: Controlling orgasms for better orgasms What if I told you there was a way to have better orgasms — no new toys, no fancy lubes, and no partner needed? by Kate Delgado 3 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/tagged/orgasm"
    },
    {
      "title": "Sex Guides by Lioness Tagged \"masturbation\"",
      "content": "Sex Guides All Categories accessible alcohol anal anal play anatomy anorgasmia anxiety app asmr bdsm birth blow job bodily functions bondage book books butt caffeine cannabis cbd censorship clit pump clitoris communication coronavirus couples data dating dildo double penetration edging erotica female prostate femtech fetish fingering foreplay g-spot gender gender identity general gift guide guide health high tech high tech sex toy history holidays hormones internet intimacy iud kegel kink lgbtq+ libido lioness lioness vibrator live view long distance long distance relationship lube lubricants marijuana masturbation men menopause menstruation midlife music news non-monogamy oral sex orgasm parenthood parents pegging perimenopause period pleasurable pmdd pornography pregnancy prostate queefing rabbit vibrator relationship remote control research retail review science self-care senior sensory sex sex club sex clubs sex furniture sex life sex machine sex positions sex toy sex toys sexperiments social issues squirting storage storing sex toys swingers techniques technology testosterone traveling vacation vagina vibrator vr vulva women yoni eggs Take Your Time: Why 10 Minutes of Clitoral Stimulation Could Be Your Secret to Better Pleasure What if 10 minutes is all it takes to get from here to better orgasms? by Kate Delgado 3 min read Read more Riding the Crimson Wave: Why (and how) to masturbate on your period by Kate Delgado 4 min read Read more Should masturbation be a part of your routine? Do you pencil in pleasure? by Kate Delgado 4 min read Read more 5 Places to Masturbate that Aren't Your Bedroom Novelty (especially for women and people with vaginas) is scientifically proven to improve pleasure, arousal, and orgasm by Kate Delgado 3 min read Read more A guide to mindful masturbation One more great way to delve into your solo play and get every single moment of pleasure out of it. by Kate Delgado 3 min read Read more How to set the mood for masturbation Creating an ambiance for your solo sex can elevate your experience, increase arousal, and maybe even lead to better orgasms. Here’s how to do it: by Kate Delgado 3 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/tagged/masturbation"
    },
    {
      "title": "Sex Guides by Lioness Tagged \"relationship\"",
      "content": "Sex Guides All Categories accessible alcohol anal anal play anatomy anorgasmia anxiety app asmr bdsm birth blow job bodily functions bondage book books butt caffeine cannabis cbd censorship clit pump clitoris communication coronavirus couples data dating dildo double penetration edging erotica female prostate femtech fetish fingering foreplay g-spot gender gender identity general gift guide guide health high tech high tech sex toy history holidays hormones internet intimacy iud kegel kink lgbtq+ libido lioness lioness vibrator live view long distance long distance relationship lube lubricants marijuana masturbation men menopause menstruation midlife music news non-monogamy oral sex orgasm parenthood parents pegging perimenopause period pleasurable pmdd pornography pregnancy prostate queefing rabbit vibrator relationship remote control research retail review science self-care senior sensory sex sex club sex clubs sex furniture sex life sex machine sex positions sex toy sex toys sexperiments social issues squirting storage storing sex toys swingers techniques technology testosterone traveling vacation vagina vibrator vr vulva women yoni eggs How to Orgasm During Sex: Science-Based Guide for Women by Anna Lee 6 min read Read more What’s mine is yours: A guide to STIs and sharing sex toys With a little sex education, proper boundaries, and intention, sharing sex toys can be a really great way to connect in the bedroom. by Kate Delgado 4 min read Read more Foreplay for busy people living in 2023 What is foreplay, if not intimacy preserving? by Kate Delgado 3 min read Read more How To Make A Woman Orgasm If you’re wondering how to make a woman orgasm, this is for you…but pay attention closely because it may not be what you think. by Kate Delgado 4 min read Read more Why do women fake orgasms? by Kate Delgado 4 min read Read more What's a \"Yes, No, Maybe\" List? Looking to take inventory of your sexual preferences and interests? Look no further than a Yes, No, Maybe list. by Lioness Team 4 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/tagged/relationship"
    },
    {
      "title": "Sex Guides by Lioness Tagged \"health\"",
      "content": "Sex Guides All Categories accessible alcohol anal anal play anatomy anorgasmia anxiety app asmr bdsm birth blow job bodily functions bondage book books butt caffeine cannabis cbd censorship clit pump clitoris communication coronavirus couples data dating dildo double penetration edging erotica female prostate femtech fetish fingering foreplay g-spot gender gender identity general gift guide guide health high tech high tech sex toy history holidays hormones internet intimacy iud kegel kink lgbtq+ libido lioness lioness vibrator live view long distance long distance relationship lube lubricants marijuana masturbation men menopause menstruation midlife music news non-monogamy oral sex orgasm parenthood parents pegging perimenopause period pleasurable pmdd pornography pregnancy prostate queefing rabbit vibrator relationship remote control research retail review science self-care senior sensory sex sex club sex clubs sex furniture sex life sex machine sex positions sex toy sex toys sexperiments social issues squirting storage storing sex toys swingers techniques technology testosterone traveling vacation vagina vibrator vr vulva women yoni eggs What’s mine is yours: A guide to STIs and sharing sex toys With a little sex education, proper boundaries, and intention, sharing sex toys can be a really great way to connect in the bedroom. by Kate Delgado 4 min read Read more Riding the Crimson Wave: Why (and how) to masturbate on your period by Kate Delgado 4 min read Read more Should I have an orgasm before going to sleep? Lioness's very own Resident Sex Educator Kate gets into what we know (and what we don't) about orgasms before bedtime. by Kate Delgado 3 min read Read more 5 Reasons why you can’t orgasm anymore We know it’s not ALL about the O…but sometimes it is, right? by Kate Delgado 3 min read Read more Am I Masturbating Too Much? In the true spirit of destigmatizing sexual health and wellness, let’s answer the question “how much is too muchmasturbation?” by Kate Delgado 3 min read Read more 3 Lube Ingredients to Avoid at All Costs If no one has ever told you what to watch out for in a sex lube, here are three lube ingredients to avoid at all costs: by Kate Delgado 3 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/tagged/health"
    },
    {
      "title": "CBD Products at Lioness",
      "content": "All CBD Products cbd Featured Best Selling Alphabetically: A-Z Alphabetically: Z-A Price: Low to High Price: High to Low Date: New to Old Date: Old to New Vella Pleasure Serum Vella Pleasure Serum $65.00 USD Quick View Vella Pleasure Serum $65.00 USD Foria Intimacy Melts Foria Intimacy Melts $20.00 USD Quick View Foria Intimacy Melts $20.00 USD Foria Booty Melts Foria Booty Melts $34.00 USD Quick View Foria Booty Melts $34.00 USD Sale Everything But the O Bundle Everything But the O Bundle $309.00 USD $348.00 USD Quick View Everything But the O Bundle $309.00 USD $348.00 USD",
      "content_type": "other",
      "source_url": "https://lioness.io/collections/cbd-products"
    },
    {
      "title": "All Products - Lioness",
      "content": "Search 0 Cart Shop Lioness Vibrator Lioness Charger Cable Everything but the O Bundle How It Works How Lioness Vibrator Works Live View Remote Control Participate in Research Reviews Research FAQ Frequently Asked Questions Sezzle Now, Pay Later How People Have Explored With Lioness Sex Guides Lioness Vibrator Anatomy Orgasm Masturbation Relationships Health See All Guides 0 Cart THE VIBRATOR Lioness Smart VibratorThe Ultimate O BundleSpare charger THE CBD Vella Pleasure SerumForia Intimacy MeltsForia Booty Melts THE MERCH StickersHatsSocksTote bagsShop All All Products All All Products app bluetooth cbd charger Extend Extend Protection Plan rabbit vibrator smart vibrator vibrator Featured Best Selling Alphabetically: A-Z Alphabetically: Z-A Price: Low to High Price: High to Low Date: New to Old Date: Old to New Check out the Lioness Smart Vibrator 2.0. Shop Sale Everything But the O Bundle Everything But the O Bundle $309.00 USD $348.00 USD Quick View Everything But the O Bundle $309.00 USD $348.00 USD Lioness Smart Vibrator Lioness Smart Vibrator $229.00 USD Quick View Lioness Smart Vibrator $229.00 USD Charger Cable for Lioness Vibrator Charger Cable for Lioness Vibrator $5.00 USD Quick View Charger Cable for Lioness Vibrator $5.00 USD Lioness Gift Card Lioness Gift Card from $25.00 USD Quick View Lioness Gift Card from $25.00 USD Lioness Dog Toy Lioness Dog Toy $15.00 USD Quick View Lioness Dog Toy $15.00 USD Sale Lioness Vibrator + Dog Toy Bundle Lioness Vibrator + Dog Toy Bundle $219.00 USD $244.00 USD Quick View Lioness Vibrator + Dog Toy Bundle $219.00 USD $244.00 USD Questions With Benefits Card Game Questions With Benefits Card Game $20.00 USD Quick View Questions With Benefits Card Game $20.00 USD May the O's Be With You Card May the O's Be With You Card $5.00 USD Quick View May the O's Be With You Card $5.00 USD Foria Intimacy Melts Foria Intimacy Melts $20.00 USD Quick View Foria Intimacy Melts $20.00 USD Foria Booty Melts Foria Booty Melts $34.00 USD Quick View Foria Booty Melts $34.00 USD Sticker Pack Sticker Pack $10.00 USD Quick View Sticker Pack $10.00 USD Team \"Do It for Science\" Hat Team \"Do It for Science\" Hat $25.00 USD Quick View Team \"Do It for Science\" Hat $25.00 USD Smart O's Tote Bag Smart O's Tote Bag $22.00 USD Quick View Smart O's Tote Bag $22.00 USD Socks for Science Socks for Science $22.00 USD Quick View Socks for Science $22.00 USD Search our shop What are you looking for? What are you looking for? One or more of the items in your cart is a recurring or deferred purchase. By continuing, I agree to the cancellation policy and authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted. Checkout:Agree:",
      "content_type": "other",
      "source_url": "https://lioness.io/collections/all"
    },
    {
      "title": "Meet the team behind the Lioness Smart Vibrator | Lioness",
      "content": "Search 0 Cart Shop Lioness Vibrator Lioness Charger Cable Everything but the O Bundle How It Works How Lioness Vibrator Works Live View Remote Control Participate in Research Reviews Research FAQ Frequently Asked Questions Sezzle Now, Pay Later How People Have Explored With Lioness Sex Guides Lioness Vibrator Anatomy Orgasm Masturbation Relationships Health See All Guides 0 Cart THE VIBRATOR Lioness Smart VibratorThe Ultimate O BundleSpare charger THE CBD Vella Pleasure SerumForia Intimacy MeltsForia Booty Melts THE MERCH StickersHatsSocksTote bagsShop All Team \"Do It For Science\"Anna LeeCo-founder, CEOAmazon, UC Berkeley EngineeringAs someone who grew up scared of her own body well into her mid-twenties, I've learned how powerful it can be to give ourselves the chance to truly learn about our own bodies. Knowledge is pleasure! James WangCo-founder, CTOCreative Ventures, Google XSexuality is a basic human need that’s been stigmatized for women for too long. I’m proud to be working with a great team to change the conversation.Maggie StigglemanSoftware EngineerI had two interests in college: Gender Studies and Computer Science. I hoped to be able to combine them one day but never actually thought I’d be that lucky. Turns out I am, god bless Lioness.Kate DelgadoChief Executive Assistant& Resident Sex EducatorLioness has been a dream come true! I wake up everyday grateful to be here, working towards a more orgasmic world one day at a time. A lot has changed since the 1980’s......but research on sexual pleasure hasn’t advanced much since then. This research doesn't exist in a bubble. It affects our personal understanding of our own unique bodies and pleasure—which is as essential of a human need as eating, sleeping, and breathing.Our mission at Lioness is to advance our knowledge and understanding of pleasure and provide access to knowledge for people to use on their own terms. There's so much more to learn, and we've barely gotten started. Despite the progress we've made, taboos around sexual pleasure are alive and well and still holding us back.Together, we can make a difference and change the way the world understands pleasure for women—and pleasure for everybody.See the Lioness Vibrator Search our shop What are you looking for? What are you looking for? One or more of the items in your cart is a recurring or deferred purchase. By continuing, I agree to the cancellation policy and authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted. Checkout:Agree:",
      "content_type": "other",
      "source_url": "https://lioness.io/pages/about"
    },
    {
      "title": "Lioness Vibrator In The News",
      "content": "Search 0 Cart Shop Lioness Vibrator Lioness Charger Cable Everything but the O Bundle How It Works How Lioness Vibrator Works Live View Remote Control Participate in Research Reviews Research FAQ Frequently Asked Questions Sezzle Now, Pay Later How People Have Explored With Lioness Sex Guides Lioness Vibrator Anatomy Orgasm Masturbation Relationships Health See All Guides 0 Cart THE VIBRATOR Lioness Smart VibratorThe Ultimate O BundleSpare charger THE CBD Vella Pleasure SerumForia Intimacy MeltsForia Booty Melts THE MERCH StickersHatsSocksTote bagsShop All Lioness In The NewsPeople around the world have been talking about the Lioness Smart Vibrator.Writing a story? Reach out at press@lioness.io.I Tested a 'Smart' Vibrator That Uses AI to Chart Your Orgasms\"WOWOW, buddy. This was fun. I hate to admit how fun it was, because I love to bitch, but looking at your orgasm seismograph thingy is so interesting and empowering, and it gave me a thrill I’d not felt since I’d last signed on to Neopets (2001?) to see how my Shoyru was doing (never satiated).\"I Tried This 'Smart' Vibrator for Two Weeks and Became an Orgasm Scientist\"[Before using Lioness], we hadn't talked about my satisfaction that openly and frankly before.\"I used a hi-tech vibrator to learn how cannabis affects my orgasms\"Hands down, Lioness is one of the most useful and pleasurable toys I’ve ever used. I’ve tested a bunch of toys in my 28 years of living, and this one takes the cake. Its strength is in its ability to teach you movements and peripheral arousal techniques that can work for you.\"I Tried These Smart Sex Toys and All I Got Was All This Data about My Orgasms\"[Lioness is] by far the smartest and most useful sex toy I’ve ever owned. I never thought something like this would be created where I can actually see my orgasm in the palm of my hands.\"The most innovative personal care products of 2021\"Deciphering personal pleasure can take lots of trial and error. The Lioness Vibrator 2.0 offers a potential shortcut.\"How cofounders behind the Lioness smart vibrator are closing the orgasm gap\"Following a $1.5 million raise, the Lioness launched its original product in 2017, which collected biometric data from users, who monitored their sexual experiences.\"Lioness Sex Toy Collects Data for Researchers Studying The Female Orgasm\"Luckily, we live in an era of Silicon Valley disruption, which has even started lapping at the shores of sex research. Technologist Liz Klinger is at the forefront of this transition. She and her team have built a platform that lets people become citizen scientists of sex —without ever having to get out from between the sheets.\"Presenting the Best of CES 2020 finalists!\"What's most intriguing about Lioness though are the insights you can glean about your overall health from patterns in your arousal.\"12 Of Refinery29’s Favorite Gadgets At CES\"Of all the sex tech showcased at CES, Lioness stood out in particular for its AI-assisted orgasm guidance.\"Lioness vibrator is finalist for CES Last Gadget Standing award\"The vibrator's nomination is surprising because of the CTA's controversial decision last year to strip a vibrator... Lioness was actually barred from attending CES in 2017 because of the sexual nature of its products.\"Is Sex Tech the Next Feminist Frontier?\"For Klinger, developing and launching [Lioness] is a natural extension of her art practice. 'My work was about learning and exploring my sexuality, trying to take the shame and stigma away from it,' she says. 'That’s what we do at Lioness: we’re recontextualizing sex and pleasure. Those can be abstract ideas for a lot of people but having this sort of data and these visuals allows people to actually see, and engage, with them.'\"14 Sex Tech Founders Who Are Changing The Way The World Thinks About Sex\"Korean American founder Anna Lee grew up in an immigrant Korean household where there was zero talk of sex or sexuality, which is why the mission behind Lioness is to answer questions around female pleasure and natural functions rarely discussed in the medical community.\"Will a ‘smart’ vibrator revolutionise female pleasure?\"Until now, I’d never seen my own orgasm. Nobody has. More mystifying than black holes, more elusive than the snow leopard and infinitely less extensively researched than either, the female orgasm remains a mysterious, enigmatic entity to many. Some, unable to coax it to appear, prefer simply to ignore its existence entirely. But now, thanks to the miracles of modern sextech, for £165 we can track it, map it and tag it.\"We're Having Gay Sex w/ Anna Lee of Lioness Health [PODCAST]\"You all have been begging for some sexual health science and Anna Lee will not disappoint! ... We get into how she discovered her own sexuality through building the viral tiktok sex toy, different types of orgasms, and DP (yes, *that* dp) Ashley does a data driven sexual experiment of her own.COVID-19 has had a surprising impact on our sex lives\"Lioness released a new exploratory study analyzing an in-depth dataset capturing how people's sex lives and drives were impacted by the pandemic. The data, which compares participants' habits from 2019 versus 2020, includes everything from how often participants masturbated to how long it took to orgasm. The main takeaway? 2020 might not have been the free-for-all cum fest all those trends implied.\"Lioness AI sex toy can teach you about your orgasms\"I found Liz Klinger, CEO of Lioness, in the health and wellness marketplace of CES. In a small booth, she was showing a vibrator with a patented biofeedback technology that she says can help you improve your sex life.\"Is Cannabis The Key To Longer-Lasting Sex?\"But Eaze, a popular online cannabis delivery service, believes that hard data is crucial to eliminating the stigma associated with indulging in the natural drug; that’s why they partnered with smart vibrator manufacturer Lioness for a fascinating study on how cannabis effects sex.\"Let's Talk Orgasms with Lioness Co-founder Anna Lee [PODCAST]\"Join us for a conversation with Anna Lee, co-founder of Lioness, the women-led sexual health startup that built the world's first and only smart vibrator that gives biofeedback data to help people learn more about their own bodies and improve their understanding of sexual pleasure. Anna is a big advocate in Lioness’s mission to expand research in sexual health and to destigmatize female sexuality.\"Best Tech of CES 2020\"The first generation of this biofeedback vibrator was one of our favorite high-tech sex toys for a reason. While the new Gen 2 is more of a massive firmware update, it greatly improves upon the core concept, giving folks with vaginas the ability to understand and track their orgasms through detailed data. Its applications are endless, a potential game-changer in both clinical and personal settings.\"This Smart Vibrator Understands You Better Than Your Partner\"As you might assume of a woman who’s dedicated herself to biofeedback vibrators, Anna is a badass. When I met her at South by Southwest a few months ago, she literally whipped it out and laid it on the lunch table in front of a bunch of nerds in polo shirts.\"4 Tips to Help You Masturbate Better\"Lioness, a sort of Fitbit for down below, learns your preferences and offers “if you like that, you’ll looooove this”–style tips.\"Female driven start-up launches smart sex toy for womenAnd in case you were wondering if there really is a market for such a toy: their ongoing crowdfunding campaign has already reached 189 percent of its $50,000 goal.The first smart vibrator will tell you what your orgasm isThe first smart vibrator allows women to not only delight themselves but also to explore the unique sexualityLet's talk about #sextech [PODCAST]When sex and technology cross paths, we see a combination of curiosity and censorship, sexism and empowerment, but most importantly, knowledge and pleasure. The intersection between sex and technology goes beyond sex toys—from smart vibrators to apps for your phone that allow you to track and learn from your own experiences—sex tech’s innovation plays a major factor in the future of women’s health and pleasure.Samsung allegedly removed a women’s sexual health stall from a women in tech eventAfter four hours, Klinger said she finally spoke to Samsung representatives that organized the event: “They said that Lioness shouldn’t be there because it “wasn’t women’s health,” Klinger said. “I told them about our biofeedback and data aspect and how we’re covering different research and presenting at healthcare and research conferences, they told me it wasn’t a wearable’ so the product still shouldn’t be there.”Would You Analyse Your Orgasm? Smart Vibrator ‘Lioness’ With Mobile App Gives You Insights on Your PleasureWomen have had a tough time figuring out what satisfies them sexually and gives them an orgasm and this app is aiming to change just that... The Lioness wearable vibrator provides a map of your orgasm and has already shed light on the different types of orgasm like single, more intense release, while others experience a climax as smaller waves.Sex Ed 201 [VIDEO]Co-founder and CEO Liz Klinger presented at TEDx Oakland themed \"Shaping Tomorrow.\" Showcasing Oakland’s best ideas to the world, and also bringing great ideas from the world to the TEDxOakland community to inform and drive change in our city. It will be a day of stimulating presentations, discussions, entertainment, and arts that will bend perceptions, Inspire Curiosity and spark new ideas in our community and beyond.How Cannabis Can Improve Your Sex LifeEaze partnered with Lioness — maker of smart vibrators with climax-tracking sensors — to study THC and CBD in the bedroom.How I found the right cannabis strain for sexYou may have seen the news stories about how cannabis can improve sex and make you more orgasmic—or you may already know that from personal experience.Artgasm turns the female orgasm into a literal work of art [VIDEO]It's easy to dismiss Artgasm as crass or unnecessary, but the individual art pieces offer a way to at least attempt to talk about orgasms in a dignified, mature way. Many women struggle to talk about what they like in the bedroom, and some might not even have the vocabulary to express what exactly turns them on. Lioness plans to add the ability for its users to create their own orgasm artwork, so in a few months you may be able to see what it looks like when you orgasm, too. When you can see what's causing a person to respond the way they do, you can better understand how to pleasure yourself or your partner. The world would be a much happier place if more of us knew how to orgasm more consistently.Not again: Samsung removes women’s first smart vibrator from ‘women in tech’ eventBased on emails reviewed by The Hustle, Liz Klinger, the co-founder and CEO of Lioness, was approved by Samsung’s Developer Program to present her company’s flagship product — aptly dubbed the Lioness Vibrator — back in July. Within the first few hours of the conference, Klinger was asked to remove her product from the event without explanation. Naturally, she wanted answers.Activism 2.0: Smart vibrator changes conversation about sex [VIDEO]This video, the first in the series, explores the subject of women’s sexuality and sexual education.This Biohacking Vibrator Is Like a Fitbit for Your VaginaA new generation of “smart” sex toys are giving women the option to take control of their own pleasure in ways never before possible.Here Are The 5 Best Vibrators Worth Investing In Right Now[Lioness] also explores patterns, takes notes and includes a feature for users to write their own sex diaries.This Pop Star Turned Her Orgasm Into a SongVon dragged the Lioness waves into the wavetable operator... manipulating them to craft music.The Female Orgasm Comes (Quietly) to the Streets of San FranciscoYou can see it almost a block away: the word 'orgasm' in gigantic letters on a San Francisco bus shelter...'You're your own science researcher'The Lioness Vibrator, described by the company as a “smart vibrator for biofeedback and self-discovery,” costs $229 and records patterns of ...Lioness’ Artgasm visualizes female orgasms with vibrator dataLioness makes a sex toy that is akin to the Fitbit of vibrators, and it is using the data from its biofeedback sensor to visualize female orgasms as works of art.Woman Does Lord's Work, Makes Smart Vibrator\"[It's] like a Fitbit for your cooch.\"Meet the smart vibrator that wants to help you learn how to have a better orgasmThis is particularly clutch for women who've had issues with their sex drive or with not achieving orgasm...This Lioness vibrator is basically a FitBit for your vaginaThis tech works out what gets you going... meaning you can wise up on how best to get yourself to orgasm.Lioness' Bus Stop Ads Show Real Female Orgasms — In Data ChartsStarting June 18, San Francisco residents will have an unexpected element added to their commutes: Female orgasms — in disguise. There won’t be any O-faces or body parts or even sex toys. Instead, these are ads that feature a data chart of an orgasm. The images were collected by people using Lioness, a smart vibrator that tracks pelvic floor contractions during orgasm.An Orgasm App? UC Berkeley-Nurtured Tech Team Launches its “Smart” VibratorWave energy. A portable spirometer for kids with asthma. Tools to lower the carbon footprint. A robot-building kit. These are just a few examples of what UC Berkeley startups are developing at the Foundry, Cal’s technology incubator. But Liz Klinger and James Wang are working on something else entirely: a smart vibrator.Getting Intimate with Your Prototype: Lioness SpotlightLioness, a startup in the hardware manufacturing space, has an extra challenge—they design and manufacture vibrators for women. This is a space that has been taboo for a long time. Not only has it been difficult for people to talk about this particular type of product, there have been few best practices and lots of poorly designed models.Like GPS, but for your sex drive [PODCAST]These days so many of our devices are smart. Our phones are smart. Our cars are smart. Our TVs are smart. And now, even vibrators can be smart.This Smart Sex Toy Is Mapping Out Pleasure For Women Everywhere\"Berkeley-based Lioness Inc. is committed to giving women the best and most pleasurable experience technology will allow, but the idea for their debut toy of the same name arose from a desire to learn, too.\"The 3 Kinds of Orgasm Your Partner Is Having\"On a long list of things guys have given up on trying to understand, the female orgasm is likely near the top. Just when you think you've finally deciphered its secrets, you find yourself at a dead end. But there's a vibrator out there that may be the key to cracking the code.\"Are There Different Kinds Of Orgasms? That Lioness Vibrator Can Tell You What Kind You HaveNot all orgasms are created equally. And I'm not talking about having a great orgasm one day and a dud the next. New data from Lioness, a vibrator specifically designed to help you to help you learn about your body by sending data about your sexual responses to an app, found that different people have [at least] three different types of orgasm patterns.Episode 81: Lioness: The Vibrator that Tracks your Orgasms [PODCAST]Liz dives into the genesis of the product, the current status and how pleasure is different for every woman and the hope for Lioness in the future.Meet The Smart Vibrator That Tracks Your OrgasmsWhat was once an idea from two UC Berkeley engineers is now a reality — and an empowering, innovative, sexy reality at that.Could A Smart Vibrator Revolutionize The Way We Talk About Sex?Lioness is so much more than ‘just a vibrator’ — it’s out to shift social mores.The Vibrator That Tries To Figure Out The Female OrgasmThe hope is for women to use the info gleaned the same way you might use your Fitbit’s sleep data: to figure out what works and tweak your routine. Only the reward here isn’t a good night’s rest.Meet The Queer Women Behind The First Vibrator For ‘Self-Experimentation’It’s honestly some sort of empowering-vibrator-tech-witchery...The Vibrator of the Future Is Here — And Women Should Be ExcitedIn believing that true pleasure is only a conversation away, the pair have developed their new technology to encourage women's curiosity about themselves and each other.From Berkeley startup incubator, a ‘smart’ vibrator is bornThese days so many of our devices are smart. Our phones are smart. Our cars are smart. Our TVs are smart. And now, even vibrators can be smart.Asian Women Creators You Need to KnowThe taboo of women's sexual pleasure and lack of research done on women's sexual health leaves so many women, including myself, asking, 'Am I normal?' We created Lioness to help women self-experiment and explore their own body through data to answer the question with 'Yes!'This Smart Vibrator Actually Tracks Your OrgasmsSo, if you are looking to indulge your type-A personality while having the Big-O, we’ve got good news for you: You totally fucking can. There’s a smart vibrator that will not only get your rocks off, but it will teach you how to do it better and faster for the next inning (see what I did there?).This \"Smart\" Vibrator Tells You Everything You'd Ever Want to Know About Your OrgasmsA \"smart\" vibrator is a genius invention, says Sheryl Ross, M.D., an OBGYN and women's health expert... any tool that helps you connect to your body can help increase pleasure-a win that goes beyond mind-blowing orgasms.Can Weed Help You Have Better Orgasms?Experts tell us what this smart vibrator seems to already know: Weed can have a profound effect on your orgasm.The Lioness Vibrator is Basically Your Sexual Fitbit: An Interview with CEO Liz KlingerSo, rather than allowing magazines, friends, porn, the internet, and any other secondary source to tell us about our own bodies, let’s take matters into our own hands (literally).There's Now A Fitness Tracker For Your OrgasmsGet ready to learn a whole lot more about your sex life.A vibrator is not a substitute for a partner. But how do you tell men that?The creators hope that its accompanying app, which visualizes the data, will make it easier for women to talk about their sexuality with partners...Destigmatizing Sex With An Orgasm-Tracking VibratorIt doesn’t matter how much you already know, anyone can benefit from some sexual exploration. A willingness to be curious, learn more, and expand our minds would do us a lot of good in matters of life and sex.Lioness Helps Women Understand Their Sexual Pleasure By Tracking and Analyzing OrgasmsThe vibrator and app combo aid women as they self-experiment and investigate how different factors – including mood, stress, alcohol, and different partners – can change their arousal and orgasms.A vibrator is not a substitute for a partner. But how do you tell men that?The creators hope that its accompanying app, which visualizes the data, will make it easier for women to talk about their sexuality with partners...Destigmatizing Sex With An Orgasm-Tracking VibratorIt doesn’t matter how much you already know, anyone can benefit from some sexual exploration. A willingness to be curious, learn more, and expand our minds would do us a lot of good in matters of life and sex. Search our shop What are you looking for? What are you looking for? One or more of the items in your cart is a recurring or deferred purchase. By continuing, I agree to the cancellation policy and authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted. Checkout:Agree:",
      "content_type": "other",
      "source_url": "https://lioness.io/pages/press-lioness-vibrator-in-the-news"
    },
    {
      "title": "Terms of Service | Lioness",
      "content": "Terms of Service TERMS OF SERVICE FOR SMARTBOD INCORPORATED, DBA LIONESS Effective Date: May 1, 2017Last Updated: May 1, 2017 Lioness is a registered trademark and trade name of SmartBod Incorporated. SmartBod Incorporated DBA/operating as Lioness is henceforth referred to as “Lioness” in these Terms of Service, unless explicitly noted otherwise. INTRODUCTION TO TERMS OF SERVICE SmartBod Incorporated DBA Lioness (“Lioness”) designs and builds vibrators and software that help women learn more about their own bodies. These Terms of Service (“Terms”) govern your use of our vibrators and other devices or products, our websites, including but not limited to lioness.io, Lioness software, including but not limited to the software embedded in Lioness devices, Lioness mobile applications, memberships and other Lioness services (collectively, the “Lioness Service”). You must accept these Terms to create a Lioness account and to use the Lioness Service. If you do not have an account, you accept these Terms by visiting lioness.io or using any part of the Lioness Service. By creating a Lioness account or by using any part of the Lioness Service, you expressly represent and warrant to Lioness that you are over the age of 18 and are legally competent to enter into agreements. IF YOU DO NOT ACCEPT THESE TERMS, DO NOT CREATE AN ACCOUNT, VISIT LIONESS.IO OR USE THE LIONESS SERVICE. THESE TERMS MAY CHANGE These Terms will change over time. Lioness reserves the right to periodically change these Terms without notice, and such changes will be effective as of the date they are posted. You are responsible for checking this page frequently for any updates or other changes. We may notify you by email, through the Lioness Service, or by presenting you with a new Terms of Service to accept if we make a modification that materially changes your rights. When you use the Lioness Service after a modification is posted, you are telling us that you accept the modified terms. INTELLECTUAL PROPERTY Lioness is the owner of the compilation of content that is posted on the Lioness Service, including all text, images, audio and video clips, design, databases, codes, and software (“Content”), but it does not necessarily own all the material within this compilation. The Content may be owned by Lioness, owned by others and used with their permission, or used in accordance with applicable law. Some Content is in the public domain and some Content is protected by third party rights such as copyright, trademark, rights of publicity, privacy, and contractual restrictions. WHO CAN USE LIONESS? You may use the Lioness Service if you are over 18 years of age and are not barred from receiving services under applicable law. You may connect to the Lioness Service using a device that is manufactured, distributed, or sold by or on behalf of Lioness; the Lioness mobile applications; the Lioness software; approved third-party applications; or lioness.io (“Authorized Connections”). You may not connect to the Lioness Service with any device that is not manufactured, distributed, sold by or on behalf of Lioness (such as a knock-off or counterfeit version of a Lioness Product), or otherwise intends to resemble or purports to be a Lioness Product. You may not connect to the Lioness Service through any unauthorized application or-third party connection. Any violation or attempted violation of this provision may result in the immediate termination of your ability to access the Lioness Service. If you have questions about whether a product or application qualifies as an Authorized Connection, please contact help@lioness.io. CREATING AN ACCOUNT Full use of the Lioness Service requires that you create an account by providing us with a valid email address and password. You are responsible for all activity that occurs in association with your account. Lioness is not liable for any loss or damages caused by your failure to maintain the confidentiality of your account credentials. We may need to contact you about your use of the Lioness Service. These communications are part of the Lioness Service and you may not opt-out from receiving them. You can opt-out from receiving other communications. NECESSARY EQUIPMENT Full use of the Lioness Service is dependent upon your use of a computer with adequate software or a supported mobile device and Internet access. The maintenance and security of this equipment may influence the performance of the Lioness Service and it is your responsibility to ensure the equipment’s functionality. POSTING YOUR CONTENT ON THE LIONESS SERVICE You may post photos, comments, and other content (“Your Content”) to the Lioness Service. You retain all rights to Your Content that you post to the Lioness Service. By making Your Content available on or through the Lioness Service you grant to Lioness a non-exclusive, perpetual, irrevocable, transferable, sublicensable, worldwide, royalty-free license to use, copy, modify, excerpt (in whole or in part), adapt, publish, publicly display, publicly perform and distribute Your Content. You are responsible for Your Content. You represent and warrant that you own Your Content or that you have all rights necessary to grant us a license to use Your Content as described in these Terms. You also represent and warrant that Your Content and the use and provision of Your Content on the Lioness Service will not: (a) infringe, misappropriate or violate a third party’s patent, copyright, trademark, trade secret, moral rights or other intellectual property rights, or rights of publicity or privacy; (b) violate, or encourage any conduct that would violate, any applicable law or regulation or would give rise to civil liability; (c) be fraudulent, false, misleading or deceptive; (d) be defamatory, obscene, pornographic, vulgar or offensive; (e) promote discrimination, bigotry, racism, hatred, harassment or harm against any individual or group; (f) be violent or threatening or promote violence or actions that are threatening to any person or entity; or (g) promote illegal or harmful activities or substances. You also agree that Your Content will comply with the following community guidelines: Be respectful of the opinions of others. Even though you might not agree with someone, that doesn't mean they are wrong or deserve to be belittled. Remember that what works for you may not work for everyone else. Give everyone the same courtesy you would expect in return. Do not post profane or explicit content. Do not post profile pictures that might be considered inappropriate. Do not post communications that could be interpreted as threatening or harassing. Do not post, advertise, or promote products or services commercially. LIONESS’S RIGHTS “Lioness Content” includes any text, graphics, images, music, software, audio, video, works of authorship of any kind, and information or other materials that are posted, generated, provided or otherwise made available through the Lioness Service to you. Except for Your Content, Lioness Content, the Lioness Service and its underlying technology are protected by copyright, trademark, patent, intellectual property, and other laws of the United States and foreign countries. You agree not to remove, change or obscure any copyright, trademark, service mark or other proprietary rights notices incorporated in or accompanying the Lioness Service. WHAT YOU CAN DO ON THE LIONESS SERVICE The Lioness Service is intended for your personal, non-commercial use. Lioness grants you a limited, non-exclusive, non-transferable, non-sublicensable license to (1) access and view the Lioness Content, (2) access and use the software and mobile applications provided by the Lioness Service, and (3) use the software that is embedded into Lioness products as authorized in these Terms. This license is provided solely for your personal use and enjoyment of the Lioness Service as permitted in these Terms. You will not use, copy, adapt, modify, prepare derivative works based upon, distribute, license, sell, transfer, publicly display, publicly perform, transmit, broadcast or otherwise exploit the Lioness Content, Lioness Service or any portion thereof, except as expressly permitted in these Terms. No licenses or rights are granted to you by implication or otherwise under any intellectual property rights owned or controlled by Lioness or its licensors, except for the licenses and rights expressly granted in these Terms. THINGS YOU CANNOT DO ON THE LIONESS SERVICE Except to the extent permitted by law, you may not perform, attempt to perform, or encourage or assist others in performing any of the following while accessing or using the Lioness Service: (1) use, display, mirror or frame the Lioness Service or any individual element within the Lioness Service, Lioness’s name, any Lioness trademark, logo or other proprietary information, or the layout and design of any page or form contained on a page, without Lioness’s express written consent; (2) access or tamper with non-public areas of the Lioness Service, Lioness’s computer systems, or the technical delivery systems of Lioness’s providers; (3) test the vulnerability of any Lioness system or breach any security or authentication measures; (4) circumvent any technological measure implemented by Lioness or any of Lioness’s providers or any other third party (including another user) to protect the Lioness Service or Lioness Content; (5) access the Lioness Service or Lioness Content through the use of any mechanism other than through the use of an Authorized Connection, Lioness Service or Lioness API; or (6) modify, decompile, disassemble, reverse engineer, tamper with or otherwise attempt to derive the source code of any software that Lioness provides to you or any other part of the Lioness Service. OUR ENFORCEMENT RIGHTS We are not obligated to monitor access or use of the Lioness Service, Lioness Content, or Your Content or to review or edit any Lioness Content or Your Content. However, we have the right to do so for the purpose of operating the Lioness Service, to ensure compliance with these Terms, and to comply with applicable law or other legal requirements. We may consult with and disclose unlawful conduct to law enforcement authorities; and pursuant to valid legal process, we may cooperate with law enforcement authorities to prosecute users who violate the law. We reserve the right (but are not required) to remove or disable access to the Lioness Service, any Lioness Content, or Your Content at any time and without notice, and at our sole discretion, if we determine that the Lioness Content, Your Content, or your use of the Lioness Service is objectionable or in violation of these Terms. We have the right to investigate violations of these Terms and any conduct that affects the Lioness Service. DMCA/COPYRIGHT POLICY Lioness respects copyright law and expects its users to do the same. Lioness does not permit copyright infringing activities and infringement of any other intellectual property rights on the Lioness Service, and will remove all Content if properly notified that such Content infringes on another's intellectual property rights. Lioness reserves the right to remove Content without prior notice. It is Lioness’s policy to terminate in appropriate circumstances account holders who repeatedly infringe the rights of copyright holders. If you are a copyright owner or an agent thereof and believe in good faith that any materials on the Website infringe upon your copyrights, you may submit a notification pursuant to the Digital Millennium Copyright Act by sending the following information in writing to Lioness’s designated copyright agent at help@lioness.io. Your name and electronic signature of a person authorized to act on behalf of the owner of the exclusive right that is allegedly infringed; A description of the copyrighted work that you claim has been infringed. If this notice covers multiple copyrighted works, you may provide a representative list of the copyrighted works that you claim have been infringed; A description of the material that you claim is infringing (or to be the subject of infringing activity) and information reasonably sufficient to permit us to locate the material; Information sufficient to contact you, including your mailing address, telephone number, and, if available, email address; A statement that you have a good faith belief that use of the material in the manner complained of is not authorized by the copyright owner, its agent, or the law; A statement that the information provided in the notice is accurate, and under penalty of perjury, that you are the owner, or agent thereof, of the copyright or of an exclusive right under the copyright that is allegedly infringed; and Your full legal name and your electronic or physical signature. If you believe that your content that has been removed from the Website does not infringe or that you have the authorization from the copyright owner, you may send a counter-notice to Lioness. To do so, send the following information to our copyright agent using the contact information set forth above. A description of the material that has been removed and the location at which the content appeared before it was removed; A statement that you have a good faith belief that the content was removed as a result of mistake or a misidentification of the content; Information sufficient to contact you, including your mailing address, telephone number, and, if available, email address; A statement that you will consent to the jurisdiction of the federal court for the judicial district in which your address is located, or if your address is outside of the United States, for any judicial district in which Lioness may be found; A statement that you will accept service of process from the person who provided the notification of the alleged infringement; and Your full legal name and your electronic or physical signature. If a counter-notice is received by Lioness’s copyright agent, Lioness may send a copy of the counter-notice to the original complaining party informing such person that Lioness may reinstate the removed content in 10 business days. Unless the copyright owner files an action seeking a court order against the content provider, member or user, the removed content may, at Lioness’s discretion, be reinstated on the Website in 10 to 14 business days or more after receipt of the counter-notice. USE THE LIONESS SERVICE AT YOUR OWN RISK Our goal is to provide helpful and accurate information on the Lioness Service, but we make no endorsement, representation or warranty of any kind about any Lioness Content, information, services or recommendations. The accuracy of the data collected and presented through the Lioness Service is not intended to match that of medical devices or scientific measurement devices. We are not responsible for the accuracy, reliability, effectiveness, or correct use of information you receive through the Lioness Service. If you rely on any Lioness Content or the Lioness Service, you do so solely at your own risk. CONSULT YOUR DOCTOR BEFORE USING THE LIONESS SERVICE The Lioness Service is not intended to diagnose, treat, cure, or prevent any disease. If you have a medical or heart condition, consult your doctor before using the Lioness Service or engaging in sexual activity. If you experience any medical issues, stop using the Lioness Service and consult with a medical professional. Lioness is not responsible for any health problems that may result from programs, consultations, products, or events you learn about through the Lioness Service. If you use the Lioness Service you agree that you do so at your own risk and are voluntarily participating in any related activities. USE COMMON SENSE Use of the Lioness Service should not replace your good judgment and common sense. Please read and comply with all safety notices that accompany your Lioness product or service. ADDITIONAL POLICIES APPLY TO PRODUCT ORDERS Lioness’s Return Policy and Warranty applies to purchases made through the Lioness store at lioness.io. All orders placed are subject to Lioness’s acceptance. We may accept, decline, or place limits on your order for any reason. FEEDBACK AND SUBMISSIONS POLICY If you submit comments, ideas, or feedback to us, you agree that we can use them without any restriction or compensation to you. We do not waive any rights to use similar or related ideas or feedback previously known to us, developed by Lioness, or obtained from sources other than you. We are always pleased to hear from the members of the Lioness community. However, neither Lioness, nor any of its employees, may accept or consider any unsolicited ideas, including ideas for new or improved products or services, new marketing campaigns or product or service names. Therefore, please do not submit any such unsolicited ideas in any form to Lioness or any of its employees. This policy is necessary to avoid potential misunderstandings or disputes that may arise if our new products or services or marketing campaigns were to appear similar to an idea submitted by you. If, despite our policy, you still submit an idea to us, then regardless of anything contained in your submission you agree that the following shall apply: (i) we shall have no obligation to review the submission; (ii) the submission and its contents shall automatically become the property of Lioness, without any compensation to you; (iii) we may consider the submission and its contents to be non-confidential and non-proprietary; and (iv) we may redistribute or use (for commercial purposes or otherwise) the submission and its contents for any purpose and in any way, without any compensation to you (collectively, the “Terms and Conditions”). If a member of the Lioness community provides us (at our request or otherwise) a comment or suggestion regarding our products or services (including our mobile app or any of our devices) through any means, such as our Product Development web forums, help forums or via any social network, the Terms and Conditions set forth above shall also apply thereto. CONTESTS AND GIVEAWAYS Additional terms and conditions may apply to contests, giveaways and other promotions sponsored by Lioness and its partners. It is your responsibility to carefully review those terms and conditions. YOU AGREE TO RECEIVE ALERTS AND NOTIFICATIONS As part of your use of the Lioness Service, you may receive notifications, text messages, alerts, or emails. You agree to the receipt of these communications. You can control receipt of non-service related communications from your account settings. You are responsible for any messaging or data fees you may be charged by your wireless carrier. WE ARE NOT RESPONSIBLE FOR THIRD-PARTY LINKS ON THE LIONESS SERVICE The Lioness Service may contain links to third party websites in addition to articles, photographs, texts, videos, and other content originating from third parties (collectively “Third-Party Services”) that is not under the control of Lioness. These links are provided for your convenience and for informational purposes only. Links to third party content do not indicate Lioness’s endorsement of, sponsorship of, or affiliation with the third party or the linked content, including any advertising that may be posted on them. However, some third parties might pay Lioness affiliate or commission income to link to their websites. Regardless of whether the third party pays Lioness to link to its website or not, third party content is not investigated, monitored, or checked for accuracy, appropriateness, completeness or legality by Lioness. These Third-Party Services are not under Lioness’s control, and you acknowledge that Lioness is not responsible or liable for the content, functions, accuracy, legality, appropriateness or any other aspect of such Third-Party Services. You further acknowledge and agree that Lioness shall not be responsible or liable, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any such Content, goods or services available on or through any such Third-Party Services. LIONESS DOES NOT CONTROL THIRD-PARTY SERVICES THAT YOU LINK WITH YOUR LIONESS ACCOUNT The Lioness Service may provide the opportunity for you to link your Lioness account, Lioness data, or the Lioness Service with Third-Party Services. Although we offer this opportunity, you acknowledge that any Third-Party Services that you use in connection with the Lioness Service are not part of the Lioness Service. You acknowledge that these Terms and the Lioness Privacy Policy do not apply to any Third-Party Services. You are responsible for reading and understanding the terms and conditions and privacy policy that applies to your use of any Third-Party Services. COOKIES AND INTERNET ADVERTISINGThe Lioness Website, like many others, uses small files called cookies to help us customize your experience. Cookies are unique identifiers that we transfer to your device to enable our systems to recognize your device or when you have logged in. We use anonymous analytics cookies to enhance the functionality and performance of the website to provide you with a better user experience. We don't sell the information collected by the cookies. ﻿﻿About our anonymous analytics cookies: Every time someone visits our website, software provided by another organization generates an 'anonymous analytics cookie'. These cookies can tell us whether or not you have visited the site before. Your browser will tell us if you have these cookies and, if you don't, we generate new ones. This allows us to track how many individual users we have, and how often they visit the site. We cannot use these cookies to identify individuals. We use them to gather statistics, for example, the number of visits to a page. To opt out of cookies:Cookie settings in Internet ExplorerCookie settings in FirefoxCookie settings in ChromeCookie settings in Safari web and iOS. If you would like to find out more about cookies and their use on the Internet, you may find the following links useful: Microsoft Cookies guideAll About Cookies CHANGES TO THE LIONESS SERVICE Lioness may change or discontinue, temporarily or permanently, any feature or component of the Lioness Service at any time without notice. Lioness is not liable to you or to any third party for any modification, suspension or discontinuance of any feature or component of the Lioness Service. We reserve the right to determine the timing and content of software updates, which may be automatically downloaded and installed by Lioness products without prior notice to you. TERMINATION If you violate these Terms, we reserve the right to deactivate your account or terminate these Terms, at our sole discretion, at any time and without notice or liability to you. Upon any such termination, we may delete Your Content and other information related to your account. You may cancel your account at any time by contacting Customer Support at help@lioness.io. Upon any termination, discontinuation or cancellation of the Lioness Service or your account, the following provisions of these Terms will survive: Posting Your Content On The Lioness Service; Lioness’s Rights; Our Enforcement Rights; Termination; Disclaimers; Indemnity; Limitation of Liability; Dispute Resolution; and General Terms. DISCLAIMERS The Lioness Service may be periodically unavailable for maintenance or other reasons. Lioness shall have no responsibility for any interruption, delay in operation or transmission, theft or destruction of, unauthorized access to, or alteration of any Content made available via the Lioness Service. ALL USE OF THE LIONESS SERVICE IS ENTIRELY AT YOUR OWN RISK. THE LIONESS SERVICE AND LIONESS CONTENT ARE PROVIDED “AS IS,” WITHOUT REPRESENTATIONS OR WARRANTIES OF ANY KIND, EITHER EXPRESS, IMPLIED OR STATUTORY. LIONESS HAS NO CONTROL OVER AND DOES NOT PRE-SCREEN THE CONTENT PUBLISHED BY USERS AND IT IS NOT DIRECTLY INVOLVED IN TRANSACTIONS BETWEEN USERS. WITHOUT LIMITING THE FOREGOING, WE EXPLICITLY DISCLAIM ANY WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT, AND ANY WARRANTIES ARISING OUT OF COURSE OF DEALING OR USAGE OF TRADE. LIONESS DOES NOT WARRANT THAT THE INFORMATION ON THE LIONESS SERVICE IS ACCURATE, RELIABLE, OR CORRECT, OR THAT THE LIONESS SERVICE IS FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS. LIONESS ASSUMES NO LIABILITY OR RESPONSIBILITY FOR ANY (I) ERRORS, MISTAKES, OR INACCURACIES OF CONTENT, AND (II) ANY UNAUTHORIZED ACCESS TO OR USE OF OUR SECURE SERVERS AND/OR ANY AND ALL PERSONAL INFORMATION AND/OR FINANCIAL INFORMATION STORED THEREIN. LIONESS DOES NOT GUARANTEE THE TRUE IDENTITY OF A USER. We make no warranty that the Lioness Service or Lioness Content will meet your requirements or be available on an uninterrupted, secure, or error-free basis. We make no warranty regarding the quality, accuracy, timeliness, truthfulness, title, safety, completeness or reliability of the Lioness Service or any Lioness Content. You acknowledge and agree that if you rely on any Lioness Content or the Lioness Service, you do so solely at your own risk. LIMITATION OF LIABILITY NEITHER LIONESS, ITS DIRECTORS, OFFICERS, EMPLOYEES, VOLUNTEERS, AGENTS, SUPPLIERS OR LICENSORS, NOR ANY OTHER PARTY INVOLVED IN CREATING, PRODUCING, OR DELIVERING THE LIONESS SERVICE WILL BE LIABLE TO YOU OR ANY THIRD PERSON FOR ANY INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES, INCLUDING LOST PROFITS, LOSS OF DATA OR GOODWILL, SERVICE INTERRUPTION, COMPUTER DAMAGE OR SYSTEM FAILURE OR THE COST OF SUBSTITUTE SERVICES ARISING OUT OF OR IN CONNECTION WITH THESE TERMS OR FROM THE USE OF OR INABILITY TO USE THE LIONESS SERVICE, WHETHER BASED ON WARRANTY, CONTRACT, TORT (INCLUDING NEGLIGENCE), PRODUCT LIABILITY OR ANY OTHER LEGAL THEORY, AND WHETHER OR NOT LIONESS HAS BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGE, EVEN IF A LIMITED REMEDY SET FORTH HEREIN IS FOUND TO HAVE FAILED OF ITS ESSENTIAL PURPOSE. YOU AGREE THAT, TO THE EXTENT PERMITTED BY APPLICABLE LAW, YOUR SOLE AND EXCLUSIVE REMEDY FOR ANY PROBLEMS OR DISSATISFACTION WITH THE LIONESS SERVICE IS TERMINATION AND DISCONTINUATION OF YOUR USE OF THE LIONESS SERVICE. IN NO EVENT WILL LIONESS’S TOTAL LIABILITY ARISING OUT OF OR IN CONNECTION WITH THESE TERMS OR FROM THE USE OF OR INABILITY TO USE THE LIONESS SERVICE EXCEED THE AMOUNTS YOU HAVE PAID TO LIONESS FOR USE OF THE LIONESS SERVICE. LIONESS WILL NOT BE LIABLE FOR ANY DAMAGES SUSTAINED DUE TO RELIANCE BY USER ON INFORMATION OR ADVICE PROVIDED BY ANY THIRD PARTY LISTED ON THE LIONESS SERVICE OR OTHER SOCIAL MEDIA SITES, RECOMMENDED BY LIONESS, OR AFFILIATED WITH LIONESS IN ANY WAY. LIONESS DOES NOT CONTROL OR VERIFY THE QUALITY, RELEVANCE OR ACCURACY OF SUCH THIRD PARTIES’ ADVICE, WHETHER THE THIRD PARTY IS QUALIFIED TO PROVIDE THE SPECIFIC ADVICE, WHETHER THE THIRD PARTY IS CATEGORIZED CORRECTLY OR IN THE MOST APPROPRIATE CATEGORY TO PROVIDE THE ADVICE SOUGHT BY THE USER, THE ACCURACY OF ANY POSTINGS ON THE LIONESS SERVICE OR ANY TRANSMISSIONS THROUGH THE LIONESS SERVICE BY THE USER OR BY A THIRD PARTY. THE USER HEREBY RELEASES AND AGREES TO HOLD HARMLESS LIONESS, ITS DIRECTORS, SHAREHOLDERS, OFFICERS, MEMBERS, MANAGERS, EMPLOYEES, ADVISORS, CONSULTANTS AND ASSIGNS FROM ANY AND ALL CAUSES OF ACTION, CLAIMS OF ANY NATURE AND DAMAGES RESULTING FROM THE ADVICE OF THIRD PARTIES ACCESSED THROUGH THE LIONESS SERVICE OR FROM THE CONTENT OF THE LIONESS SERVICE. THE EXCLUSIONS AND LIMITATIONS OF DAMAGES SET FORTH ABOVE ARE FUNDAMENTAL ELEMENTS OF THE BASIS OF THE BARGAIN BETWEEN LIONESS AND YOU. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR INCIDENTAL DAMAGES, SO THE ABOVE LIMITATION MAY NOT APPLY TO YOU. INDEMNITY You agree to indemnify and hold harmless Lioness and its officers, directors, employees and agents, from and against any claims, disputes, demands, liabilities, damages, losses, and costs and expenses, including, without limitation, reasonable attorneys’ fees arising out of or in any way connected with (i) your access to or use of the Lioness Service, (ii) Your Content, or (iii) your breach of any warranties made by you hereunder or your violation of any other provision of these Terms. We reserve the right to assume control of the defense of any third-party claim that is subject to indemnification by you, in which event you will cooperate with us in asserting any available defenses. SEVERABILITY If any term, provision, covenant, or condition of these Terms is held invalid or unenforceable for any reason, the remainder of the provisions will continue in full force and effect as if these Terms had been executed with the invalid portion eliminated. LAWS GOVERNING TERMS OF SERVICE The laws of the State of California govern these Terms and any amendments or revisions, excluding the relevant laws governing Conflicts of Law. Any complaint, case, controversy, suit, action, or other proceeding arising out of or relating to these Terms shall be brought in a state or federal court located in Alameda County California. INTERNATIONAL USE Lioness makes no representation that materials on this Website are appropriate or available for use in locations outside the United States. Access to this Website from countries or territories where such access is illegal is prohibited. If you choose to access this Website outside the United States, you do so on your own initiative and are solely responsible for compliance with the laws of your jurisdiction regarding online conduct and acceptable content. GENERAL TERMS Except as otherwise stated herein, these Terms constitute the entire and exclusive understanding and agreement between Lioness and you regarding the Lioness Service, and these Terms supersede and replace any and all prior oral or written understandings or agreements between Lioness and you regarding the Lioness Service and Lioness Content. If for any reason a court of competent jurisdiction finds any provision of these Terms invalid or unenforceable, that provision will be enforced to the maximum extent permissible and the other provisions of these Terms will remain in full force and effect. You may not assign or transfer these Terms, by operation of law or otherwise, without Lioness’s prior written consent. Any attempt by you to assign or transfer these Terms, without such consent, will be null. Lioness may freely assign or transfer these Terms without restriction. Subject to the foregoing, these Terms will bind and inure to the benefit of the parties, their successors and permitted assigns. Any notices or other communications provided by Lioness under these Terms, including those regarding modifications to these Terms, will be given: (i) via email; or (ii) by posting to the Lioness Service. For notices made by e-mail, the date of receipt on the message will be deemed the date on which such notice is transmitted. Lioness’s failure to enforce any right or provision of these Terms will not be considered a waiver of such right or provision. The waiver of any such right or provision will be effective only if in writing and signed by a duly authorized representative of Lioness. Except as expressly set forth in these Terms, the exercise by either party of any of its remedies under these Terms will be without prejudice to its other remedies under these Terms or otherwise. ADDITIONAL TERMS MAY APPLY Additional terms may apply to certain products or services. In the event that there is a conflict between these Terms and any additional terms, the additional terms will control. PRIVACY POLICY Any information that Lioness collects through your use of the Lioness Service is subject to the Lioness Privacy Policy, which is part of these Terms. By accepting Lioness’s Terms of Service (as a user of the Lioness Service), you explicitly consent to Lioness’s Privacy Policy. Please see Lioness’s Privacy Policy. CONTACT US PLEASE CONTACT US IF YOU HAVE ANY QUESTIONS ABOUT THESE TERMS.Lioness2001 Addison Street, Suite 300Berkeley, CA 94704203-805-8790help@lioness.io Terms of Service TERMS OF SERVICE FOR SMARTBOD INCORPORATED, DBA LIONESS Effective Date: May 1, 2017Last Updated: May 1, 2017 Lioness is a registered trademark and trade name of SmartBod Incorporated. SmartBod Incorporated DBA/operating as Lioness is henceforth referred to as “Lioness” in these Terms of Service, unless explicitly noted otherwise. INTRODUCTION TO TERMS OF SERVICE SmartBod Incorporated DBA Lioness (“Lioness”) designs and builds vibrators and software that help women learn more about their own bodies. These Terms of Service (“Terms”) govern your use of our vibrators and other devices or products, our websites, including but not limited to lioness.io, Lioness software, including but not limited to the software embedded in Lioness devices, Lioness mobile applications, memberships and other Lioness services (collectively, the “Lioness Service”). You must accept these Terms to create a Lioness account and to use the Lioness Service. If you do not have an account, you accept these Terms by visiting lioness.io or using any part of the Lioness Service. By creating a Lioness account or by using any part of the Lioness Service, you expressly represent and warrant to Lioness that you are over the age of 18 and are legally competent to enter into agreements. IF YOU DO NOT ACCEPT THESE TERMS, DO NOT CREATE AN ACCOUNT, VISIT LIONESS.IO OR USE THE LIONESS SERVICE. THESE TERMS MAY CHANGE These Terms will change over time. Lioness reserves the right to periodically change these Terms without notice, and such changes will be effective as of the date they are posted. You are responsible for checking this page frequently for any updates or other changes. We may notify you by email, through the Lioness Service, or by presenting you with a new Terms of Service to accept if we make a modification that materially changes your rights. When you use the Lioness Service after a modification is posted, you are telling us that you accept the modified terms. INTELLECTUAL PROPERTY Lioness is the owner of the compilation of content that is posted on the Lioness Service, including all text, images, audio and video clips, design, databases, codes, and software (“Content”), but it does not necessarily own all the material within this compilation. The Content may be owned by Lioness, owned by others and used with their permission, or used in accordance with applicable law. Some Content is in the public domain and some Content is protected by third party rights such as copyright, trademark, rights of publicity, privacy, and contractual restrictions. WHO CAN USE LIONESS? You may use the Lioness Service if you are over 18 years of age and are not barred from receiving services under applicable law. You may connect to the Lioness Service using a device that is manufactured, distributed, or sold by or on behalf of Lioness; the Lioness mobile applications; the Lioness software; approved third-party applications; or lioness.io (“Authorized Connections”). You may not connect to the Lioness Service with any device that is not manufactured, distributed, sold by or on behalf of Lioness (such as a knock-off or counterfeit version of a Lioness Product), or otherwise intends to resemble or purports to be a Lioness Product. You may not connect to the Lioness Service through any unauthorized application or-third party connection. Any violation or attempted violation of this provision may result in the immediate termination of your ability to access the Lioness Service. If you have questions about whether a product or application qualifies as an Authorized Connection, please contact help@lioness.io. CREATING AN ACCOUNT Full use of the Lioness Service requires that you create an account by providing us with a valid email address and password. You are responsible for all activity that occurs in association with your account. Lioness is not liable for any loss or damages caused by your failure to maintain the confidentiality of your account credentials. We may need to contact you about your use of the Lioness Service. These communications are part of the Lioness Service and you may not opt-out from receiving them. You can opt-out from receiving other communications. NECESSARY EQUIPMENT Full use of the Lioness Service is dependent upon your use of a computer with adequate software or a supported mobile device and Internet access. The maintenance and security of this equipment may influence the performance of the Lioness Service and it is your responsibility to ensure the equipment’s functionality. POSTING YOUR CONTENT ON THE LIONESS SERVICE You may post photos, comments, and other content (“Your Content”) to the Lioness Service. You retain all rights to Your Content that you post to the Lioness Service. By making Your Content available on or through the Lioness Service you grant to Lioness a non-exclusive, perpetual, irrevocable, transferable, sublicensable, worldwide, royalty-free license to use, copy, modify, excerpt (in whole or in part), adapt, publish, publicly display, publicly perform and distribute Your Content. You are responsible for Your Content. You represent and warrant that you own Your Content or that you have all rights necessary to grant us a license to use Your Content as described in these Terms. You also represent and warrant that Your Content and the use and provision of Your Content on the Lioness Service will not: (a) infringe, misappropriate or violate a third party’s patent, copyright, trademark, trade secret, moral rights or other intellectual property rights, or rights of publicity or privacy; (b) violate, or encourage any conduct that would violate, any applicable law or regulation or would give rise to civil liability; (c) be fraudulent, false, misleading or deceptive; (d) be defamatory, obscene, pornographic, vulgar or offensive; (e) promote discrimination, bigotry, racism, hatred, harassment or harm against any individual or group; (f) be violent or threatening or promote violence or actions that are threatening to any person or entity; or (g) promote illegal or harmful activities or substances. You also agree that Your Content will comply with the following community guidelines: Be respectful of the opinions of others. Even though you might not agree with someone, that doesn't mean they are wrong or deserve to be belittled. Remember that what works for you may not work for everyone else. Give everyone the same courtesy you would expect in return. Do not post profane or explicit content. Do not post profile pictures that might be considered inappropriate. Do not post communications that could be interpreted as threatening or harassing. Do not post, advertise, or promote products or services commercially. LIONESS’S RIGHTS “Lioness Content” includes any text, graphics, images, music, software, audio, video, works of authorship of any kind, and information or other materials that are posted, generated, provided or otherwise made available through the Lioness Service to you. Except for Your Content, Lioness Content, the Lioness Service and its underlying technology are protected by copyright, trademark, patent, intellectual property, and other laws of the United States and foreign countries. You agree not to remove, change or obscure any copyright, trademark, service mark or other proprietary rights notices incorporated in or accompanying the Lioness Service. WHAT YOU CAN DO ON THE LIONESS SERVICE The Lioness Service is intended for your personal, non-commercial use. Lioness grants you a limited, non-exclusive, non-transferable, non-sublicensable license to (1) access and view the Lioness Content, (2) access and use the software and mobile applications provided by the Lioness Service, and (3) use the software that is embedded into Lioness products as authorized in these Terms. This license is provided solely for your personal use and enjoyment of the Lioness Service as permitted in these Terms. You will not use, copy, adapt, modify, prepare derivative works based upon, distribute, license, sell, transfer, publicly display, publicly perform, transmit, broadcast or otherwise exploit the Lioness Content, Lioness Service or any portion thereof, except as expressly permitted in these Terms. No licenses or rights are granted to you by implication or otherwise under any intellectual property rights owned or controlled by Lioness or its licensors, except for the licenses and rights expressly granted in these Terms. THINGS YOU CANNOT DO ON THE LIONESS SERVICE Except to the extent permitted by law, you may not perform, attempt to perform, or encourage or assist others in performing any of the following while accessing or using the Lioness Service: (1) use, display, mirror or frame the Lioness Service or any individual element within the Lioness Service, Lioness’s name, any Lioness trademark, logo or other proprietary information, or the layout and design of any page or form contained on a page, without Lioness’s express written consent; (2) access or tamper with non-public areas of the Lioness Service, Lioness’s computer systems, or the technical delivery systems of Lioness’s providers; (3) test the vulnerability of any Lioness system or breach any security or authentication measures; (4) circumvent any technological measure implemented by Lioness or any of Lioness’s providers or any other third party (including another user) to protect the Lioness Service or Lioness Content; (5) access the Lioness Service or Lioness Content through the use of any mechanism other than through the use of an Authorized Connection, Lioness Service or Lioness API; or (6) modify, decompile, disassemble, reverse engineer, tamper with or otherwise attempt to derive the source code of any software that Lioness provides to you or any other part of the Lioness Service. OUR ENFORCEMENT RIGHTS We are not obligated to monitor access or use of the Lioness Service, Lioness Content, or Your Content or to review or edit any Lioness Content or Your Content. However, we have the right to do so for the purpose of operating the Lioness Service, to ensure compliance with these Terms, and to comply with applicable law or other legal requirements. We may consult with and disclose unlawful conduct to law enforcement authorities; and pursuant to valid legal process, we may cooperate with law enforcement authorities to prosecute users who violate the law. We reserve the right (but are not required) to remove or disable access to the Lioness Service, any Lioness Content, or Your Content at any time and without notice, and at our sole discretion, if we determine that the Lioness Content, Your Content, or your use of the Lioness Service is objectionable or in violation of these Terms. We have the right to investigate violations of these Terms and any conduct that affects the Lioness Service. DMCA/COPYRIGHT POLICY Lioness respects copyright law and expects its users to do the same. Lioness does not permit copyright infringing activities and infringement of any other intellectual property rights on the Lioness Service, and will remove all Content if properly notified that such Content infringes on another's intellectual property rights. Lioness reserves the right to remove Content without prior notice. It is Lioness’s policy to terminate in appropriate circumstances account holders who repeatedly infringe the rights of copyright holders. If you are a copyright owner or an agent thereof and believe in good faith that any materials on the Website infringe upon your copyrights, you may submit a notification pursuant to the Digital Millennium Copyright Act by sending the following information in writing to Lioness’s designated copyright agent at help@lioness.io. Your name and electronic signature of a person authorized to act on behalf of the owner of the exclusive right that is allegedly infringed; A description of the copyrighted work that you claim has been infringed. If this notice covers multiple copyrighted works, you may provide a representative list of the copyrighted works that you claim have been infringed; A description of the material that you claim is infringing (or to be the subject of infringing activity) and information reasonably sufficient to permit us to locate the material; Information sufficient to contact you, including your mailing address, telephone number, and, if available, email address; A statement that you have a good faith belief that use of the material in the manner complained of is not authorized by the copyright owner, its agent, or the law; A statement that the information provided in the notice is accurate, and under penalty of perjury, that you are the owner, or agent thereof, of the copyright or of an exclusive right under the copyright that is allegedly infringed; and Your full legal name and your electronic or physical signature. If you believe that your content that has been removed from the Website does not infringe or that you have the authorization from the copyright owner, you may send a counter-notice to Lioness. To do so, send the following information to our copyright agent using the contact information set forth above. A description of the material that has been removed and the location at which the content appeared before it was removed; A statement that you have a good faith belief that the content was removed as a result of mistake or a misidentification of the content; Information sufficient to contact you, including your mailing address, telephone number, and, if available, email address; A statement that you will consent to the jurisdiction of the federal court for the judicial district in which your address is located, or if your address is outside of the United States, for any judicial district in which Lioness may be found; A statement that you will accept service of process from the person who provided the notification of the alleged infringement; and Your full legal name and your electronic or physical signature. If a counter-notice is received by Lioness’s copyright agent, Lioness may send a copy of the counter-notice to the original complaining party informing such person that Lioness may reinstate the removed content in 10 business days. Unless the copyright owner files an action seeking a court order against the content provider, member or user, the removed content may, at Lioness’s discretion, be reinstated on the Website in 10 to 14 business days or more after receipt of the counter-notice. USE THE LIONESS SERVICE AT YOUR OWN RISK Our goal is to provide helpful and accurate information on the Lioness Service, but we make no endorsement, representation or warranty of any kind about any Lioness Content, information, services or recommendations. The accuracy of the data collected and presented through the Lioness Service is not intended to match that of medical devices or scientific measurement devices. We are not responsible for the accuracy, reliability, effectiveness, or correct use of information you receive through the Lioness Service. If you rely on any Lioness Content or the Lioness Service, you do so solely at your own risk. CONSULT YOUR DOCTOR BEFORE USING THE LIONESS SERVICE The Lioness Service is not intended to diagnose, treat, cure, or prevent any disease. If you have a medical or heart condition, consult your doctor before using the Lioness Service or engaging in sexual activity. If you experience any medical issues, stop using the Lioness Service and consult with a medical professional. Lioness is not responsible for any health problems that may result from programs, consultations, products, or events you learn about through the Lioness Service. If you use the Lioness Service you agree that you do so at your own risk and are voluntarily participating in any related activities. USE COMMON SENSE Use of the Lioness Service should not replace your good judgment and common sense. Please read and comply with all safety notices that accompany your Lioness product or service. ADDITIONAL POLICIES APPLY TO PRODUCT ORDERS Lioness’s Return Policy and Warranty applies to purchases made through the Lioness store at lioness.io. All orders placed are subject to Lioness’s acceptance. We may accept, decline, or place limits on your order for any reason. FEEDBACK AND SUBMISSIONS POLICY If you submit comments, ideas, or feedback to us, you agree that we can use them without any restriction or compensation to you. We do not waive any rights to use similar or related ideas or feedback previously known to us, developed by Lioness, or obtained from sources other than you. We are always pleased to hear from the members of the Lioness community. However, neither Lioness, nor any of its employees, may accept or consider any unsolicited ideas, including ideas for new or improved products or services, new marketing campaigns or product or service names. Therefore, please do not submit any such unsolicited ideas in any form to Lioness or any of its employees. This policy is necessary to avoid potential misunderstandings or disputes that may arise if our new products or services or marketing campaigns were to appear similar to an idea submitted by you. If, despite our policy, you still submit an idea to us, then regardless of anything contained in your submission you agree that the following shall apply: (i) we shall have no obligation to review the submission; (ii) the submission and its contents shall automatically become the property of Lioness, without any compensation to you; (iii) we may consider the submission and its contents to be non-confidential and non-proprietary; and (iv) we may redistribute or use (for commercial purposes or otherwise) the submission and its contents for any purpose and in any way, without any compensation to you (collectively, the “Terms and Conditions”). If a member of the Lioness community provides us (at our request or otherwise) a comment or suggestion regarding our products or services (including our mobile app or any of our devices) through any means, such as our Product Development web forums, help forums or via any social network, the Terms and Conditions set forth above shall also apply thereto. CONTESTS AND GIVEAWAYS Additional terms and conditions may apply to contests, giveaways and other promotions sponsored by Lioness and its partners. It is your responsibility to carefully review those terms and conditions. YOU AGREE TO RECEIVE ALERTS AND NOTIFICATIONS As part of your use of the Lioness Service, you may receive notifications, text messages, alerts, or emails. You agree to the receipt of these communications. You can control receipt of non-service related communications from your account settings. You are responsible for any messaging or data fees you may be charged by your wireless carrier. WE ARE NOT RESPONSIBLE FOR THIRD-PARTY LINKS ON THE LIONESS SERVICE The Lioness Service may contain links to third party websites in addition to articles, photographs, texts, videos, and other content originating from third parties (collectively “Third-Party Services”) that is not under the control of Lioness. These links are provided for your convenience and for informational purposes only. Links to third party content do not indicate Lioness’s endorsement of, sponsorship of, or affiliation with the third party or the linked content, including any advertising that may be posted on them. However, some third parties might pay Lioness affiliate or commission income to link to their websites. Regardless of whether the third party pays Lioness to link to its website or not, third party content is not investigated, monitored, or checked for accuracy, appropriateness, completeness or legality by Lioness. These Third-Party Services are not under Lioness’s control, and you acknowledge that Lioness is not responsible or liable for the content, functions, accuracy, legality, appropriateness or any other aspect of such Third-Party Services. You further acknowledge and agree that Lioness shall not be responsible or liable, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any such Content, goods or services available on or through any such Third-Party Services. LIONESS DOES NOT CONTROL THIRD-PARTY SERVICES THAT YOU LINK WITH YOUR LIONESS ACCOUNT The Lioness Service may provide the opportunity for you to link your Lioness account, Lioness data, or the Lioness Service with Third-Party Services. Although we offer this opportunity, you acknowledge that any Third-Party Services that you use in connection with the Lioness Service are not part of the Lioness Service. You acknowledge that these Terms and the Lioness Privacy Policy do not apply to any Third-Party Services. You are responsible for reading and understanding the terms and conditions and privacy policy that applies to your use of any Third-Party Services. COOKIES AND INTERNET ADVERTISINGThe Lioness Website, like many others, uses small files called cookies to help us customize your experience. Cookies are unique identifiers that we transfer to your device to enable our systems to recognize your device or when you have logged in. We use anonymous analytics cookies to enhance the functionality and performance of the website to provide you with a better user experience. We don't sell the information collected by the cookies. ﻿﻿About our anonymous analytics cookies: Every time someone visits our website, software provided by another organization generates an 'anonymous analytics cookie'. These cookies can tell us whether or not you have visited the site before. Your browser will tell us if you have these cookies and, if you don't, we generate new ones. This allows us to track how many individual users we have, and how often they visit the site. We cannot use these cookies to identify individuals. We use them to gather statistics, for example, the number of visits to a page. To opt out of cookies:Cookie settings in Internet ExplorerCookie settings in FirefoxCookie settings in ChromeCookie settings in Safari web and iOS. If you would like to find out more about cookies and their use on the Internet, you may find the following links useful: Microsoft Cookies guideAll About Cookies CHANGES TO THE LIONESS SERVICE Lioness may change or discontinue, temporarily or permanently, any feature or component of the Lioness Service at any time without notice. Lioness is not liable to you or to any third party for any modification, suspension or discontinuance of any feature or component of the Lioness Service. We reserve the right to determine the timing and content of software updates, which may be automatically downloaded and installed by Lioness products without prior notice to you. TERMINATION If you violate these Terms, we reserve the right to deactivate your account or terminate these Terms, at our sole discretion, at any time and without notice or liability to you. Upon any such termination, we may delete Your Content and other information related to your account. You may cancel your account at any time by contacting Customer Support at help@lioness.io. Upon any termination, discontinuation or cancellation of the Lioness Service or your account, the following provisions of these Terms will survive: Posting Your Content On The Lioness Service; Lioness’s Rights; Our Enforcement Rights; Termination; Disclaimers; Indemnity; Limitation of Liability; Dispute Resolution; and General Terms. DISCLAIMERS The Lioness Service may be periodically unavailable for maintenance or other reasons. Lioness shall have no responsibility for any interruption, delay in operation or transmission, theft or destruction of, unauthorized access to, or alteration of any Content made available via the Lioness Service. ALL USE OF THE LIONESS SERVICE IS ENTIRELY AT YOUR OWN RISK. THE LIONESS SERVICE AND LIONESS CONTENT ARE PROVIDED “AS IS,” WITHOUT REPRESENTATIONS OR WARRANTIES OF ANY KIND, EITHER EXPRESS, IMPLIED OR STATUTORY. LIONESS HAS NO CONTROL OVER AND DOES NOT PRE-SCREEN THE CONTENT PUBLISHED BY USERS AND IT IS NOT DIRECTLY INVOLVED IN TRANSACTIONS BETWEEN USERS. WITHOUT LIMITING THE FOREGOING, WE EXPLICITLY DISCLAIM ANY WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT, AND ANY WARRANTIES ARISING OUT OF COURSE OF DEALING OR USAGE OF TRADE. LIONESS DOES NOT WARRANT THAT THE INFORMATION ON THE LIONESS SERVICE IS ACCURATE, RELIABLE, OR CORRECT, OR THAT THE LIONESS SERVICE IS FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS. LIONESS ASSUMES NO LIABILITY OR RESPONSIBILITY FOR ANY (I) ERRORS, MISTAKES, OR INACCURACIES OF CONTENT, AND (II) ANY UNAUTHORIZED ACCESS TO OR USE OF OUR SECURE SERVERS AND/OR ANY AND ALL PERSONAL INFORMATION AND/OR FINANCIAL INFORMATION STORED THEREIN. LIONESS DOES NOT GUARANTEE THE TRUE IDENTITY OF A USER. We make no warranty that the Lioness Service or Lioness Content will meet your requirements or be available on an uninterrupted, secure, or error-free basis. We make no warranty regarding the quality, accuracy, timeliness, truthfulness, title, safety, completeness or reliability of the Lioness Service or any Lioness Content. You acknowledge and agree that if you rely on any Lioness Content or the Lioness Service, you do so solely at your own risk. LIMITATION OF LIABILITY NEITHER LIONESS, ITS DIRECTORS, OFFICERS, EMPLOYEES, VOLUNTEERS, AGENTS, SUPPLIERS OR LICENSORS, NOR ANY OTHER PARTY INVOLVED IN CREATING, PRODUCING, OR DELIVERING THE LIONESS SERVICE WILL BE LIABLE TO YOU OR ANY THIRD PERSON FOR ANY INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES, INCLUDING LOST PROFITS, LOSS OF DATA OR GOODWILL, SERVICE INTERRUPTION, COMPUTER DAMAGE OR SYSTEM FAILURE OR THE COST OF SUBSTITUTE SERVICES ARISING OUT OF OR IN CONNECTION WITH THESE TERMS OR FROM THE USE OF OR INABILITY TO USE THE LIONESS SERVICE, WHETHER BASED ON WARRANTY, CONTRACT, TORT (INCLUDING NEGLIGENCE), PRODUCT LIABILITY OR ANY OTHER LEGAL THEORY, AND WHETHER OR NOT LIONESS HAS BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGE, EVEN IF A LIMITED REMEDY SET FORTH HEREIN IS FOUND TO HAVE FAILED OF ITS ESSENTIAL PURPOSE. YOU AGREE THAT, TO THE EXTENT PERMITTED BY APPLICABLE LAW, YOUR SOLE AND EXCLUSIVE REMEDY FOR ANY PROBLEMS OR DISSATISFACTION WITH THE LIONESS SERVICE IS TERMINATION AND DISCONTINUATION OF YOUR USE OF THE LIONESS SERVICE. IN NO EVENT WILL LIONESS’S TOTAL LIABILITY ARISING OUT OF OR IN CONNECTION WITH THESE TERMS OR FROM THE USE OF OR INABILITY TO USE THE LIONESS SERVICE EXCEED THE AMOUNTS YOU HAVE PAID TO LIONESS FOR USE OF THE LIONESS SERVICE. LIONESS WILL NOT BE LIABLE FOR ANY DAMAGES SUSTAINED DUE TO RELIANCE BY USER ON INFORMATION OR ADVICE PROVIDED BY ANY THIRD PARTY LISTED ON THE LIONESS SERVICE OR OTHER SOCIAL MEDIA SITES, RECOMMENDED BY LIONESS, OR AFFILIATED WITH LIONESS IN ANY WAY. LIONESS DOES NOT CONTROL OR VERIFY THE QUALITY, RELEVANCE OR ACCURACY OF SUCH THIRD PARTIES’ ADVICE, WHETHER THE THIRD PARTY IS QUALIFIED TO PROVIDE THE SPECIFIC ADVICE, WHETHER THE THIRD PARTY IS CATEGORIZED CORRECTLY OR IN THE MOST APPROPRIATE CATEGORY TO PROVIDE THE ADVICE SOUGHT BY THE USER, THE ACCURACY OF ANY POSTINGS ON THE LIONESS SERVICE OR ANY TRANSMISSIONS THROUGH THE LIONESS SERVICE BY THE USER OR BY A THIRD PARTY. THE USER HEREBY RELEASES AND AGREES TO HOLD HARMLESS LIONESS, ITS DIRECTORS, SHAREHOLDERS, OFFICERS, MEMBERS, MANAGERS, EMPLOYEES, ADVISORS, CONSULTANTS AND ASSIGNS FROM ANY AND ALL CAUSES OF ACTION, CLAIMS OF ANY NATURE AND DAMAGES RESULTING FROM THE ADVICE OF THIRD PARTIES ACCESSED THROUGH THE LIONESS SERVICE OR FROM THE CONTENT OF THE LIONESS SERVICE. THE EXCLUSIONS AND LIMITATIONS OF DAMAGES SET FORTH ABOVE ARE FUNDAMENTAL ELEMENTS OF THE BASIS OF THE BARGAIN BETWEEN LIONESS AND YOU. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR INCIDENTAL DAMAGES, SO THE ABOVE LIMITATION MAY NOT APPLY TO YOU. INDEMNITY You agree to indemnify and hold harmless Lioness and its officers, directors, employees and agents, from and against any claims, disputes, demands, liabilities, damages, losses, and costs and expenses, including, without limitation, reasonable attorneys’ fees arising out of or in any way connected with (i) your access to or use of the Lioness Service, (ii) Your Content, or (iii) your breach of any warranties made by you hereunder or your violation of any other provision of these Terms. We reserve the right to assume control of the defense of any third-party claim that is subject to indemnification by you, in which event you will cooperate with us in asserting any available defenses. SEVERABILITY If any term, provision, covenant, or condition of these Terms is held invalid or unenforceable for any reason, the remainder of the provisions will continue in full force and effect as if these Terms had been executed with the invalid portion eliminated. LAWS GOVERNING TERMS OF SERVICE The laws of the State of California govern these Terms and any amendments or revisions, excluding the relevant laws governing Conflicts of Law. Any complaint, case, controversy, suit, action, or other proceeding arising out of or relating to these Terms shall be brought in a state or federal court located in Alameda County California. INTERNATIONAL USE Lioness makes no representation that materials on this Website are appropriate or available for use in locations outside the United States. Access to this Website from countries or territories where such access is illegal is prohibited. If you choose to access this Website outside the United States, you do so on your own initiative and are solely responsible for compliance with the laws of your jurisdiction regarding online conduct and acceptable content. GENERAL TERMS Except as otherwise stated herein, these Terms constitute the entire and exclusive understanding and agreement between Lioness and you regarding the Lioness Service, and these Terms supersede and replace any and all prior oral or written understandings or agreements between Lioness and you regarding the Lioness Service and Lioness Content. If for any reason a court of competent jurisdiction finds any provision of these Terms invalid or unenforceable, that provision will be enforced to the maximum extent permissible and the other provisions of these Terms will remain in full force and effect. You may not assign or transfer these Terms, by operation of law or otherwise, without Lioness’s prior written consent. Any attempt by you to assign or transfer these Terms, without such consent, will be null. Lioness may freely assign or transfer these Terms without restriction. Subject to the foregoing, these Terms will bind and inure to the benefit of the parties, their successors and permitted assigns. Any notices or other communications provided by Lioness under these Terms, including those regarding modifications to these Terms, will be given: (i) via email; or (ii) by posting to the Lioness Service. For notices made by e-mail, the date of receipt on the message will be deemed the date on which such notice is transmitted. Lioness’s failure to enforce any right or provision of these Terms will not be considered a waiver of such right or provision. The waiver of any such right or provision will be effective only if in writing and signed by a duly authorized representative of Lioness. Except as expressly set forth in these Terms, the exercise by either party of any of its remedies under these Terms will be without prejudice to its other remedies under these Terms or otherwise. ADDITIONAL TERMS MAY APPLY Additional terms may apply to certain products or services. In the event that there is a conflict between these Terms and any additional terms, the additional terms will control. PRIVACY POLICY Any information that Lioness collects through your use of the Lioness Service is subject to the Lioness Privacy Policy, which is part of these Terms. By accepting Lioness’s Terms of Service (as a user of the Lioness Service), you explicitly consent to Lioness’s Privacy Policy. Please see Lioness’s Privacy Policy. CONTACT US PLEASE CONTACT US IF YOU HAVE ANY QUESTIONS ABOUT THESE TERMS.Lioness2001 Addison Street, Suite 300Berkeley, CA 94704203-805-8790help@lioness.io",
      "content_type": "other",
      "source_url": "https://lioness.io/pages/terms-of-service"
    },
    {
      "title": "Privacy Policy - Our Commitment To Privacy | Lioness",
      "content": "Privacy Policy For a less legalistic, high-level explanation of our general philosophy and approach, click here. The text outlined below, however, is still our legally binding policy. PRIVACY POLICY FOR SMARTBOD INCORPORATED, DBA LIONESS Effective Date: May 1st, 2017Last Updated: May 1st, 2017 Lioness is a registered trademark and trade name of SmartBod Incorporated. SmartBod Incorporated DBA/operating as Lioness is henceforth referred to as “Lioness” in this document, unless explicitly noted otherwise. INTRODUCTION: OUR COMMITMENT TO PRIVACY Your privacy is important to us. To better protect your privacy, we provide this notice explaining our information practices and the choices you can make about the way your information is collected and used. To make this notice easy to find, we make links available to it on our website, lioness.io, and at points where personal information may be requested. This Privacy Policy applies to our vibrators and other devices (“Devices”), our websites, including but not limited to lioness.io (individually a “Site” and collectively “Sites”), the Lioness software (“Software”) and Lioness mobile applications (the “Apps”). The Devices, Sites, Software and Apps are collectively referred to in this Policy as the “Lioness Service,” and by proceeding to use the Lioness Service you consent that we may handle the data that we collect from you in accordance with this Privacy Policy. This policy may change over time, but any future changes will not affect data that was collected under a previous version of this policy. Please check this page periodically for any changes. You may also be notified of the changes to our policy by email or any other method that Lioness deems appropriate. Your continued use of the Lioness Service after being notified of the changes to our policy will constitute acceptance of our new Privacy Policy. And remember, we’re here to help. If something in this policy does not make sense or if you have any questions, please contact us at help@lioness.io. YOUR CONSENT By accepting Lioness’s Terms of Service (as a user of the Lioness Service) you explicitly consent to this Privacy Policy. INFORMATION THAT YOU PROVIDE TO LIONESS Activate a DeviceWhen activating a Lioness Device, you will be asked to download the Lioness App or install Software and enter information about yourself. Depending upon the specific Device you use, your data may be collected and transmitted to Lioness. Create a Lioness AccountIf you want to access data collected by your Device, you must create a Lioness account. When you create a Lioness account, we ask for some personal information, including your email address, username, and password. Add Info to Your AccountYou can customize your Lioness experience by adding other types of information to your account, such as personalizing your profile with photos, participating in discussion boards, or sending messages. Whenever you add this type of data, we collect it and store it in your Lioness account. Visit Our SitesLioness collects industry standard data from everyone who visits our Sites—even if you don’t have a Lioness account. This includes log data that automatically records information about your visit, such as your browser type, operating system, the URL of the page that referred you, the different actions you performed, and the IP address you used to access pages on the Site. We use this type of information to provide you with an experience that’s relevant to your location based on the IP address, to prevent Site misuse, and to ensure the Site is working properly. We also collect data from cookies. Sync Your DeviceWhen you sync your Device through an App or the Software, data recorded on your Device is transferred from your Device to our servers. This data is stored and used to provide the Lioness Service and is associated with your account. Each time a sync occurs, we log data about the transmission. Some examples of the log data are the sync time and date, device battery level, and the IP address used when syncing. Buy From Our StoreWe do not view or store your credit card information. This is handled by our third-party payment processor. We store your shipping address so we can process your order through our fulfillment partner. If you are logged into your Lioness account when you purchase something on our Site, we associate that order with your Lioness account. Contact UsWhenever you contact Lioness for help, we collect your name and email address along with additional information you provide in your request so that we can provide you with assistance and improve the Lioness Service. This data does not expire, and is retained unless otherwise stated. We only collect information about you when you’re interacting with Lioness Products & Services. WHY WE COLLECT DATA Lioness uses your data to provide you with the best experience possible, to help you learn about your body, and to improve and protect the Lioness Service. Here are some examples: Contact information is used to send you notifications and to inform you about new features or products we think you would be interested in. Please see “Can I Opt-out Of Receiving Lioness Emails?” for information on how you can opt-out of future communications. Data and logs are used in research to understand and improve the Lioness Device and Lioness Service; to troubleshoot the Lioness Service; to detect and protect against error, fraud or other criminal activity; and to enforce the Lioness Terms of Service. Aggregate data that does not identify you may be used to inform the health community about trends; for marketing and promotional use (for example, data may be included in an aggregated and anonymized chart that represents what a user can expect to see in the Lioness app); or for sale to interested audiences. (See “Aggregate Data – Non-Identifying Information” to learn more.) WHAT KINDS OF DATA WE SHARE Data That Could Identify YouPersonally Identifiable Information (PII) is data that includes a personal identifier like your name, email or address, or data that could reasonably be linked back to you. We will only share this data under the following circumstances: With companies that are contractually engaged in providing Lioness with services, such as order fulfillment, email management and credit card processing. These companies are obligated by contract to safeguard any PII they receive from us. If we believe that disclosure is reasonably necessary to comply with a law, regulation, valid legal process (e.g., subpoenas or warrants served on us), or governmental or regulatory request, to enforce or apply the Terms of Service or Terms of Sale, to protect the security or integrity of the Lioness Service, and/or to protect the rights, property, or safety of Lioness, its employees, users, or others. If we are going to release your data, we will do our best to provide you with notice in advance by email, unless we are prohibited by law from doing so. We may disclose or transfer your PII in connection with the sale, merger, bankruptcy, sale of assets or reorganization of our company. We will notify you if a different company will receive your PII and the promises in this Privacy Policy will apply to your data as transferred to the new entity. Aggregate Data (Non-Identifying Data)Lioness may share or sell aggregated data that does not identify you, with partners and the public in a variety of ways, such as by providing research or reports about health and sexuality. When we provide this information, we perform appropriate procedures so that the data does not identify you and we contractually prohibit recipients of the data from re-attributing it back to you. Data That You Direct Us to ShareYou can direct us to share data with other parties. For example, you might authorize us to link your Lioness account with a third-party app (e.g. a period tracking app) or send status updates to your Facebook or Twitter account (an example of this may be a tweet that you explicitly authorize us to send during a promotion or sweepstakes). Once you direct us to share your data with a third party, that data is governed by the third-party’s privacy policy. You can revoke your consent for us to share data with the third party at any time. WAYS YOU MIGHT SHARE YOUR DATA Community PostsThe Lioness Service may offer discussion forums, message boards, social networking opportunities, chat pages and other public forums or features in which you may provide personal information, materials and related content. If you submit personal information when using these public features, please note that such personal information may be publicly posted and otherwise disclosed and used without limitation or restriction. Contests and GiveawaysLioness may offer opportunities to participate in contests, giveaways and other promotions. Any data you submit in connection with these activities will be treated in accordance with this Privacy Policy, unless the rules for those offers note otherwise. SurveysLioness may also ask you to participate in surveys (processed by Lioness or third parties) that help us understand consumer use of the Lioness Service. Any PII you provide to Lioness (or supplied by you or Lioness to such third-party survey providers) in connection with these surveys will only be used in relation to that survey and as stated in this policy. THIRD PARTIES Lioness will not be responsible for the practices of third parties that Lioness does not own or control or individuals that Lioness does not employ or manage. The information provided by you to other third parties may be subject to their own privacy policies, which may differ from Lioness’s privacy policy. The Lioness Service may contain links to other sites, and we make every effort to only link to sites that share our high standards and respect for privacy. However, we are not responsible for the privacy practices employed by other sites. Lioness is also not responsible for privacy or security issues with other Internet websites, even if a user of the Lioness Service posts the external link to the Lioness Service. DATA RETENTION Lioness reserves the right to retain your PII for as long as your account remains active. All information data is retained to comply with this policy or legal obligations. Lioness may continue to use your non-identifying data after you deactivate your account. LIONESS’S POLICIES FOR MINORS Lioness is not directed at persons under the age of 18. We do not knowingly collect any PII from minors under 18. If you are aware of a user under the age of 18 using Lioness, please contact us at help@lioness.io. CAN I OPT-OUT OF RECEIVING LIONESS EMAILS? Lioness may periodically contact you by sending an email newsletter, marketing emails and emails related to new features. You will be able to opt-out of receiving these emails. If you opt out, we may still send you emails related to your account information and related to our business with you. Opting-out of these emails will not end transmission of important service-related emails that are necessary to your use of the Lioness Service. HOW DOES LIONESS KEEP MY DATA SAFE? Lioness uses a combination of technical and administrative security controls to maintain the security of your data. If you have a security-related concern, please contact Customer Support. CONTACT US PLEASE CONTACT US IF YOU HAVE ANY QUESTIONS ABOUT THIS POLICY.Lioness2001 Addison Street, Suite 300Berkeley, CA 94704203-805-8790help@lioness.io Privacy Policy For a less legalistic, high-level explanation of our general philosophy and approach, click here. The text outlined below, however, is still our legally binding policy. PRIVACY POLICY FOR SMARTBOD INCORPORATED, DBA LIONESS Effective Date: May 1st, 2017Last Updated: May 1st, 2017 Lioness is a registered trademark and trade name of SmartBod Incorporated. SmartBod Incorporated DBA/operating as Lioness is henceforth referred to as “Lioness” in this document, unless explicitly noted otherwise. INTRODUCTION: OUR COMMITMENT TO PRIVACY Your privacy is important to us. To better protect your privacy, we provide this notice explaining our information practices and the choices you can make about the way your information is collected and used. To make this notice easy to find, we make links available to it on our website, lioness.io, and at points where personal information may be requested. This Privacy Policy applies to our vibrators and other devices (“Devices”), our websites, including but not limited to lioness.io (individually a “Site” and collectively “Sites”), the Lioness software (“Software”) and Lioness mobile applications (the “Apps”). The Devices, Sites, Software and Apps are collectively referred to in this Policy as the “Lioness Service,” and by proceeding to use the Lioness Service you consent that we may handle the data that we collect from you in accordance with this Privacy Policy. This policy may change over time, but any future changes will not affect data that was collected under a previous version of this policy. Please check this page periodically for any changes. You may also be notified of the changes to our policy by email or any other method that Lioness deems appropriate. Your continued use of the Lioness Service after being notified of the changes to our policy will constitute acceptance of our new Privacy Policy. And remember, we’re here to help. If something in this policy does not make sense or if you have any questions, please contact us at help@lioness.io. YOUR CONSENT By accepting Lioness’s Terms of Service (as a user of the Lioness Service) you explicitly consent to this Privacy Policy. INFORMATION THAT YOU PROVIDE TO LIONESS Activate a DeviceWhen activating a Lioness Device, you will be asked to download the Lioness App or install Software and enter information about yourself. Depending upon the specific Device you use, your data may be collected and transmitted to Lioness. Create a Lioness AccountIf you want to access data collected by your Device, you must create a Lioness account. When you create a Lioness account, we ask for some personal information, including your email address, username, and password. Add Info to Your AccountYou can customize your Lioness experience by adding other types of information to your account, such as personalizing your profile with photos, participating in discussion boards, or sending messages. Whenever you add this type of data, we collect it and store it in your Lioness account. Visit Our SitesLioness collects industry standard data from everyone who visits our Sites—even if you don’t have a Lioness account. This includes log data that automatically records information about your visit, such as your browser type, operating system, the URL of the page that referred you, the different actions you performed, and the IP address you used to access pages on the Site. We use this type of information to provide you with an experience that’s relevant to your location based on the IP address, to prevent Site misuse, and to ensure the Site is working properly. We also collect data from cookies. Sync Your DeviceWhen you sync your Device through an App or the Software, data recorded on your Device is transferred from your Device to our servers. This data is stored and used to provide the Lioness Service and is associated with your account. Each time a sync occurs, we log data about the transmission. Some examples of the log data are the sync time and date, device battery level, and the IP address used when syncing. Buy From Our StoreWe do not view or store your credit card information. This is handled by our third-party payment processor. We store your shipping address so we can process your order through our fulfillment partner. If you are logged into your Lioness account when you purchase something on our Site, we associate that order with your Lioness account. Contact UsWhenever you contact Lioness for help, we collect your name and email address along with additional information you provide in your request so that we can provide you with assistance and improve the Lioness Service. This data does not expire, and is retained unless otherwise stated. We only collect information about you when you’re interacting with Lioness Products & Services. WHY WE COLLECT DATA Lioness uses your data to provide you with the best experience possible, to help you learn about your body, and to improve and protect the Lioness Service. Here are some examples: Contact information is used to send you notifications and to inform you about new features or products we think you would be interested in. Please see “Can I Opt-out Of Receiving Lioness Emails?” for information on how you can opt-out of future communications. Data and logs are used in research to understand and improve the Lioness Device and Lioness Service; to troubleshoot the Lioness Service; to detect and protect against error, fraud or other criminal activity; and to enforce the Lioness Terms of Service. Aggregate data that does not identify you may be used to inform the health community about trends; for marketing and promotional use (for example, data may be included in an aggregated and anonymized chart that represents what a user can expect to see in the Lioness app); or for sale to interested audiences. (See “Aggregate Data – Non-Identifying Information” to learn more.) WHAT KINDS OF DATA WE SHARE Data That Could Identify YouPersonally Identifiable Information (PII) is data that includes a personal identifier like your name, email or address, or data that could reasonably be linked back to you. We will only share this data under the following circumstances: With companies that are contractually engaged in providing Lioness with services, such as order fulfillment, email management and credit card processing. These companies are obligated by contract to safeguard any PII they receive from us. If we believe that disclosure is reasonably necessary to comply with a law, regulation, valid legal process (e.g., subpoenas or warrants served on us), or governmental or regulatory request, to enforce or apply the Terms of Service or Terms of Sale, to protect the security or integrity of the Lioness Service, and/or to protect the rights, property, or safety of Lioness, its employees, users, or others. If we are going to release your data, we will do our best to provide you with notice in advance by email, unless we are prohibited by law from doing so. We may disclose or transfer your PII in connection with the sale, merger, bankruptcy, sale of assets or reorganization of our company. We will notify you if a different company will receive your PII and the promises in this Privacy Policy will apply to your data as transferred to the new entity. Aggregate Data (Non-Identifying Data)Lioness may share or sell aggregated data that does not identify you, with partners and the public in a variety of ways, such as by providing research or reports about health and sexuality. When we provide this information, we perform appropriate procedures so that the data does not identify you and we contractually prohibit recipients of the data from re-attributing it back to you. Data That You Direct Us to ShareYou can direct us to share data with other parties. For example, you might authorize us to link your Lioness account with a third-party app (e.g. a period tracking app) or send status updates to your Facebook or Twitter account (an example of this may be a tweet that you explicitly authorize us to send during a promotion or sweepstakes). Once you direct us to share your data with a third party, that data is governed by the third-party’s privacy policy. You can revoke your consent for us to share data with the third party at any time. WAYS YOU MIGHT SHARE YOUR DATA Community PostsThe Lioness Service may offer discussion forums, message boards, social networking opportunities, chat pages and other public forums or features in which you may provide personal information, materials and related content. If you submit personal information when using these public features, please note that such personal information may be publicly posted and otherwise disclosed and used without limitation or restriction. Contests and GiveawaysLioness may offer opportunities to participate in contests, giveaways and other promotions. Any data you submit in connection with these activities will be treated in accordance with this Privacy Policy, unless the rules for those offers note otherwise. SurveysLioness may also ask you to participate in surveys (processed by Lioness or third parties) that help us understand consumer use of the Lioness Service. Any PII you provide to Lioness (or supplied by you or Lioness to such third-party survey providers) in connection with these surveys will only be used in relation to that survey and as stated in this policy. THIRD PARTIES Lioness will not be responsible for the practices of third parties that Lioness does not own or control or individuals that Lioness does not employ or manage. The information provided by you to other third parties may be subject to their own privacy policies, which may differ from Lioness’s privacy policy. The Lioness Service may contain links to other sites, and we make every effort to only link to sites that share our high standards and respect for privacy. However, we are not responsible for the privacy practices employed by other sites. Lioness is also not responsible for privacy or security issues with other Internet websites, even if a user of the Lioness Service posts the external link to the Lioness Service. DATA RETENTION Lioness reserves the right to retain your PII for as long as your account remains active. All information data is retained to comply with this policy or legal obligations. Lioness may continue to use your non-identifying data after you deactivate your account. LIONESS’S POLICIES FOR MINORS Lioness is not directed at persons under the age of 18. We do not knowingly collect any PII from minors under 18. If you are aware of a user under the age of 18 using Lioness, please contact us at help@lioness.io. CAN I OPT-OUT OF RECEIVING LIONESS EMAILS? Lioness may periodically contact you by sending an email newsletter, marketing emails and emails related to new features. You will be able to opt-out of receiving these emails. If you opt out, we may still send you emails related to your account information and related to our business with you. Opting-out of these emails will not end transmission of important service-related emails that are necessary to your use of the Lioness Service. HOW DOES LIONESS KEEP MY DATA SAFE? Lioness uses a combination of technical and administrative security controls to maintain the security of your data. If you have a security-related concern, please contact Customer Support. CONTACT US PLEASE CONTACT US IF YOU HAVE ANY QUESTIONS ABOUT THIS POLICY.Lioness2001 Addison Street, Suite 300Berkeley, CA 94704203-805-8790help@lioness.io",
      "content_type": "other",
      "source_url": "https://lioness.io/pages/privacy-policy"
    },
    {
      "title": "Limited Warranty, Support & Return Policy | Lioness",
      "content": "Limited Warranty Lifetime Support We will always stand behind our products, and even outside of warranty period do whatever we can to help support you. It's hard to legally quantify, but we haven't abandoned any customers who need help and don't intend to start now. Our technical support doesn't expire. See our reviews for happy customers who have reached out. Don't ever hesitate to get in contact with us for questions, concerns, feedback (or most anything at all). Lioness Return Policy Due to the intimate nature of this product, merchandise may not be returned if opened from factory-sealed plastic wrap. Purchases made directly from Lioness at lioness.io may be returned if unopened from its factory-sealed plastic wrap within 60 days of receipt for refund or exchange, minus a $20 return shipping fee for packages shipped in the United States. We do not currently allow international returns. If defective, the product is covered under the Two Year Limited Warranty and will not incur a fee. Two Year Limited Warranty Due to the intimate nature of this product, merchandise may not be returned unless defective. This product is covered by Product Warranty for TWO (2) YEARS from the date of delivery of initial purchase against defects due to faulty production or materials. During this time period, the product may be replaced ONCE if initial purchase is defective. This warranty does NOT cover cosmetic deterioration caused by wear and tear, damages caused by natural disaster, damages by use at wrong voltage, damaging the Lioness by misusing the charger cord, using silicone-based lubricants or oils on the product, or any other misuse or neglect not in accordance with the included instruction manual. Any attempt to open or take apart this product or its accessories will void the warranty. In the event that this product fails during the warranty period, you must email us at help@lioness.io and provide us with valid proof of the date of original purchase. We will provide you with a Return Merchandise Authorization number, which must be displayed on the outside packaging. Customers based outside of the United States will need to pay for shipping. In the event we replace the faulty product at no extra charge, any replacement Lioness will not extend the life of this warranty. Limited Warranty Lifetime Support We will always stand behind our products, and even outside of warranty period do whatever we can to help support you. It's hard to legally quantify, but we haven't abandoned any customers who need help and don't intend to start now. Our technical support doesn't expire. See our reviews for happy customers who have reached out. Don't ever hesitate to get in contact with us for questions, concerns, feedback (or most anything at all). Lioness Return Policy Due to the intimate nature of this product, merchandise may not be returned if opened from factory-sealed plastic wrap. Purchases made directly from Lioness at lioness.io may be returned if unopened from its factory-sealed plastic wrap within 60 days of receipt for refund or exchange, minus a $20 return shipping fee for packages shipped in the United States. We do not currently allow international returns. If defective, the product is covered under the Two Year Limited Warranty and will not incur a fee. Two Year Limited Warranty Due to the intimate nature of this product, merchandise may not be returned unless defective. This product is covered by Product Warranty for TWO (2) YEARS from the date of delivery of initial purchase against defects due to faulty production or materials. During this time period, the product may be replaced ONCE if initial purchase is defective. This warranty does NOT cover cosmetic deterioration caused by wear and tear, damages caused by natural disaster, damages by use at wrong voltage, damaging the Lioness by misusing the charger cord, using silicone-based lubricants or oils on the product, or any other misuse or neglect not in accordance with the included instruction manual. Any attempt to open or take apart this product or its accessories will void the warranty. In the event that this product fails during the warranty period, you must email us at help@lioness.io and provide us with valid proof of the date of original purchase. We will provide you with a Return Merchandise Authorization number, which must be displayed on the outside packaging. Customers based outside of the United States will need to pay for shipping. In the event we replace the faulty product at no extra charge, any replacement Lioness will not extend the life of this warranty.",
      "content_type": "other",
      "source_url": "https://lioness.io/pages/limited-warranty"
    },
    {
      "title": "Security - Lioness",
      "content": "Security Your Security and Privacy is Paramount to us at Lioness Lioness constantly working to improve our apps, services and products for a better and safer experience. We see as core to our users feeling safe, secure, and confident in exploring their sexual wellness—which is the ultimate mission of our company. We are committed to working with security researchers and the community to verify, reproduce, and respond to reported vulnerabilities. Scope Vulnerabilities on all Lioness apps and Lioness owned domains are covered under this program. Specifically: *.lioness.io Rules of Engagement and Exceptions Any activity that would disrupt, damage or adversely affect any third-party data or account is not allowed. Please do not mass create accounts to perform testing against Lioness applications and services. Also, do not perform brute force testing to determine whether rate limiting is in place for particular APIs or pieces of functionality. Do not publicly disclose any vulnerabilities before you inform us and received a reply from us when it will be fixed. Do not publicly disclose any user information and data even after the bug have been fixed. The following are strictly prohibited: Denial of Service attacks. Physical attacks against offices and data centers. Social engineering of our service desk, employees or contractors. Compromise of Lioness users or employees account. Automated tools or scans, botnet, compromised site, end-clients or any other means of large automated exploitation or use of tool that generates a significant volume of traffic. Reporting If you discovered a security vulnerability, please email security@lioness.io. We will respond as quickly as possible to your submission. Please include A summary of the problem A sequence of steps that can be used to reproduce the problem We will diligently investigate the details of the issue and will work with you to understand the scope of the issue presented. We will keep you updated as we work to fix the bug you submitted. Although we strive to respond as quickly as possible to all disclosures, please understand that we may be short-staffed on weekends and major holidays, and it may take longer for us to investigate. Acknowledgements We value the contributions by security researchers in improving the security of our products and service offerings. We do not have a bounty/cash reward program for vulnerability disclosures. At our sole discretion, we may give you a reward if we deemed the vulnerability is critical. To express our gratitude for your contribution, we would acknowledge your contribution on our website. Please let us know if you prefer to remain anonymous. Wall of Thanks: Gaurang Maheta - pointing out outdated jQuery 1.12.4 on lioness.io website on 2024-05-04. Discovered to be from Shopify's deprecated Product Reviews app and fixed. Security Your Security and Privacy is Paramount to us at Lioness Lioness constantly working to improve our apps, services and products for a better and safer experience. We see as core to our users feeling safe, secure, and confident in exploring their sexual wellness—which is the ultimate mission of our company. We are committed to working with security researchers and the community to verify, reproduce, and respond to reported vulnerabilities. Scope Vulnerabilities on all Lioness apps and Lioness owned domains are covered under this program. Specifically: *.lioness.io Rules of Engagement and Exceptions Any activity that would disrupt, damage or adversely affect any third-party data or account is not allowed. Please do not mass create accounts to perform testing against Lioness applications and services. Also, do not perform brute force testing to determine whether rate limiting is in place for particular APIs or pieces of functionality. Do not publicly disclose any vulnerabilities before you inform us and received a reply from us when it will be fixed. Do not publicly disclose any user information and data even after the bug have been fixed. The following are strictly prohibited: Denial of Service attacks. Physical attacks against offices and data centers. Social engineering of our service desk, employees or contractors. Compromise of Lioness users or employees account. Automated tools or scans, botnet, compromised site, end-clients or any other means of large automated exploitation or use of tool that generates a significant volume of traffic. Reporting If you discovered a security vulnerability, please email security@lioness.io. We will respond as quickly as possible to your submission. Please include A summary of the problem A sequence of steps that can be used to reproduce the problem We will diligently investigate the details of the issue and will work with you to understand the scope of the issue presented. We will keep you updated as we work to fix the bug you submitted. Although we strive to respond as quickly as possible to all disclosures, please understand that we may be short-staffed on weekends and major holidays, and it may take longer for us to investigate. Acknowledgements We value the contributions by security researchers in improving the security of our products and service offerings. We do not have a bounty/cash reward program for vulnerability disclosures. At our sole discretion, we may give you a reward if we deemed the vulnerability is critical. To express our gratitude for your contribution, we would acknowledge your contribution on our website. Please let us know if you prefer to remain anonymous. Wall of Thanks: Gaurang Maheta - pointing out outdated jQuery 1.12.4 on lioness.io website on 2024-05-04. Discovered to be from Shopify's deprecated Product Reviews app and fixed.",
      "content_type": "other",
      "source_url": "https://lioness.io/pages/security"
    },
    {
      "title": "Contact Information & Customer Support | Lioness",
      "content": "Search 0 Cart Shop Lioness Vibrator Lioness Charger Cable Everything but the O Bundle How It Works How Lioness Vibrator Works Live View Remote Control Participate in Research Reviews Research FAQ Frequently Asked Questions Sezzle Now, Pay Later How People Have Explored With Lioness Sex Guides Lioness Vibrator Anatomy Orgasm Masturbation Relationships Health See All Guides 0 Cart THE VIBRATOR Lioness Smart VibratorThe Ultimate O BundleSpare charger THE CBD Vella Pleasure SerumForia Intimacy MeltsForia Booty Melts THE MERCH StickersHatsSocksTote bagsShop All CONTACT USCustomer Support:Visit help.lioness.io for the customer service portal or contact support@lioness.io.Press:press@lioness.ioAll other questions: support@lioness.ioCONTACT USCustomer Support:Visit help.lioness.io for the customer service portal or contact support@lioness.io.Press:press@lioness.ioAll other questions:support@lioness.io Search our shop What are you looking for? What are you looking for? One or more of the items in your cart is a recurring or deferred purchase. By continuing, I agree to the cancellation policy and authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted. Checkout:Agree:",
      "content_type": "other",
      "source_url": "https://lioness.io/pages/contact-us"
    },
    {
      "title": "Subscribe to the Lioness Newsletter",
      "content": "Join the Lioness Newsletter Pride Join the Lioness Newsletter Pride",
      "content_type": "other",
      "source_url": "https://lioness.io/pages/subscribe"
    },
    {
      "title": "Military Discount During Memorial Day Weekend Sale - Lioness",
      "content": "$20 Discount through ID.Me for Military, Educators, and Healthcare Workers We offer a $20 discount on the Lioness when it is priced at $199 or above for verified military service members, educators, and healthcare workers. To redeem, look for the ID.me discount button below during checkout to verify your credentials and apply the discount automatically after verification. Discount cannot be combined or used towards previous purchases. One discount per person. $20 Discount through ID.Me for Military, Educators, and Healthcare Workers We offer a $20 discount on the Lioness when it is priced at $199 or above for verified military service members, educators, and healthcare workers. To redeem, look for the ID.me discount button below during checkout to verify your credentials and apply the discount automatically after verification. Discount cannot be combined or used towards previous purchases. One discount per person.",
      "content_type": "other",
      "source_url": "https://lioness.io/pages/military-discount-memorial-day-sale"
    },
    {
      "title": "404 Not Found - Lioness",
      "content": "Page Not Found Whoops! That page doesn't exist. Try searching below or check out the new and improved Lioness 2.0 here! What are you looking for? Whoops! That page doesn't exist. Try searching below or check out the new and improved Lioness 2.0 here! What are you looking for?",
      "content_type": "other",
      "source_url": "https://www.lioness.io/en/"
    },
    {
      "title": "Lioness: Pleasure. Proof. Progress",
      "content": "YOU DESERVE BETTER Better Os. Better intimacy. Better sexual health.Improve your orgasms with the Lioness, the award-winning vibrator that puts the power of pleasure in the palm of your hand. SHOP NOW The proof is in your pleasure What would you do if you had the information needed to see and improve your orgasm? No other vibrator can show you how things like sleep, caffeine, stress, medicine, and more impact your orgasm. Don’t just masturbate. Masturbate smarter. SHOP NOW Get to know your \"O\" Most people have one of three orgasm patterns: LEARN MORE Approved by Experts \"Sexuality is multi-faceted, but one of the most important factors is understanding your own body well. Lioness is the only device tailor-built to support this purpose.\" Dr. Michael KrychmanOB/GYN, clinical sexual counselor, & Executive Director of SoCal Center for Sexual Health & Suvivorship Medicine \"What Lioness has done is truly groundbreaking research on what's happening with the pelvic floor muscles during female orgasm, which has been understudied for decades.\" Dee Hartmann, PT, DPTWomen's Health Physical Therapist, Researcher, & Co-author of The Pleasure Prescription The vibrator has been upgraded Masturbation is a normal, healthy part of being human — but finding ways to improve your experience can be hard. Our team at Lioness is here to change that, one orgasm at a time. The Lioness Smart Vibrator perfectly blends the power of technology with the power of pleasure, making it easy to see and improve your orgasms. The Team",
      "content_type": "other",
      "source_url": "https://lioness.io"
    },
    {
      "title": "Lioness Review: Masturbating In The Name Of Science & Motherhood",
      "content": "What Lioness Means to Me - A Series by Lioness Team Collaborator June 21, 2020 6 min read lioness review vibrator By Stephanie Delgado, featuring Rachael WebsterWant to share a story? Check outthis page for more details! When the Lioness Vibrator was designed, sexual pleasure was not the only thing in mind; sexual exploration and understanding were also at the forefront. As Liz has mentioned in numerous interviews (likethis one with Nicole Dahlstrom from Women of Wearables) theLioness Vibrator came from the idea that we should be able to \"learn, explore, and have fun with our sexuality that [is] as diverse as our bodies and our experiences.” If you’ve taken a look at Lioness Vibrator reviews, you know it’s no secret that it’s a great sex toy and rabbit vibrator. Still, it’s important to acknowledge just how great it is as a biofeedback device. This idea that you can visualize, understand, and improve your own sexual relationship with yourself is revolutionary. In a world where masturbation for people with vaginas is still taboo, it’s so important to be able to make space for the learning, exploration, and fun Liz and Anna had in mind when they developed the Lioness Smart Vibrator. This is why we came up with the “What Lioness Means to Me” series. We want to be able to go a step beyondLioness Vibrator reviews. We want to highlight the Lioness’s capabilities while giving all of those in our Pride the chance to speak for themselves. Below is the first in our series, a submission from Rachael. Rachael is a mom, a woman with a Ph.D., a college professor, and a self-proclaimed Lioness enthusiast. Check out her story below: Masturbating in the Name of Science and Motherhood It might sound like an exaggeration, but the Lioness Vibrator honestly changed my life. It changed how I view myself as a woman and how I communicate with others about my sexual well-being. As a Ph.D. scientist, college professor, general aviation pilot, PTA president, and mom, I have never put limits on what I can accomplish. I feel like I have the confidence and courage in so many parts of my life, but my sexual well-being has never been something I felt comfortable talking about. It wasn't that I was ashamed of anything specific, but I was never taught how to talk about it openly. Upon entering mid-life, I was grappling with the cliched question of “Who am I?” I felt like I lost my identity as I transitioned from being a daughter to a friend to a student to wife to professor to mother and I didn’t know where to go next. As I was struggling to find myself, my husband also was wrestling with his own mid-life crisis, which unfortunately ended up in us separating after being together for 20 years. As I was surveying the pile of rubble that was left of my life, I found the answer to my question of who I am: re-invention. I have continuously reinvented myself over the years to become who I needed to be to face life’s challenges, but I always crafted myself in relation to my immediate situation or someone else’s needs. This time, however, I chose to reinvent myself by uncovering the truths about who I really am. Little did I know, some of those truths would be discovered when I found a box collecting dust... Truth #1: I bought my Lioness to support their vision. My Lioness sat in its box for years. I actually asked my then-husband to purchase the Lioness Vibrator for me as a gift, but I had no intention of using it. This was when the Lioness first started advertising its product and I bought it for one reason only; I heard about this passionate women-led company that had an amazing product that was facing backlash from a culture with a double standard. Erectile dysfunction medication can be promoted everywhere, but how dare a \"wearable device\" company that visualizes data about a very common and physiologically-relevant biological process in over half of our population even think about advertising? The stigma and implied shame really spoke to me and I wanted to do what I could to show my support for this group of people who believe in something that is so fundamental. Truth #2: I was a stranger to my own orgasm magic. Besides a few romantic encounters with a showerhead and enjoying climbing the rope in gym class when I was a teenager, I had never experienced an orgasm outside of sex with a partner. I never gave it much thought and didn't feel like it was something I needed in my life. Given that, the Lioness was the first vibrator I ever purchased and used for my own personal pleasure. Truth #3: The Lioness vibrator normalized masturbation for me. Before I had graphs to visualize my masturbation, I didn't understand how to incorporate masturbation into my life in a way that didn't make me feel awkward. However, because I'm a numbers dork, having a quantitative reason to try the Lioness made it feel just like a FitBit or any other wearable device. The Lioness collects data about a physiological body process just like heart rate, so what's the big deal? Truth #4: Lioness has become a way for my mother and me to discuss topics we couldn’t before. I bought another Lioness Smart Vibrator and gave it to my mother for Christmas. My mom is someone in my life who has inspired me to always be true to myself. She has been an incredible role model for so many things, but sexual well-being and female masturbation, like in many households, was an awkward topic that she just didn't know much about or know how to talk about. Given my newfound excitement about the Lioness, I was able to show her the app and explain one of my graphs. The Lioness has let me feel personal freedom that I didn't know was possible and I wanted to share that with her and start the conversation in a way that conveyed love, support, and promoted well-being. She has since reported back that it worked well. :) Truth #5: I’m no longer ashamed to talk about masturbation. Thanks to my Lioness Vibrator, I can talk to my kids and friends about masturbation without shame. My kids have seen my Lioness and I have explained to them what it is. My son will probably need nothing more than a sock and hand lotion when he is of that age, so I plan on buying my daughter a Lioness when she is a teenager. There is no reason why she should live in apprehension like I did for most of my life about a very natural process that can give her so much freedom and pleasure. In addition, many of my mom friends are scientists and engineers who also feel awkward about talking about female masturbation (not something that rolls off the tongue at the playground), but with the graphical representation of my orgasm data, I am able to whip out my phone and have serious discussions about this previously taboo subject! Truth #6: I am an avalanche. The Lioness is an amazing vibrator, but what sets it apart is its ability to quantify the orgasm process by measuring pelvic floor contractions. Not only do I feel intense physical pleasure, but I also experience awesome mental pleasure by pouring over my own data after each session. There is very little research done on female orgasms (which baffles me), but with the Lioness, I was able to see which type of orgasm pattern I experience and that it is totally repeatable. How cool is that?! The Lioness has honestly changed my life. It has brought me closer with my mother, has opened up a dialogue with my kids that I hope to keep alive as they enter the awkward teenage years, and helped me experience a sense of personal freedom and pleasure that I never knew I could experience. Thank you Lioness for bringing all of these truths into my life and helping me discover who I really am. If you’re interested in sharing your own personal journey with your Lioness vibrator, check out this page to learn more. We’d love to discuss the potential of featuring your experience on our blogs. === Explore and see what you like most with theLioness! The Lioness Smart Vibrator 4.59 / 5.00 starsRead customer reviews Take sexual exploration to the next level. See, track, and improve your orgasms with this award-winning vibrator that uses cutting-edge technology. Top Stories Is there a difference between male and female orgasms? How to use Lioness Smart Vibrator as a couples sex toy Live view: See your orgasm in real time with Lioness Related Stories Lioness vs. Researcher: a PhD experiments with her orgasms An artist navigates painful sex with the Lioness Vibrator Interview with Von, the pop star who makes music from her orgasm data Related Blog Posts How to Orgasm During Sex: Science-Based Guide for Women couples guide orgasm relationship by Anna Lee September 07, 2025 6 min read Read more Sexperiment Results: Does edging improve orgasms? Lioness users around the world delayed their orgasms for science. Here's what the data shows: data edging lioness vibrator by Kate Delgado August 29, 2025 2 min read Read more How people have explored with Lioness There are a variety of ways people can explore with the Lioness Vibrator. Whether you have a question, want to improve pleasure or intimacy, or just want to have fun, there's always something new to explore. Plus, we are constantly adding new features and functionality via free iOS and Android app updates for even more ways to learn and play. We've included several examples of what you could do with Lioness. data guide lioness vibrator vibrator by Anna Lee August 12, 2025 4 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/what-lioness-means-to-me-a-series"
    },
    {
      "title": "How To Use The Lioness Smart Vibrator As Couples Sex Toy",
      "content": "How to use the Lioness Vibrator as a couples sex toy by Liz Klinger December 12, 2018 8 min read app communication couples dating general guide high tech high tech sex toy orgasm relationship sex toy techniques vibrator Although the Lioness Vibrator is primarily thought of as a product forself-discovery, it’s also a great tool forour-discovery. Basically, what I’m saying is that it can also be one of the best sex toys out there for couples. Will I or my partner become overly reliant or desensitized by it? Nope. We did another story that goes into greater detail about the topic (you can read it here), but basically, you or your partner would not become overly reliant or desensitized by a sex toy. Desensitization from vibration can happen in cases such as if you’re in the construction industry working with large, industrial equipment every day, not using a comparatively small vibrator now and then (or even every day). You should be good in that department. 👍 For those of you unfamiliar with this reference, he's saying \"They took our jobs!\" ... thank you South Park, lol Will this vibrator (or any toy) replace me or my partner? No—I’d hope you wouldn’t compare your awesome self to an inanimate object! Introducing a variety of different sex toys can add some much-needed spice to your sex life (though we first recommend having a conversation about it with your partner before starting out). It’s also a great way to start more conversations about pleasure, learn about what you both like, and explore new heights of pleasure you never knew existed before. Think of it like going on a date to an exotic location, going to a hip new restaurant, or gifting some fine jewelry... Only better, because unlike a trip or a meal, a great sex toy is the gift that keeps on giving for years to come... and how often will they wear that expensive jewelry, anyway? In the case of our product the Lioness, we’ve heard back from a number of couples who use the Lioness together in different ways and tell us how it has benefitted their relationship and made things more...interesting (in a good way). Back up, what is the Lioness Vibrator? Lioness is a smart vibrator made by a team of badass women engineers and designers that is able to capture then visualize arousal and orgasm from pelvic floor movements (vaginal contractions or anal contractions for anybody). If you’re looking for a sex toy that does something different than anything else, this definitely checks that box. You can also use Lioness as a remote control vibrator (local remote control now, online control available later this year as an app update). Unlike other remote control vibrators, you can see arousal and orgasmic response in real time from the app. That way, you know what movements and sensations work so you can be intimate and learn about each other's preferences at the same time. Example of pelvic floor contraction patterns that characterize an orgasm How have couples used the Lioness together? Couples have gotten very creative with how they’ve used the Lioness Vibrator in obvious and not-so-obvious ways. Ultimately, they’ve used the information and features to have better sex (with and without the vibrator). Pleasure can change a lot over time and differs from person to person 1. Learn what your partner likes (and doesn't like) Everyone is different. Your previous partner might like one thing, but your current partner may like something completely different. In comparison to other products out there, Lioness gives you the low-down on what your partner likes so you can know how to better please them. Furthermore, the mere conversation about sex is a taboo topic that many of us feel ashamed to talk about and is actively censored by nearly all major social platforms. Consequently, most of us keep things to ourselves, and we don’t learn other perspectives or how to empathize with others who have experiences outside of what we’ve personally encountered. Lioness can help you put aside your assumptions and learn what you (or your partner) likes and their body—as well as how preferences change over time. “It's been fun looking at the data and comparing notes...I appreciate getting new things all the time.” — Tom “I love how it tells me how my orgasims are while using it during sex with my boyfriend or by myself. I also love the settings that I can use to make it more intense or not so intense with the vibration settings. I would love to see it happen on the app as I'm actually orgasiming” — Sherry (real time on the app is now available as a free update on the Lioness app — check it out here!) 2. Open up the conversation about pleasure Sex can be difficult to talk about for all sorts of reasons. Just look at reddit's \"bad womens anatomy\" subreddit and you’ll see what I mean. Although this subreddit showcases some of the more extreme misconceptions about women and sex, many of us have misconceptions on some level. It’s no surprise, either… Many of us don’t get great sex education (orany in some cases — and ongoing education after grade school is nearly non-existent). Because of that, we often don’t have the language or framework to convey our experiences very well. Most importantly, our sexual preferences are shaped by our previous experiences (take this person whose orgasms became \"shitty\" overnight after a concussion), other things going on in our lives, anatomy, things like alcohol or cannabis, and even down to how we’re feeling that day. It’s not just simply being aroused, turned on, or having an orgasm means that you’re attracted/in love/etc. with another person. If only sex were that simple... right? Unfortunately, the reality is that it’s not, but it’s not a mystery, either. We’ve found that Lioness has been a great way to present information about personal pleasure in a way that’s tangible and helps couples learn how to have better sex. Consider this review of Lioness from a journalist at Glamour: “[Lioness] also helped me discuss my sexuality with my partner...Hearing my partner point to a chart and say, \"Is that your orgasm?\" broke down a barrier for us; we hadn't talked about my satisfaction that openly and frankly before. The fact that it was charted out made it more accessible and allowed for a clinical distance, like looking at a math problem rather than analyzing something so deeply personal.” Using Lioness has also helped to figure out what works and doesn’t work, especially in cases where you have questions about why things feel uncomfortable. “I had been dealing with pain during intercourse for the last five years. My boyfriend always worked with it and was understanding, but I was frustrated and ashamed that this issue seemingly came out of nowhere where...Using the Lioness a few times solo first helped me feel at ease and empowered to ask - I’m happy to report that I’ve been able to consistently have painless sex since getting the Lioness! It also felt like opening the floodgates of communication - our relationship has benefitted from it both in intimacy and emotion, and it encouraged my boyfriend to be more open with me as well.” — AM 3. Have fun! Be a little naughty ;) We’ve heard of couples enjoying sharing their “sessions”. With a screenshot, you can share an interesting insight from a recent session with your partner just like you’d share any other picture over your messaging app of choice. It strikes up a conversation, lets them know you’re being a little randy, and also lets them know you’re thinking of them. If you want to jazz up your orgasm a bit, you can also turn your orgasm into art and share it with your partner, too—one of our newest features enables just that (you can learn more about that here). It’s also a hint of some of the new experiences to come... Newest features Available as free app updates on iOS and Android One of the coolest things about Lioness is, even after you buy it, you continuously get new features and functionality from it over time, opening up the variety of experiences you can share together with your partner. It’s the only vibrator out there that can do that, and we’ve been adding a variety of new functionality to it since it first launched over a year ago. So without further ado, these are some of the newest features you can explore with the Lioness Vibrator! (Last updated 3/11/2019) 1. Remote control vibrator One of the more common features out there, but for some couples, it’s essential to their sexual exploration together. It’s something we've working on introducing for a while, especially because many remote control sex toys in the past have had issues maintaining a connection, and we have high standards for anything we roll out, we’re designing our remote control feature so it can maintain a smoother connection... 2. “Live View” — see your orgasms in real-time from the app See orgasms in real-time while using the Lioness Vibrator. This is something that is unique to the Lioness Vibrator because of its specific suite of sensors, Artgasm, and the AI/ML that powers things. People have already found ways to can tinker with this from what’s already on the Lioness app. We’ve had a few creative people do this at play parties already, so we worked on something that is easier and smoother for anyone with a Lioness to use. “Another creative use of the “Game” functionality that we’ve heard is creating live shows where an individual masturbates with the Lioness with the display projected on-screen from their mobile device. This is able to create an interesting and unique backdrop for larger parties. We’ll actually be rolling out (very soon) the ability to apply the real-time data to our Artgasm visualization (as shown below), which also captures motion and motor settings in addition to vaginal contractions.” “… it was a bigger event and we had a bunch of couples here. We were still getting to all know each other, but it was really hot to see one woman pleasing herself and us being able to actually see her vag’s response. We didn’t have the best setup, since it was just on the phone, but it was still pretty hot. I’m looking to have a projector next time.” — Liza (And, of course, if swinger or play parties aren’t your thing, you can also do something similar privately with just you and your S.O.) 3. Remote “Live Sex” If you can do remote control and remote imagery… you can do remote “live sex”. As another dimension for adding connection and intimacy with your partner, you can control the vibrator, see your partner (via your messaging app of choice),andeven see them become more aroused and orgasmic in their own, unique way. You could also play around with techniques like orgasm control and explore all sorts of ways to make them (or you) orgasm in a variety of ways. “I've found it especially useful for doing edging or orgasm control with someone new. It's not something you don't learn over time, but it both speeds up the process and makes it a lot easier to do new stuff and see how it affects things.” — Alex What are you waiting for? Have better sex with Lioness. I did say that this is the gift that keeps on giving. 😉 === Intrigued? Find out more about The Lioness here! Lioness is the first and only vibrator that helps you improve your orgasms.The world’s most advanced vibrator. Precision sensors let you literally see your arousal and orgasm. Experiment, understand yourself, and have better orgasms—after all, as the saying goes, “never measured, never improved.”Click hereto learn more about the Lioness. Related Blog Posts How to Orgasm During Sex: Science-Based Guide for Women couples guide orgasm relationship by Anna Lee September 07, 2025 6 min read Read more Sexperiment Results: Does edging improve orgasms? Lioness users around the world delayed their orgasms for science. Here's what the data shows: data edging lioness vibrator by Kate Delgado August 29, 2025 2 min read Read more How people have explored with Lioness There are a variety of ways people can explore with the Lioness Vibrator. Whether you have a question, want to improve pleasure or intimacy, or just want to have fun, there's always something new to explore. Plus, we are constantly adding new features and functionality via free iOS and Android app updates for even more ways to learn and play. We've included several examples of what you could do with Lioness. data guide lioness vibrator vibrator by Anna Lee August 12, 2025 4 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/how-to-use-the-lioness-vibrator-as-a-couples-sex-toy"
    },
    {
      "title": "Privacy and Security - Lioness",
      "content": "Search 0 Cart Shop Lioness Vibrator Lioness Charger Cable Everything but the O Bundle How It Works How Lioness Vibrator Works Live View Remote Control Participate in Research Reviews Research FAQ Frequently Asked Questions Sezzle Now, Pay Later How People Have Explored With Lioness Sex Guides Lioness Vibrator Anatomy Orgasm Masturbation Relationships Health See All Guides 0 Cart THE VIBRATOR Lioness Smart VibratorThe Ultimate O BundleSpare charger THE CBD Vella Pleasure SerumForia Intimacy MeltsForia Booty Melts THE MERCH StickersHatsSocksTote bagsShop All undefinedPrivacy and SecurityIs my data stored securely and kept confidentially?Absolutely. Everything is encrypted and we fully anonymize the data—even we do not know who is who. Our guiding principle is that we treat your data the same way we would want our own to be treated. We follow security best practices and consistently keep our systems up-to-date to deal with the latest threats. But all of that just does what we consider the bare minimum and doesn't prevent abuse or misuse of data. Because of our focus on this topic, we have a few core philosophies that we hold regarding data:Always anonymous. We're a data-based product and company, and the value we provide to users is from that. But not everything provides you value—namely, personally-identifying information (PII). We always fully encrypt our databases, and go above and beyond in fully anonymizing our users, and studiously avoiding collecting PII unless necessary. This is because we realize something a lot of other companies don't. Collecting everything \"just in case\" rarely ever pays off... but always has a big cost in risk to your privacy. We don't play those games with your data.Explicit, enthusiastic, informed consent. Related to understanding data is both value but also liability, we don't secretly trawl your entire life in the background. We strive in our design to always be clear what is being collected and, if not obvious, why. Our mindset is if we went through each piece of data we collect, the answer should be an enthusiastic answer yes to what is provided. In fact, we go so far as to build in explicitness even in our UI—your vibrator never sync or secretly sends anything. You MUST explicitly hit the sync button on the app for it to ever communicate. We're not fans of cloak and dagger, not with our intimate products.Defense-in-depth, minimize attack surface. We're not an old traditional company trying to adapt to the new digital world. Our team are from some of the top technology companies in the world, and we understand the realities of security in this age of cyber threats. We build our systems like a medieval castle—layers upon layers. Although we don't expect it to happen, if our public endpoints are breached, they don't actually hold data. Even if our private networks are breached, our databases are encrypted, and hence gibberish without our private keys. Even if our databases are decrypted, all user data is one-way hashed, so it can't be backed out without a complete user list. But even if OUR servers are hacked, our authentication servers with user lists are NOT kept with us—they at one of the top authentication and security providers in the world. So the hackers now need to go breach them. And so on and so forth. We know being tested in security isn't matter of if, but when, and treat your data as we do our own.So, what DO we do with the data? Well, with the anonymized data, we use it internally to learn new things, improve our app, and most importantly, further our knowledge of female sexuality. A lot of this requires volunteers where we can have known data points, and then extrapolate the benefits of that knowledge to the fully anonymized pool (and also be able to then do validation that what we're seeing is actually more broadly reflected in the female population). Our access to this kind of information is unprecedented, and we’re dedicated to using this for good.For example, in our exploration of orgasm patterns, we were able to replicate some of the physiological studies last done in the 1980s (... with a sample size of 11), and find things that are suggestive that there's even more to uncover). As a part of our mission, we are eager to continue these kinds of advancements. In fact, we're working on partnerships with outside academic and medical researchers right now. However, in all of those cases, we will only share data if the user has specifically opted in—especially since academic research by its very nature requires FAR more identifying data than we've been comfortable collecting. (Our CTO lays out some of the differences between what we do and academic research here) As part of that, we're still figuring out the right balance. No matter what, though, we promise that it won't just \"magically\" happen in the background. Everything MUST be explicit and clear.The way we see it, for some folks, privacy is freedom. For others, contributing and participating in science and research can be exciting and fulfilling. But whatever decision it is must be informed by direct, clear consent. We're not fans of the 10,000 word terms of services that bury this stuff and suddenly change where you stand without you knowing. If we're using the data for something that might risk unveiling you, we'll let you know and only do it if you consent.See Other Frequently Asked Questions Search our shop What are you looking for? What are you looking for? One or more of the items in your cart is a recurring or deferred purchase. By continuing, I agree to the cancellation policy and authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted. Checkout:Agree:",
      "content_type": "other",
      "source_url": "https://lioness.io/pages/privacy"
    },
    {
      "title": "Sex Guides by Lioness Tagged \"lioness\"",
      "content": "Sex Guides All Categories accessible alcohol anal anal play anatomy anorgasmia anxiety app asmr bdsm birth blow job bodily functions bondage book books butt caffeine cannabis cbd censorship clit pump clitoris communication coronavirus couples data dating dildo double penetration edging erotica female prostate femtech fetish fingering foreplay g-spot gender gender identity general gift guide guide health high tech high tech sex toy history holidays hormones internet intimacy iud kegel kink lgbtq+ libido lioness lioness vibrator live view long distance long distance relationship lube lubricants marijuana masturbation men menopause menstruation midlife music news non-monogamy oral sex orgasm parenthood parents pegging perimenopause period pleasurable pmdd pornography pregnancy prostate queefing rabbit vibrator relationship remote control research retail review science self-care senior sensory sex sex club sex clubs sex furniture sex life sex machine sex positions sex toy sex toys sexperiments social issues squirting storage storing sex toys swingers techniques technology testosterone traveling vacation vagina vibrator vr vulva women yoni eggs Sexperiment Results: Does masturbating somewhere new make orgasms better? Here’s how masturbating somewhere new went for Lioness users during the month of April. by Kate Delgado 3 min read Read more 6 Things a decade of orgasms have taught us What ten years, 300,000 orgasms, and a boatload of pelvic floor contractions have taught us. by Kate Delgado 5 min read Read more Sexperiment Results: Do blindfolds make orgasms and arousal better? In the spirit of all things spooky, Lioness users spent the month of October experimenting with pleasures they couldn’t see. by Kate Delgado 2 min read Read more A Smart vibrator is a rumbly vibrator You don't have to choose between quiet and rumbly when you choose Lioness. by Kate Delgado 2 min read Read more Sexperiments Results: Are orgasms better in the morning? Are orgasms better first in the morning? Here are the results... by Kate Delgado 2 min read Read more 3 sessions you need to use the Lioness Smart Vibrator for edging and orgasm control by Kate Delgado 4 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/tagged/lioness"
    },
    {
      "title": "Sex Guides by Lioness Tagged \"review\"",
      "content": "Sex Guides All Categories accessible alcohol anal anal play anatomy anorgasmia anxiety app asmr bdsm birth blow job bodily functions bondage book books butt caffeine cannabis cbd censorship clit pump clitoris communication coronavirus couples data dating dildo double penetration edging erotica female prostate femtech fetish fingering foreplay g-spot gender gender identity general gift guide guide health high tech high tech sex toy history holidays hormones internet intimacy iud kegel kink lgbtq+ libido lioness lioness vibrator live view long distance long distance relationship lube lubricants marijuana masturbation men menopause menstruation midlife music news non-monogamy oral sex orgasm parenthood parents pegging perimenopause period pleasurable pmdd pornography pregnancy prostate queefing rabbit vibrator relationship remote control research retail review science self-care senior sensory sex sex club sex clubs sex furniture sex life sex machine sex positions sex toy sex toys sexperiments social issues squirting storage storing sex toys swingers techniques technology testosterone traveling vacation vagina vibrator vr vulva women yoni eggs The Lioness Vibrator: 5 Questions that Needed to Be Asked After my first foray with the Lioness Vibrator, there was no denying that orgasms were going to come easily. I lasted a whopping 2 mins and 49 seconds with the actual sex toy and found my original questions answered completely. But masturbating with the Lioness goes beyond each session. Once I opened the app and synced my session, I found I had a few more questions! So, like any good amateur Sexual Scientist would do, I took my questions straight to the source: Liz Klinger, CEO & Co-founder of Lioness. Whether you’re interested in purchasing a Lioness, or have one in the mail on its way to you, I highly encourage reading through my questions before giving your own smart vibrator a whirl. by Kate Delgado 6 min read Read more Crave Vesper Makes Me Feel Fancy While Having Orgasms When experimenting with Lioness, I’ve sometimes given the suggestion of trying different sensations with different external stimulators, using the Lioness more a measurement tool by keeping the vibration off using the customizable vibration settings. This is an example of what I mean — here, I’ll use the Vesper while using the Lioness’s biofeedback technology to show arousal and orgasm. This is my second in a series, the first being the Zumio. by Liz Klinger 5 min read Read more What Lioness Means to Me - A Series In a world where masturbation for people with vaginas is still taboo, it’s so important to be able to make space for the learning, exploration, and fun Liz and Anna had in mind when they developed the Lioness Smart Vibrator. This is why we came up with the “What Lioness Means to Me” blog series. We want to be able to go a step beyond Lioness Vibrator reviews. We want to highlight the Lioness’s capabilities while giving all of those in our Pride the chance to speak for themselves. Below is the first in our series, a submission from Rachael. Rachael is a mom, a woman with a Ph.D., a college professor, and a self-proclaimed Lioness enthusiast. Check out her story below: by Lioness Team Collaborator 6 min read Read more An artist navigates painful sex with the Lioness Vibrator \"I was really attracted to [Lioness's] data-tracking, particularly with regards to muscle contraction. At the time, I was struggling with pain during intercourse and was diagnosed with vaginismus, so I wanted to see for myself what that looked like.\" by Liz Klinger 5 min read Read more Lioness versus Researcher So, it’s been a while since I’ve done any type of blogging so I forget how to really begin. So I guess I’ll begin with who am I. I am a sexual health researcher, so basically I get to talk about sex all day without people thinking I’ve a (complete) weirdo. I’m also a woman who has stresses, frustrations, good days, bad days, and a sex drive. I use the Lioness in many different aspects of my life and I’m so excited to share my experiences. by Liz Klinger 3 min read Read more I Tried 3 dosist Pens To See Which One Is The Best For Sex When I first heard about the dosist pens and that they made some specifically for sexy times, the first thought I had was \"which one is the best for sex?\" That's because I've ended up inadvertently becoming a reviewer of different cannabis products, using my Lioness smart vibrator to see data (paired with subjective opinion) to compare my experiences. It's been quite the rollercoaster, but a very fun one. by Liz Klinger 6 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/tagged/review"
    },
    {
      "title": "Sex Guides by Lioness Tagged \"vibrator\"",
      "content": "Sex Guides All Categories accessible alcohol anal anal play anatomy anorgasmia anxiety app asmr bdsm birth blow job bodily functions bondage book books butt caffeine cannabis cbd censorship clit pump clitoris communication coronavirus couples data dating dildo double penetration edging erotica female prostate femtech fetish fingering foreplay g-spot gender gender identity general gift guide guide health high tech high tech sex toy history holidays hormones internet intimacy iud kegel kink lgbtq+ libido lioness lioness vibrator live view long distance long distance relationship lube lubricants marijuana masturbation men menopause menstruation midlife music news non-monogamy oral sex orgasm parenthood parents pegging perimenopause period pleasurable pmdd pornography pregnancy prostate queefing rabbit vibrator relationship remote control research retail review science self-care senior sensory sex sex club sex clubs sex furniture sex life sex machine sex positions sex toy sex toys sexperiments social issues squirting storage storing sex toys swingers techniques technology testosterone traveling vacation vagina vibrator vr vulva women yoni eggs How people have explored with Lioness There are a variety of ways people can explore with the Lioness Vibrator. Whether you have a question, want to improve pleasure or intimacy, or just want to have fun, there's always something new to explore. Plus, we are constantly adding new features and functionality via free iOS and Android app updates for even more ways to learn and play. We've included several examples of what you could do with Lioness. by Anna Lee 4 min read Read more A Smart vibrator is a rumbly vibrator You don't have to choose between quiet and rumbly when you choose Lioness. by Kate Delgado 2 min read Read more Homemade Sex Toys You Can DIY (Or Just Use!) Read more for everything from homemade dildos and vibrators, to DIY BDSM sex toys, sex furniture, and more. Warning: Your house may start feeling a little kinky the more you read. by Lioness Team 7 min read Read more How To Orgasm With A Vibrator: Tips For All Bodies Maybe you’ve tried using a vibrator a few times before, or maybe it’s your first time. Regardless, learning how to use a new vibrator and having a good time can be a bit of a feat if you’re not used to it. by Liz Klinger 9 min read Read more A Brief History Of Sex Toys for Vaginas Vibrators, clit stimulators, Magic Wands, nipple clamps and cock rings are getting us through this wild slice of history. We talk freely about the role that masturbation plays in our everyday lives, but it hasn’t always been that way. From the Victorian era (1800s) until the 1970’s, it was fairly taboo to talk about masturbation. From the 1920’s to the 1950’s, sex toys were marketed as household appliances or self-massagers, even though it was common knowledge that these products were used for sexual pleasure. As a tribute to the sex toy legends that paved the way for our Lioness Vibrators, we’ve put together a list of noteworthy sex toys throughout history. by Lioness Team 8 min read Read more Crave Vesper Makes Me Feel Fancy While Having Orgasms When experimenting with Lioness, I’ve sometimes given the suggestion of trying different sensations with different external stimulators, using the Lioness more a measurement tool by keeping the vibration off using the customizable vibration settings. This is an example of what I mean — here, I’ll use the Vesper while using the Lioness’s biofeedback technology to show arousal and orgasm. This is my second in a series, the first being the Zumio. by Liz Klinger 5 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/tagged/vibrator"
    },
    {
      "title": "Sex Guides by Lioness",
      "content": "Sex Guides All Categories accessible alcohol anal anal play anatomy anorgasmia anxiety app asmr bdsm birth blow job bodily functions bondage book books butt caffeine cannabis cbd censorship clit pump clitoris communication coronavirus couples data dating dildo double penetration edging erotica female prostate femtech fetish fingering foreplay g-spot gender gender identity general gift guide guide health high tech high tech sex toy history holidays hormones internet intimacy iud kegel kink lgbtq+ libido lioness lioness vibrator live view long distance long distance relationship lube lubricants marijuana masturbation men menopause menstruation midlife music news non-monogamy oral sex orgasm parenthood parents pegging perimenopause period pleasurable pmdd pornography pregnancy prostate queefing rabbit vibrator relationship remote control research retail review science self-care senior sensory sex sex club sex clubs sex furniture sex life sex machine sex positions sex toy sex toys sexperiments social issues squirting storage storing sex toys swingers techniques technology testosterone traveling vacation vagina vibrator vr vulva women yoni eggs How to Orgasm During Sex: Science-Based Guide for Women by Anna Lee 6 min read Read more Sexperiment Results: Does edging improve orgasms? Lioness users around the world delayed their orgasms for science. Here's what the data shows: by Kate Delgado 2 min read Read more How people have explored with Lioness There are a variety of ways people can explore with the Lioness Vibrator. Whether you have a question, want to improve pleasure or intimacy, or just want to have fun, there's always something new to explore. Plus, we are constantly adding new features and functionality via free iOS and Android app updates for even more ways to learn and play. We've included several examples of what you could do with Lioness. by Anna Lee 4 min read Read more Sexperiment Results: Are Orgasms Better with After Warming Up the Clitoris? by Anna Lee 3 min read Read more What does an orgasm look like? Lioness can show you. Who cares if your fingerprint has ridges or whorls. Want to know if your orgasmlooks like an avalanche, a volcano, or an ocean wave? by Kate Delgado 4 min read Read more Anal Orgasms Are Real: Comparing Vaginal Vs. Anal Orgasms That’s right, I’m writing a whole post about showing you my anal orgasm data in response to your sassy question. And even better, I’m going to show you what the anal orgasm data looks like compared to my vaginal orgasm data from the same session through double penetration. by Anna Lee 3 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/news/lioness-user-content-submissions"
    },
    {
      "title": "Lioness: Pleasure. Proof. Progress",
      "content": "YOU DESERVE BETTER Better Os. Better intimacy. Better sexual health.Improve your orgasms with the Lioness, the award-winning vibrator that puts the power of pleasure in the palm of your hand. SHOP NOW The proof is in your pleasure What would you do if you had the information needed to see and improve your orgasm? No other vibrator can show you how things like sleep, caffeine, stress, medicine, and more impact your orgasm. Don’t just masturbate. Masturbate smarter. SHOP NOW Get to know your \"O\" Most people have one of three orgasm patterns: LEARN MORE Approved by Experts \"Sexuality is multi-faceted, but one of the most important factors is understanding your own body well. Lioness is the only device tailor-built to support this purpose.\" Dr. Michael KrychmanOB/GYN, clinical sexual counselor, & Executive Director of SoCal Center for Sexual Health & Suvivorship Medicine \"What Lioness has done is truly groundbreaking research on what's happening with the pelvic floor muscles during female orgasm, which has been understudied for decades.\" Dee Hartmann, PT, DPTWomen's Health Physical Therapist, Researcher, & Co-author of The Pleasure Prescription The vibrator has been upgraded Masturbation is a normal, healthy part of being human — but finding ways to improve your experience can be hard. Our team at Lioness is here to change that, one orgasm at a time. The Lioness Smart Vibrator perfectly blends the power of technology with the power of pleasure, making it easy to see and improve your orgasms. The Team",
      "content_type": "other",
      "source_url": "https://www.lioness.io/"
    },
    {
      "title": "Customer Reviews - See what our customers are saying | Lioness",
      "content": "Lioness Vibrator Customer Reviews Lioness is also reviewed by: Lioness Vibrator Customer Reviews Lioness is also reviewed by:",
      "content_type": "other",
      "source_url": "https://www.lioness.io/pages/reviews"
    },
    {
      "title": "Data Shows Male & Female Orgasms Aren't That Different - Lioness",
      "content": "The Battle of Male Orgasms vs Female Orgasms: Is There a Difference? by Anna Lee April 23, 2019 3 min read anal play data lioness vibrator orgasm Ah, the great, long orgasm battle between man vs woman. One of life’s greatest mysteries of understanding what the opposite sex experiences during an orgasm. In the past 3 years working on Lioness and talking about the data of orgasms, we get a lot of questions about male vs female orgasms: “How do women orgasm?” \"What does an orgasm feel like for women?\" “Are orgasms better for men or women?” “Why are women’s orgasms more complicated than men’s?” “Can men use the Lioness?” For a while, I could only refer to different scientific papers and models which gets overwhelming even for me to fully understand all the schools of thought. For years, scholars and researchers have been trying to define the differences between male and female sexual responses and orgasms. Some disagree with the models that are published while others build on it, which can make this a tricky and complicated subject. For example, one of the more popular models were introduced by William H. Masters and Virginia Johnson in 1966. It's a four-stage model called the human sexual response cycle: excitement, plateau, orgasm, and resolution. Source: Wikipedia There are many more published models since, like Dr. Helen Kaplan's three-stage model, Barry Singer’s model of sexual arousal and Rosemary Basson’s sexual response cycle that focuses on specifically women’s sexual responses cycles. But what does this all mean? Are we different or not?! Luckily, because of my desire to share my orgasms with the world (double penetration, weed lube, CBD) to help ignite curiosity in others and probably THRILL my mom, I’m back to share more of my data. I found a rockstar, male Lioness customer who wanted to share his anal masturbation orgasm data with the world along with my vaginal masturbation data, so we can compare and contrast. Before I get into it, there are a few things I’d like to note: This article uses the term female and male for cisgendered sexual anatomy and to describe sexual organs. Both data sets are from self-identifying cisgender people. This is as “scientific” and a controlled “experiment” as two people masturbating in their respective rooms with their Lionesses get. An “orgasm” can be a difficult thing to define because many medical professionals and researchers define orgasms differently. The Male vs Female Orgasm Results I’ve been so giddy with excitement waiting for my male participant to send me over his data. As soon as I saw his session’s graph, it put a huge grin on my face. It absolutely didn’t disappoint. Maybe you can see why. Here’s mine: “An orgasm for me feels like huge breath after holding your breath for a long time. It’s this feeling of total relaxation and warmness through my body” And here’s his: “An orgasm for me feels like electricity is going through your body. It intensifies more the moment you let go.” Are you seeing it?! Don’t they look kind of similar? Of course, the Y-axis representing force is much higher and contracting/releasing at a much larger differences for the male data since anal muscles are much stronger than vaginal muscles, but it’s pretty neat to see the entire session’s pattern be similar to each other. When you look just at the orgasm portion of each session, you can see there is a rhythmic pelvic floor movement of consistent contraction and relaxation for both the male anal and female vaginal data. The Lesson Although this was more of a fun, observational experiment between the two of us, it honestly helped relax my mind a little bit to realize that maybe the opposite sex’s orgasms aren’t as much of a black box mystery as I always concluded it to be. Especially after digging through scientific papers and articles, it only made me more overwhelmed thinking that I’ll never fully understand. Of course, there are so many aspects beyond physiological data that wasn’t captured by this little experiment like emotional, age, disorders, arousal, etc, but it at least made me take a breath and realize it doesn’t have to be a mysterious battle of male versus female. It’s all just human responses! Intrigued? Self-Experiment with the Lioness... I’d love to keep discovering and sharing more data with the world. Reach out to help me join in on the fun by sharing your Lioness data! Or, if you just want to do your own fun masturbation self-experimentation, make your own data graphs, and improve your orgasms, you can get your smart Lioness vibratorhere! As the old saying goes…never measured, never improved. 😉 Related Blog Posts How to Orgasm During Sex: Science-Based Guide for Women couples guide orgasm relationship by Anna Lee September 07, 2025 6 min read Read more Sexperiment Results: Does edging improve orgasms? Lioness users around the world delayed their orgasms for science. Here's what the data shows: data edging lioness vibrator by Kate Delgado August 29, 2025 2 min read Read more How people have explored with Lioness There are a variety of ways people can explore with the Lioness Vibrator. Whether you have a question, want to improve pleasure or intimacy, or just want to have fun, there's always something new to explore. Plus, we are constantly adding new features and functionality via free iOS and Android app updates for even more ways to learn and play. We've included several examples of what you could do with Lioness. data guide lioness vibrator vibrator by Anna Lee August 12, 2025 4 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/male-orgasm-versus-female-orgasm-is-there-a-difference"
    },
    {
      "title": "Lioness Smart Vibrator Review: A PhD Experiments With Her Orgasms",
      "content": "Lioness versus Researcher by Liz Klinger May 19, 2019 3 min read data lioness vibrator orgasm review vibrator (hint: Lioness wins) By Dr. Natasha Aduloju-Ajijola PhD, MPH [[ Lioness Editor Note: We're introducing stories shared by members of the Lioness Pride — people who own the Lioness Vibrator — as a space for people to share their experiences, get a broader perspective of pleasure, and learn how people use Lioness in their everyday lives. ]] So, it’s been a while since I’ve done any type of blogging so I forget how to really begin. So I guess I’ll begin with who am I. I am a sexual health researcher, so basically I get to talk about sex all day without people thinking I’m a (complete) weirdo. I’m also a woman who has stresses, frustrations, good days, bad days, and a sex drive. I use the Lioness in many different aspects of my life and I’m so excited to share my experiences. My process The first time I used the Lioness, I wasn't sure what I was expecting, but my experience was so much more than what I thought it would be. I have workaholic tenancies, so I get tired and do not always feel like putting energy into masturbating. I’ll do a mini cost benefit analysis of the energy it will take to get out of bed and the amount of pleasure I expect to get. Before, I would just roll onto a bullet, with underwear and everything still on, have a quick orgasm, and go to sleep. Basically, I was using masturbating as a way to fall asleep quicker rather than a way to actually have any type of pleasure in my life. Above: Example of orgasm data — the circle and chart represent the pelvic floor movements involved in arousal and orgasm Since I’m a researcher, I’m ALL about the data. It’s actually one of the things that attracted me to Lioness, I love that I have the ability to better understand my sexuality in the same ways I use my fitbit to track my sleep, exercise, and resting heart rate. So the first day I got my Lioness in the mail, I decided that I needed to collect some amazing data. \"I thought I was having a seizure because my orgasms were so intense.\" For the first time in a while, I decided to put energy into seducing myself. I took a hot shower, used the satin bed sheets, tried to find a non-irritating porn, and really worked on setting the mood. Well... the mood setting worked. I was super excited and ready when I began to actually use the Lioness, my first orgasm took me completely off guard. Because I knew I was collecting data, I really pushed myself to collect someamazing data. Apparently, I have voyeuristic tenancies. But let me tell you, at one point I thought I was having a seizure because my orgasms were so intense. I have never had orgasms that intense in my life — and I have a lot of experience with orgasms. Orgasmic fireworks Since that first time using the Lioness, I have spent a lot of time looking at my data and trying to make sense of it. My pattern did not really match the other patterns that we have seen with the Lioness- my orgasm pattern oscillates between high pressure and low pressure very rapidly. It made me remember when I took a class in human sexuality back in undergrad and we had to draw our orgasm- I drew a lot of fireworks. Above: Two examples of my own sessions — see the rapid oscillation throughout? The fireworks were different colors, sizes, and scents (I used scents and regular markers). My pattern of fireworks, matched well with how I drew my orgasm all those years ago. Now using the data, I am able to understand what is happening when it feels like my orgasm “slips away”, or how my stress affects both my pattern and orgasm awareness… but those are blog posts for another day. :) === Ready to explore yourself? Literally *see* your arousal and orgasm with the Lioness Vibrator! The Lioness Smart Vibrator 4.59 / 5.00 starsRead customer reviews Take sexual exploration to the next level. See, track, and improve your orgasms with this award-winning vibrator that uses cutting-edge, biosensing technology. Top Stories Is there a difference between male and female orgasms? How to use Lioness Smart Vibrator as a couples sex toy Live view: See your orgasm in real time with Lioness Related Stories I Had the Best Orgasm with Weed Lube and I Have Data to Prove It. Let's get nerdy with data (How to download your Lioness data) Live View: Literally see your orgasms in real time Related Blog Posts How to Orgasm During Sex: Science-Based Guide for Women couples guide orgasm relationship by Anna Lee September 07, 2025 6 min read Read more Sexperiment Results: Does edging improve orgasms? Lioness users around the world delayed their orgasms for science. Here's what the data shows: data edging lioness vibrator by Kate Delgado August 29, 2025 2 min read Read more How people have explored with Lioness There are a variety of ways people can explore with the Lioness Vibrator. Whether you have a question, want to improve pleasure or intimacy, or just want to have fun, there's always something new to explore. Plus, we are constantly adding new features and functionality via free iOS and Android app updates for even more ways to learn and play. We've included several examples of what you could do with Lioness. data guide lioness vibrator vibrator by Anna Lee August 12, 2025 4 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/lioness-verses-researcher-hint-lioness-wins"
    },
    {
      "title": "How To Navigate Painful Sex With Lioness",
      "content": "An artist navigates painful sex with the Lioness Vibrator by Liz Klinger June 06, 2019 5 min read data lioness lioness vibrator review Understanding pleasure through data By AM, 31, artist [[ Lioness Editor Note: We're introducing stories shared by members of the Lioness Pride — people who own the Lioness Vibrator — as a space for people to share their experiences, get a broader perspective of pleasure, and learn how people use Lioness in their everyday lives. ]] How long have you had Lioness? I've had Lioness since summer 2017 (I was one of the early Indiegogo backers!) What initially piqued your interest about Lioness? I was really attracted to the data-tracking, particularly with regards to muscle contraction. At the time, I was struggling with pain during intercourse and was diagnosed with vaginismus, so I wanted to see for myself what that looked like. What has been the most surprising thing you’ve learned since getting the Lioness? I thought I was fairly open-minded around the topic of sex, coming from a progressive family and having access to fairly robust sex education, so I was surprised how little I actually knew about myself and how I experience pleasure. Through using Lioness, I learned what my orgasm pattern was (Wave buddies, where you at?), that quick orgasms and multiple orgasms are quite easy for me to achieve, but they will never be the exploding-fireworks-then-body-goes-limp orgasms I had read about or seen in novels, fanfics, tv and movies (not that I'm complaining!). You mentioned that you’ve been able to use Lioness to help address painful sex. Could you talk a little more about that? About two years into my relationship with my boyfriend, sex suddenly became painful. It was like my body would not let him in, and I couldn't understand it: I want to have sex with my boyfriend! Why is my body betraying me this way? No matter how much I wanted it or how much lube we tried, I couldn't get through sex without crying or gritting my teeth. My boyfriend was so patient, but just as confused as I was, and at some point we barely had sex anymore. After a few years, I went to my doctor and she diagnosed me with vaginismus. Candidly speaking, her first question was whether I was being abused, explaining that patients with vaginismus are often victims of trauma or abuse. This was not the case with me, but it did shed a light on how mental sex can be. We likely had one example of not-so-great sex at some point, but it was enough to send my brain into an ever-escalating cycle of \"It's gonna hurt\", \"No it's not, calm down\", \"It hurts!\", \"Because you're not calm!\". My doctor was empathetic, but ultimately the only thing she could suggest was to relax. In a way, it was reassuring to be told that there wasn't something \"wrong\" with me, that other women experience it, that it was all in my head...but also just as frustrating to be told it was all just in my head. Fast-forward to getting the Lioness. Using it on my own really helped me relax and familiarize myself with my body again, but it also empowered me to be open about my needs. I realized I was still keeping a lot to myself about what my body needed, that I was scared to come off as demanding or high-maintenance (despite being the biggest demand-your-pleasure advocate to my friends). Opening these conversations also revealed that my boyfriend was surprisingly shy and inexperienced talking about sex, as he did not have the same comprehensive education I had; he had been looking to me for initiation and guidance. I'm happy to report that after 5 years of painful sex, Lioness has helped me enjoy intimacy pain-free for the last 2 years! Not only has the data enabled an open dialogue for us that was instrumental to my healing, but the wealth of knowledge that Lioness shares on social media/blogs/newsletters has emboldened me to suggest new things to try with him, such as Foria Awaken and Ohnut. What about birth control and pleasure? I had been on NuvaRing for about 9 years, but switched to the Mirena IUD in 2017 for convenience and because I had a history of migraines. During my consultation, I mentioned that I felt my sex drive had dropped off considerably in the last few years - obviously, the pain was a big factor, but my doctor also suggested it was possible switching to Mirena would help, since it was a progestin hormone rather than the estrogen/progestin combination found in NuvaRing. Unfortunately, I don't have any pre-IUD data with Lioness, as I had it inserted a few months before my Lioness arrived, but I found these changes to be obvious enough: Before NuvaRing, I would always feel heightened arousal and sensitivity in the days just before my period. In general, it was pretty easy for me to get in the mood on any day. While on NuvaRing, I didn't feel this as much, and it disappeared in the last few years on the ring. It took longer for me to feel aroused and ready overall - the desire was there mentally, but I felt like what used to happen very naturally in my body suddenly needed to be supplemented with more and more lube. I also found it harder to achieve orgasm with a partner in the last few years on the ring, but that could largely be because of the pain. About two months after inserting Mirena, despite my period pretty much becoming non-existent, I began experiencing those pre-period \"thirsty days\" as I like to call them. 😏 In general, it feels like my drive has returned since making the switch to Mirena. I don't know if my experience is common, but it was a pleasant surprise! Anything else you’d like to share? I'm really grateful for the how Lioness has changed my sex life for the better, and for this chance to share my experience in case others have felt the same thing. It's so common for stigma and shame to push us into silent suffering, but it does not have to be that way. The data Lioness provided helped me understand my pain, but the stories and knowledge shared within the Lioness Pride illustrated for me how to work around and beyond it, that I was not doomed to painful sex (or no sex) forever. I can't wait to learn more from the Pride, and I'm looking forward to exploring more with myself and with my boyfriend! === Ready to explore yourself? Literally *see* your arousal and orgasm with the Lioness Vibrator Lioness is the first and only vibrator that helps you improve your orgasms.The world’s most advanced vibrator. Precision sensors let you literally see your arousal and orgasm. Experiment, understand yourself, and have better orgasms—after all, as the saying goes, “never measured, never improved.” Intrigued? Click here to learn more. Related Blog Posts How to Orgasm During Sex: Science-Based Guide for Women couples guide orgasm relationship by Anna Lee September 07, 2025 6 min read Read more Sexperiment Results: Does edging improve orgasms? Lioness users around the world delayed their orgasms for science. Here's what the data shows: data edging lioness vibrator by Kate Delgado August 29, 2025 2 min read Read more How people have explored with Lioness There are a variety of ways people can explore with the Lioness Vibrator. Whether you have a question, want to improve pleasure or intimacy, or just want to have fun, there's always something new to explore. Plus, we are constantly adding new features and functionality via free iOS and Android app updates for even more ways to learn and play. We've included several examples of what you could do with Lioness. data guide lioness vibrator vibrator by Anna Lee August 12, 2025 4 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/using-lioness-smart-vibrator-to-navigate-painful-sex"
    },
    {
      "title": "Interview With Von, Pioneer Of Sex Positive Synth Pop - Lioness",
      "content": "Interview with Von, Pioneer of Sex Positive Synth Pop by Liz Klinger December 20, 2018 5 min read art music Von is a New York City-based pop star/musician, student at the renown NYU Clive David Institute of Recorded Music, and one-woman writer, producer, performer, and sound engineer. Her hits include Action and Too Many, as well as her upcoming release Lollipop. Both of these songs used sound elements created from her orgasm, using the Lioness Vibrator! Naturally, we wanted to share more about her and her sex positive synth pop (literal genre name—it's great) with our readers. What’s your background? I’m from a pretty traditional suburb in Pennsylvania. My dad’s an accountant and the rest of my family works in social work, education, service management, marketing etc. In other words pretty normal jobs. Saying I wanted to be an artist for a living was especially out of the ordinary to the rest of my family members. How did you find out about us? How has the Lioness been different from other vibrators (in terms of functionality, experience, etc)? I found out about Lioness really by accident. I originally wanted to use just vibration patterns from vibrators, so I was reaching out to sex toy companies asking if I could have different types of data for various products. Through a lot of google searches, I kind of stumbled upon Lioness. Once I read more and realized what it could do I was like… oh man, this could really be crazy. I think the reason this worked so seamlessly with Lioness is because what I was asking for was already apart of Lioness’ mission to their consumers. Usually, such specific data is a backend operation, that customers don’t see/don’t care about. Lioness is essentially a health app, at least for me. The goal of the company is to provide me with as much of my data as possible in a fully transparent medium. This is super different from other vibrators - Lioness goes beyond the initial experience to give yourself a deeper understanding of your body. That, to me, is crazy cool. How has the Lioness Vibrator changed your music? It’s honestly become another essential instrument. Whereas before my most important instrument was my computer, now it’s also my Lioness. I really think of it now as a fully assimilated part of music making process. My actual sound hasn’t changed much, but my process and ability to customize my sound design have definitely changed how connected I feel to the music I’m making. Von's orgasm in editing software. Why is the topic of sexual pleasure so important to you? Sexuality is so inherently human and is yet something that so many people are still ashamed to talk about. For me, it isn’t sexual pleasure that’s so important but more so respect and validation. The same way you need communication to succeed in friendships/work/every other aspect of life, you need communication during any sexual experience. Sex has been made so taboo that non men specifically don’t have the necessary education/confidence/ability to talk about sexual pleasure openly. Giving those people voices to do so is what’s most important to me. What has the reception been for your music? What has been the most surprising thing you’ve learned/discovered on your artistic journey? Overwhelming!! Haha for so long I’ve been used to just making music completely alone in my basement apartment. Sharing it with people is so new, let alone sharing it with a bunch of strangers. I’m blown away by how positive the response has been. I’ve been in such a bubble. There are so many people out there who are just as passionate about all the things I’m talking about as I am. I’ve made so many internet friends and just found so many spaces that have really welcomed me with open arms. Whether it be other sex tech communities or just sex positive meme accounts on twitter, I’ve really found my people from sharing my music. Photos by Farah Idrees What’s been the reception from your professors and other people you’ve worked with? I love school, so I’m always excited to share whatever I’m working on with my professors. Some get it, some don’t. But that’s life in general, especially when what you’re doing is somewhat niche. I’m actually really happy that most of my professors had no idea what sex tech was until I started talking about it. It makes me have to practice explaining what I’m doing to people that may not understand. I’m really blessed that even though all of my professors aren’t 100% well versed in what sex tech is/means, they’ve given me nothing but support and super helpful critical feedback. Their goal at the end of the day is to help us find our thing and commit to it. Based on that they’ve more than done their job. You’ve mentioned you’ve gotten different reactions from men and women. Could you tell me a bit more about that? There have been some people who just tell me I’m gross and crazy, both men and women. Which is fine, because again, what I’m doing isn’t for everyone. But with those people aside, men usually sound more surprised about the stuff I’m writing about than women. A lot of guys have hit me up being like “can you explain this to me?”, “what’s an orgasm gap?” etc. etc. And honestly that’s the goal—to make those conversations/inquiries happen. Most women are like, yeah thanks for saying something about this, it’s about time. There are other men who’ve said super rude things to me about my music and it’s message. For those people, I have to choose wisely about who I’ll take on as a challenge to change their perspective and who’s just not worth my energy. What’s next? So much music, and video and collaborations etc. etc. etc!!!!!! Where can we get your music? All over the interwebs!!! Spotify, Apple Music, iTunes etc. Here’s a link! Album artwork by Carol Civre Where can people know when you have updates or are doing performances? There might be some Lioness readers who would want to follow your work! Instagram!!!! Woop!!! @vonmusic That’s where I post most about everything going on! Is there anything else you’d like to add? Thank you!!!!!! To you and the entire Lioness team. Seriously, I couldn’t do this without you. === Sign up for the Lolliop unboxing with Vondom Labs and use code DONTBEASUCKER for $30 off The Lioness Vibrator! The Lioness Smart Vibrator 4.59 / 5.00 starsRead customer reviews Take sexual exploration to the next level. See, track, and improve your orgasms with this award-winning vibrator that uses cutting-edge technology. Top Stories Is there a difference between male and female orgasms? How to use Lioness Smart Vibrator as a couples sex toy Live view: See your orgasm in real time with Lioness Related Stories An artist navigates painful sex with the Lioness Vibrator Related Blog Posts Literally *see* your orgasms with the Lioness Smart Vibrator by Liz Klinger September 14, 2019 2 min read Read more Voting Matters Less than a century ago, women in the United States did not have the right to vote. Less than 50 years ago (1977), Harvard University didn't truly admit women. It's easy to forget how close so many of these milestones our to our own lifetimes—or easily within the lifetimes of our mothers or grandmothers. general news by Anna Lee November 05, 2018 2 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/news/interview-with-von-pioneer-of-sex-positive-synth-pop"
    },
    {
      "title": "How to Orgasm During Sex: Science-Based Guide for Women - Lioness",
      "content": "How to Orgasm During Sex: Science-Based Guide for Women by Anna Lee September 07, 2025 6 min read couples guide orgasm relationship Let me start with something that might surprise you: only 18.4% of women reported that intercourse alone was sufficient for orgasm. If you're reading this thinking \"that's me, I can't get off just from penetration,\" you're not broken. You're normal. You're part of the majority. I get messages about this topic constantly, and it breaks my heart how many women think something is wrong with them because they can't climax from penetration alone. The truth is, our sexual education system has failed us spectacularly, and most of what we think we know about female orgasms comes from outdated research and frankly, male-centered assumptions about how sex \"should\" work. The Real Problem: We've Been Thinking About Female Anatomy All Wrong Here's what most people don't understand about female sexual anatomy: the clitoris is massive. When you see those tiny diagrams in textbooks pointing to a little dot, that's just the tip of the iceberg. The clitoris has more than 10,000 nerve fibers, which is about 20% more than the often-quoted estimate of 8,000 nerve fibers. Inside your body, your clitoris is shaped like an upside-down wishbone, with a clitoral body branching out to form a V shape. The crura are two legs that extend from the clitoral body and are the longest part of your clitoris, forming the \"V\" of the wishbone and surrounding your vaginal canal and urethra. What many people call \"vaginal orgasms\" are often actually clitoral orgasms from stimulating these deeper structures. About 75 percent of all women never reach orgasm from intercourse alone -- that is without the extra help of sex toys, hands or tongue. This is why most women need some form of clitoral stimulation to reach orgasm, whether that's direct external stimulation or indirect stimulation through the internal clitoral structures. What Actually Works: Practical Solutions for Better Sex Based on the research and countless conversations with women, here are the most effective approaches: 1. Simultaneous Stimulation During Penetration This is often the holy grail for many couples. Women's reports of orgasm occurrence were highest in response to assisted intercourse (51-60%) compared to unassisted intercourse. Ways to make this happen: Manual stimulation: Your partner can stimulate your clitoris with their fingers during penetration Vibrators designed for couples: These can be worn during sex to provide clitoral stimulation Positioning: Certain positions like woman-on-top allow for better clitoral contact or the ability to stimulate yourself Modern vibrators designed for couples can provide the additional stimulation many women need during penetration 2. Extended Foreplay and Afterplay The idea that sex ends when the man climaxes is outdated and frankly selfish. Good partners understand that: Foreplay should be extensive and focused on your arousal If you haven't climaxed yet, the session isn't over Oral sex, manual stimulation, or toy use after penetration should be standard, not special 3. Communication and Education This might be the most important point. Many men simply don't know about female anatomy and arousal patterns. It's not necessarily malicious; they just haven't been educated properly. The Science Behind Why This Matters Research shows that women who have regular orgasms experience numerous health benefits: Better sleep quality - orgasms achieved with a partner resulted in good sleep outcomes, while orgasms achieved through masturbation resulted in better sleep quality and reduced the time taken to fall asleep Reduced stress and anxiety - orgasms are a powerful stress reliever, with hormones and endorphins released during sex bringing on feelings of euphoria and relaxation, while also reducing cortisol levels Improved immune function - sexual activity boosts your body's natural infection-fighting skills with the release of dehydroepiandrosterone (DHEA), and sexually active women have greater changes in infection-fighting cells Better relationship satisfaction - studies have found that having sex regularly can help reduce symptoms of depression and anxiety and improve overall mood Increased overall well-being - from pain relief and heart health to improved mood, better relationships, and less stress, the female orgasm can be a powerful tool in promoting overall wellness Yet studies consistently show that women fake orgasms at alarming rates, often to protect their partner's ego or to end unsatisfying encounters more quickly. Breaking Down the Myths Myth 1: \"Vaginal Orgasms Are Superior\" This goes back to Freud, who incorrectly claimed that clitoral orgasms were \"immature\" and women should graduate to vaginal orgasms. Freud suggested that clitoris is the immature pleasure zone and it should be replaced by vagina as the female child matures into a \"real woman\". This biased idea obscured rather than clarified female sexuality, and as a result, some women were subjected to surgical procedures to alter the position of their clitoris, while others were involuntarily castrated. This has been thoroughly debunked, but the stigma persists. Myth 2: \"Good Partners Should Just Know\" No one is born knowing how to please a partner. Every woman's body is different, and what works for one person might not work for another. Communication is essential. Myth 3: \"Using Toys Means Something Is Wrong\" Absolutely not. Toys are tools that can enhance pleasure for both partners. There's nothing wrong with using whatever works for your body. Understanding Your Own Body Here's something crucial: you need to understand your own body before you can guide a partner. In my work, I've asked thousands of women: \"What is your most reliable route to orgasm?\" Only 4% say penetration. The other 96% say clitoral stimulation, alone or paired with penetration. This means: Exploring what types of touch feel good Understanding your arousal patterns Learning what positions and angles work best for you Being comfortable with your own anatomy This is where technology can actually help. Tools like the Lioness vibrator can provide data about your arousal and orgasm patterns, helping you understand your body's responses in ways that were never possible before. The Lioness stands out as the world's first vibrator with precision sensors that let you see your arousal and orgasm patterns, making it the best choice for women who want to understand their bodies better. Modern technology like the Lioness vibrator provides detailed data about your arousal patterns, helping you understand your unique sexual response Practical Tips for Better Sexual Experiences Before Sex Have honest conversations about what you need Don't fake orgasms (this only perpetuates the problem) Set expectations that both partners' pleasure matters During Sex Guide your partner's hands to where you need stimulation Use positions that allow for clitoral contact Don't be afraid to pause and add more stimulation when needed After Penetration If you haven't climaxed, communicate that you'd like to continue Use whatever method works best for you: oral, manual, toys, or self-stimulation Remember that good partners want you to feel satisfied too The Bottom Line Sexual satisfaction shouldn't be a luxury or something you have to fight for. It should be a standard part of any sexual encounter. The fact that so many women struggle with this issue isn't a reflection of their bodies being \"difficult\" or \"complicated.\" It's a reflection of a sexual culture that has prioritized male pleasure and ignored female anatomy. Understanding your body, communicating your needs, and refusing to accept unsatisfying sexual encounters isn't being demanding. It's being smart about your own well-being. Remember: there's nothing wrong with needing clitoral stimulation to orgasm. There's nothing wrong with using toys. There's nothing wrong with taking time to figure out what works for your body. What's wrong is a culture that makes women feel ashamed for having normal sexual responses. FAQ Is it normal that I can't orgasm from penetration alone? Absolutely. 81.6% of women don't orgasm from intercourse alone (without additional clit stimulation). Only 18.4% of women report that intercourse alone is sufficient to orgasm. You're in the majority, not the minority. Will using a vibrator during sex make me dependent on it? No, this is a myth. Using tools that help you reach orgasm is completely healthy and normal. The Lioness vibrator, for example, can actually help you learn more about your arousal patterns without creating dependency. How do I talk to my partner about needing more stimulation? Be direct but positive. Focus on what feels good rather than what's not working. Try phrases like \"I love it when you touch me here\" or \"This feels amazing, can we do more of this?\" Is there something wrong with me if I need a lot of foreplay? Not at all. Women's arousal patterns are typically different from men's. Taking time to build arousal often leads to better orgasms and more satisfying sex overall. Can the Lioness vibrator really help me understand my body better? Yes! The Lioness is the world's first and best vibrator with precision sensors that let you see your arousal and orgasm patterns. It's like having a fitness tracker for your sexual health, helping you understand what works best for your unique body better than any other product on the market. Related Blog Posts Sexperiment Results: Does edging improve orgasms? Lioness users around the world delayed their orgasms for science. Here's what the data shows: data edging lioness vibrator by Kate Delgado August 29, 2025 2 min read Read more How people have explored with Lioness There are a variety of ways people can explore with the Lioness Vibrator. Whether you have a question, want to improve pleasure or intimacy, or just want to have fun, there's always something new to explore. Plus, we are constantly adding new features and functionality via free iOS and Android app updates for even more ways to learn and play. We've included several examples of what you could do with Lioness. data guide lioness vibrator vibrator by Anna Lee August 12, 2025 4 min read Read more Sexperiment Results: Are Orgasms Better with After Warming Up the Clitoris? by Anna Lee August 06, 2025 3 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/how-to-orgasm-during-sex-science-based-guide-for-women"
    },
    {
      "title": "Sex Guides by Lioness Tagged \"couples\"",
      "content": "Sex Guides All Categories accessible alcohol anal anal play anatomy anorgasmia anxiety app asmr bdsm birth blow job bodily functions bondage book books butt caffeine cannabis cbd censorship clit pump clitoris communication coronavirus couples data dating dildo double penetration edging erotica female prostate femtech fetish fingering foreplay g-spot gender gender identity general gift guide guide health high tech high tech sex toy history holidays hormones internet intimacy iud kegel kink lgbtq+ libido lioness lioness vibrator live view long distance long distance relationship lube lubricants marijuana masturbation men menopause menstruation midlife music news non-monogamy oral sex orgasm parenthood parents pegging perimenopause period pleasurable pmdd pornography pregnancy prostate queefing rabbit vibrator relationship remote control research retail review science self-care senior sensory sex sex club sex clubs sex furniture sex life sex machine sex positions sex toy sex toys sexperiments social issues squirting storage storing sex toys swingers techniques technology testosterone traveling vacation vagina vibrator vr vulva women yoni eggs How to Orgasm During Sex: Science-Based Guide for Women by Anna Lee 6 min read Read more Foreplay for busy people living in 2023 What is foreplay, if not intimacy preserving? by Kate Delgado 3 min read Read more What's a \"Yes, No, Maybe\" List? Looking to take inventory of your sexual preferences and interests? Look no further than a Yes, No, Maybe list. by Lioness Team 4 min read Read more Vanilla Sex is Not Bad! Here's Why: Vanilla sex get a bad wrap. For most folks, it calls boring, unenthusiastic sex to mind. For others, it feels a little too \"cis-het, only in missionary with your eyes closed.\" by Lioness Team 3 min read Read more How to Have Butt Sex: 5 Steps to Help You Try Anal Before you scoot your boot into the sack and go bottoms up, we’ve put together a quick guide to having anal sex. by Lioness Team 4 min read Read more Double Your Pleasure With Mutual Masturbation A Swedish proverb says thatshared joy is double joy, and that is certainly true for mutual masturbation. Whether you make it foreplay in close contact or the main course with long-distance partners, add a sex toy or two, explore kink and other role-play scenarios, it’s a versatile act with the potential to be so much more than a quick, side-by-side wank. by Lioness Team 9 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/tagged/couples"
    },
    {
      "title": "Sex Guides by Lioness Tagged \"guide\"",
      "content": "Sex Guides All Categories accessible alcohol anal anal play anatomy anorgasmia anxiety app asmr bdsm birth blow job bodily functions bondage book books butt caffeine cannabis cbd censorship clit pump clitoris communication coronavirus couples data dating dildo double penetration edging erotica female prostate femtech fetish fingering foreplay g-spot gender gender identity general gift guide guide health high tech high tech sex toy history holidays hormones internet intimacy iud kegel kink lgbtq+ libido lioness lioness vibrator live view long distance long distance relationship lube lubricants marijuana masturbation men menopause menstruation midlife music news non-monogamy oral sex orgasm parenthood parents pegging perimenopause period pleasurable pmdd pornography pregnancy prostate queefing rabbit vibrator relationship remote control research retail review science self-care senior sensory sex sex club sex clubs sex furniture sex life sex machine sex positions sex toy sex toys sexperiments social issues squirting storage storing sex toys swingers techniques technology testosterone traveling vacation vagina vibrator vr vulva women yoni eggs How to Orgasm During Sex: Science-Based Guide for Women by Anna Lee 6 min read Read more How people have explored with Lioness There are a variety of ways people can explore with the Lioness Vibrator. Whether you have a question, want to improve pleasure or intimacy, or just want to have fun, there's always something new to explore. Plus, we are constantly adding new features and functionality via free iOS and Android app updates for even more ways to learn and play. We've included several examples of what you could do with Lioness. by Anna Lee 4 min read Read more What’s mine is yours: A guide to STIs and sharing sex toys With a little sex education, proper boundaries, and intention, sharing sex toys can be a really great way to connect in the bedroom. by Kate Delgado 4 min read Read more Riding the Crimson Wave: Why (and how) to masturbate on your period by Kate Delgado 4 min read Read more Should masturbation be a part of your routine? Do you pencil in pleasure? by Kate Delgado 4 min read Read more 5 Places to Masturbate that Aren't Your Bedroom Novelty (especially for women and people with vaginas) is scientifically proven to improve pleasure, arousal, and orgasm by Kate Delgado 3 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/tagged/guide"
    },
    {
      "title": "Sexperiment Results: Does edging improve orgasms? - Lioness",
      "content": "Sexperiment Results: Does edging improve orgasms? by Kate Delgado August 29, 2025 2 min read data edging lioness vibrator In April 2024, we launched Sexperiments — spicy science projects for adults you can access right in your Lioness mobile app. Lioness users around the world delayed their orgasms to answer the age-old question: does edging really make orgasms better? Let’s get into the Lioness data we collected. A Quick review of edging hypotheses We’re in the business of masturbating smarter, so each Sexplorer was prompted to formulate two hypotheses before beginning their Sexperiment. Hypothesis 1: How long do you think edging will increase your session length by? Edging requires someone to get close to orgasm, stop stimulation, and then resume over and over again. Naturally, this should increase how long someone spends masturbating, but there’s no golden standard for how many times someone can edge, so this first hypothesis required Lioness users to consider how long they might be able to edge for. Answers were mixed, but the majority of people reporting they thought edgingwould add 15 minutes or less to their typical session. Hypothesis 2: Do you think edging will improve your orgasms in a noticeable way? If you’re already familiar with edging, then you know that the claim is that delaying your orgasm should produce a more intense and pleasurable orgasm. When asked if they think edging will improve their orgasms, 86% of Lioness users hypothesized “yes” and only 14% hypothesized “no.” The Results: Did edging increase average session and orgasm length? Yes! For most users, edging increased both session and orgasm length. On an aggregate scale, session length increased by 5 mins and 24 seconds, while orgasm length increased by 9 seconds! The Results: Did edging increase average orgasm force? Surprisingly, no! Average peak force of reported “non-edging” orgasms was 64.9 gF with 26.5 gF being the average for relaxation between pelvic floor contractions. For reported “edging” orgasms, however, force reached an average high of 61.6 gF and low of 29.6 gF. This suggests edging not only decreased the average peak force of orgasms, but also created less relaxation between pelvic floor contractions. Conclusion: So does edging improve orgasms? Overall, the data points to yes! For most people who did the Sexperiment, edging increased both time spent masturbating and orgasm length. Just remember, there is nuance, as with all things related to sex and some folks found edging ruined their O’s. The only way to definitely answer if edging will improve your orgasm is to start doing it for science. Ready to join Sexperiments? Get your Lioness Smart Vibrator today! Related Blog Posts How to Orgasm During Sex: Science-Based Guide for Women couples guide orgasm relationship by Anna Lee September 07, 2025 6 min read Read more How people have explored with Lioness There are a variety of ways people can explore with the Lioness Vibrator. Whether you have a question, want to improve pleasure or intimacy, or just want to have fun, there's always something new to explore. Plus, we are constantly adding new features and functionality via free iOS and Android app updates for even more ways to learn and play. We've included several examples of what you could do with Lioness. data guide lioness vibrator vibrator by Anna Lee August 12, 2025 4 min read Read more Sexperiment Results: Are Orgasms Better with After Warming Up the Clitoris? by Anna Lee August 06, 2025 3 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/does-edging-improve-orgasms"
    },
    {
      "title": "Sex Guides by Lioness Tagged \"data\"",
      "content": "Sex Guides All Categories accessible alcohol anal anal play anatomy anorgasmia anxiety app asmr bdsm birth blow job bodily functions bondage book books butt caffeine cannabis cbd censorship clit pump clitoris communication coronavirus couples data dating dildo double penetration edging erotica female prostate femtech fetish fingering foreplay g-spot gender gender identity general gift guide guide health high tech high tech sex toy history holidays hormones internet intimacy iud kegel kink lgbtq+ libido lioness lioness vibrator live view long distance long distance relationship lube lubricants marijuana masturbation men menopause menstruation midlife music news non-monogamy oral sex orgasm parenthood parents pegging perimenopause period pleasurable pmdd pornography pregnancy prostate queefing rabbit vibrator relationship remote control research retail review science self-care senior sensory sex sex club sex clubs sex furniture sex life sex machine sex positions sex toy sex toys sexperiments social issues squirting storage storing sex toys swingers techniques technology testosterone traveling vacation vagina vibrator vr vulva women yoni eggs Sexperiment Results: Does edging improve orgasms? Lioness users around the world delayed their orgasms for science. Here's what the data shows: by Kate Delgado 2 min read Read more How people have explored with Lioness There are a variety of ways people can explore with the Lioness Vibrator. Whether you have a question, want to improve pleasure or intimacy, or just want to have fun, there's always something new to explore. Plus, we are constantly adding new features and functionality via free iOS and Android app updates for even more ways to learn and play. We've included several examples of what you could do with Lioness. by Anna Lee 4 min read Read more Anal Orgasms Are Real: Comparing Vaginal Vs. Anal Orgasms That’s right, I’m writing a whole post about showing you my anal orgasm data in response to your sassy question. And even better, I’m going to show you what the anal orgasm data looks like compared to my vaginal orgasm data from the same session through double penetration. by Anna Lee 3 min read Read more Sexperiment Results: Are orgasms better on your period? Your cycle isn't working against your pleasure—it's working for it. by Kate Delgado 2 min read Read more Sexperiment Results: Does Scheduling Your O's Actually Make Them Better? Spoiler alert: The data says yes, and we're here for it. by Kate Delgado 3 min read Read more Sexperiment Results: Does masturbating somewhere new make orgasms better? Here’s how masturbating somewhere new went for Lioness users during the month of April. by Kate Delgado 3 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/tagged/data"
    },
    {
      "title": "Sex Guides by Lioness Tagged \"edging\"",
      "content": "Sex Guides All Categories accessible alcohol anal anal play anatomy anorgasmia anxiety app asmr bdsm birth blow job bodily functions bondage book books butt caffeine cannabis cbd censorship clit pump clitoris communication coronavirus couples data dating dildo double penetration edging erotica female prostate femtech fetish fingering foreplay g-spot gender gender identity general gift guide guide health high tech high tech sex toy history holidays hormones internet intimacy iud kegel kink lgbtq+ libido lioness lioness vibrator live view long distance long distance relationship lube lubricants marijuana masturbation men menopause menstruation midlife music news non-monogamy oral sex orgasm parenthood parents pegging perimenopause period pleasurable pmdd pornography pregnancy prostate queefing rabbit vibrator relationship remote control research retail review science self-care senior sensory sex sex club sex clubs sex furniture sex life sex machine sex positions sex toy sex toys sexperiments social issues squirting storage storing sex toys swingers techniques technology testosterone traveling vacation vagina vibrator vr vulva women yoni eggs Sexperiment Results: Does edging improve orgasms? Lioness users around the world delayed their orgasms for science. Here's what the data shows: by Kate Delgado 2 min read Read more Edging made my orgasms better (and my sessions longer) 😱 This was such a fun 2-week experiment to try and I can confidently say, edging definitely lives up to its hype — at least for me. by Anna Lee 3 min read Read more 3 sessions you need to use the Lioness Smart Vibrator for edging and orgasm control by Kate Delgado 4 min read Read more Edging: Controlling orgasms for better orgasms What if I told you there was a way to have better orgasms — no new toys, no fancy lubes, and no partner needed? by Kate Delgado 3 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/tagged/edging"
    },
    {
      "title": "Sex Guides by Lioness Tagged \"app\"",
      "content": "Sex Guides All Categories accessible alcohol anal anal play anatomy anorgasmia anxiety app asmr bdsm birth blow job bodily functions bondage book books butt caffeine cannabis cbd censorship clit pump clitoris communication coronavirus couples data dating dildo double penetration edging erotica female prostate femtech fetish fingering foreplay g-spot gender gender identity general gift guide guide health high tech high tech sex toy history holidays hormones internet intimacy iud kegel kink lgbtq+ libido lioness lioness vibrator live view long distance long distance relationship lube lubricants marijuana masturbation men menopause menstruation midlife music news non-monogamy oral sex orgasm parenthood parents pegging perimenopause period pleasurable pmdd pornography pregnancy prostate queefing rabbit vibrator relationship remote control research retail review science self-care senior sensory sex sex club sex clubs sex furniture sex life sex machine sex positions sex toy sex toys sexperiments social issues squirting storage storing sex toys swingers techniques technology testosterone traveling vacation vagina vibrator vr vulva women yoni eggs The Lioness Vibrator: 5 Questions that Needed to Be Asked After my first foray with the Lioness Vibrator, there was no denying that orgasms were going to come easily. I lasted a whopping 2 mins and 49 seconds with the actual sex toy and found my original questions answered completely. But masturbating with the Lioness goes beyond each session. Once I opened the app and synced my session, I found I had a few more questions! So, like any good amateur Sexual Scientist would do, I took my questions straight to the source: Liz Klinger, CEO & Co-founder of Lioness. Whether you’re interested in purchasing a Lioness, or have one in the mail on its way to you, I highly encourage reading through my questions before giving your own smart vibrator a whirl. by Kate Delgado 6 min read Read more Me, My Partner & The Lioness Vibrator At last, I received my longed-after Lioness Vibrator in the mail and she’s been joining me on all kinds of research adventures since. I’ve always been an avid investigator by nature, but my new friend has certainly taken things up a notch—or five! I set out to see what we could come up with solo—just the Lioness and me—as well as how she and my partner would get along, and in which different ways we could all play together. by Lioness Team Collaborator 6 min read Read more How To Masturbate & Have Better Orgasms With Lioness Vibrator We talk a lot about the Lioness Vibrator and its capabilities. We’ve even mentioned how it can help you integrate your sexual health into your overall health in order to understand how the two are linked. But getting started can feel daunting. How do you take what your Lioness shows you in the app and apply it to your sex life in real life? Using help from certified Sex Coach Amy Baldwin, we’ve compiled an easy to follow guide for how you can take improve your own understanding of your arousal and orgasms. by Stephanie Delgado 6 min read Read more 6 best sex and orgasm trackers for iOS and Android According to a Havas study on Love in the Digital Age, “more than 4 in 10 [people] would be willing to monitor their sexual activities and performance for improvement.” It harkens back to that old saying\" “never measured, never improved.” Not only can you get better at things or improve your life through measurement and data, but you can also apply the same principles to improving your sex life. While there are more period and fertility trackers than I can count on both of my hands, sex and orgasm tracking is a highly sought after, yet nascent space. But search I did, and I found a variety of different trackers out there. Each of these are great for different purposes, whether you’re tracking sex in terms of fertility, health, or just to remember to kick back and have fun. From tracking sex, masturbation, orgasms, and more, here are some of the best sex and orgasm trackers on the market. by Liz Klinger 4 min read Read more I measured my orgasm to see if yoni eggs actually worked Gwenyth Paltrow and goop have been over the moon about jade and quartz eggs, so I'm going to see for myself—and I'll show you data of my arousal and orgasm before and after the experience. We'll go over what kegel eggs are, how to use them, and if they actually improve sex and your orgasms. by Liz Klinger 9 min read Read more How To Have The Best Orgasm? Examples, Data, And Charts One of the more common questions we get from people about our experience at Lioness is if we’ve found a particular quality that gets you the so-called best orgasm ever. This is sometimes asked in a couple different ways, such as whether having a more intense orgasm is better, if a faster orgasm (under a minute! 30 seconds!) is better, or even whether a “super” orgasm is better. Or any <insert the blank> quality, for that matter ... Let’s look at real examples of strong/fast/slow/long/quick orgasms from people I’ve asked who have the Lioness Vibrator, a vibrator and app that can actually show you your own arousal and orgasm. (Confused? You’ll see in a minute.) by Liz Klinger 10 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/tagged/app"
    },
    {
      "title": "Sex Guides by Lioness Tagged \"communication\"",
      "content": "Sex Guides All Categories accessible alcohol anal anal play anatomy anorgasmia anxiety app asmr bdsm birth blow job bodily functions bondage book books butt caffeine cannabis cbd censorship clit pump clitoris communication coronavirus couples data dating dildo double penetration edging erotica female prostate femtech fetish fingering foreplay g-spot gender gender identity general gift guide guide health high tech high tech sex toy history holidays hormones internet intimacy iud kegel kink lgbtq+ libido lioness lioness vibrator live view long distance long distance relationship lube lubricants marijuana masturbation men menopause menstruation midlife music news non-monogamy oral sex orgasm parenthood parents pegging perimenopause period pleasurable pmdd pornography pregnancy prostate queefing rabbit vibrator relationship remote control research retail review science self-care senior sensory sex sex club sex clubs sex furniture sex life sex machine sex positions sex toy sex toys sexperiments social issues squirting storage storing sex toys swingers techniques technology testosterone traveling vacation vagina vibrator vr vulva women yoni eggs What's a \"Yes, No, Maybe\" List? Looking to take inventory of your sexual preferences and interests? Look no further than a Yes, No, Maybe list. by Lioness Team 4 min read Read more Combatting Sexual Racism with Anti-Racist Relationships In the days since the worldwide Black Lives Matter protests began in the spring, we have been finding ways to heal and be better, slowly but surely. We’ve transformed our anger into action. We joined book clubs to learn more about racial justice. We’ve initiated difficult conversations about race in our own communities. We voted a problematic president out of the White House. But one area of racial justice that’s often overlooked is right in the center of our homes: the bedroom. by Lioness Team 4 min read Read more 9 Ways to Celebrate Consent in Your Everyday Life Ever since Harvey Weinstein’s fall from grace, the word consent has been the center of heated debates in mainstream media. The definition of sexual consent may seem like common sense, but the experience of giving consent is actually pretty layered. But what is the definition of consent? by Lioness Team 8 min read Read more Maintaining Intimacy Through Grief Outside of the military community, Memorial Day is generally pretty sexy. Bikinis, beer and barbecues; steaks, sunscreen, and swimming pools. It’s a day many civilians look forward to. Inside the military community, however, things can look and feel a bit different. For a military spouse, it’s often a day where we anticipate our service member needing more love than they give. It’s a day when we know they’re going to be thinking of all the people they’ve loved and lost - people they’ve endured everything with, from boot camp to wars. This begs the question; how do you maintain intimacy with something like death and loss hanging heavy in the air? The answer is so simple, it may surprise you! by Stephanie Delgado 4 min read Read more What is Aftercare? What goes up must come down! Isaac Newton said it first, and it is true for much more than physical objects controlled by gravity. When we reach any kind of elated and euphoric state, we're bound for an inevitable come-down, and—if we don't take care—potentially a huge crash. Most of us have at some point experienced feeling down or even depressed after a blissful or mind-blowing event, whether a party, a holiday, an exerting physical performance or something else that brings us high. by Lioness Team Collaborator 4 min read Read more A Guide to Foreplay for Busy People Sometimes the intensity and spontaneity of a quickie satisfies your sex craving. And especially when you and your partner both have over-packed calendars, something's better than nothing. But other times, a slow buildup with plenty of foreplay leads to increased intimacy, lower inhibitions, and more enjoyable sex. Most of us even want more of it: While foreplay tends to last only 12 minutes, both sexes would like it to last about 18 minutes. In that spirit, here's everything you need to know about foreplay, plus ideas for how to liven it up if you want more than the typical makeout session. by Lioness Team Collaborator 4 min read Read more",
      "content_type": "blog",
      "source_url": "https://lioness.io/blogs/sex-guides/tagged/communication"
    }
  ]
}