{
  "site": "https://shreycation.substack.com",
  "items": [
    {
      "title": "Shreycation | Shrey G | Substack",
      "content": "Shreycation Time to level up your travel and points game. Tips, tricks, and hacks from a budding travel professional. By Shrey G · Launched 2 years ago Subscribe By subscribing, I agree to Substack’s Terms of Use and acknowledge its Information Collection Notice and Privacy Policy No thanks",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com"
    },
    {
      "title": "Shreycation | Shrey G | Substack",
      "content": "Shreycation Time to level up your travel and points game. Tips, tricks, and hacks from a budding travel professional. By Shrey G · Launched 2 years ago Subscribe By subscribing, I agree to Substack’s Terms of Use and acknowledge its Information Collection Notice and Privacy Policy No thanks",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/"
    },
    {
      "title": "Shreycation | Shrey G | Substack",
      "content": "Subscribe Sign in Home Snacks Leaderboard snacks Snacks: It's not too late for Euro Summer flights Procrastinators rejoice: you can still fly to Europe for 15k miles each way MAY 30 • SHREY G Snacks: How to girl math your Lyfts Your Lyfts could be free...if you know what you're doing. APR 6, 2024 • SHREY G Snacks: Alaska joins Bilt Also: half off London flights, check if you're flying Boeing, and more MAR 20, 2024 • SHREY G Snacks: fly cross-country for just 5k points?! Air Canada 🤝 Bilt brings you the deal of the month with an unheard of 150% transfer bonus. Here's how to make the most of it. JAN 30, 2024 • SHREY G Snacks: earn free miles when shopping I flew NYC to SF for free and all I did was click a button JAN 22, 2024 • SHREY G © 2025 Shrey G Privacy ∙ Terms ∙ Collection notice Start writing Get the app Substack is the home for great culture",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/t/snacks"
    },
    {
      "title": "Shreycation | Shrey G | Substack",
      "content": "Subscribe Sign in Home Snacks Leaderboard Subscribe and invite friends to Shreycation Show your support by sharing Shreycation and earn rewards for your referrals. Subscribe Rewards and Progress TBD 3 REFERRALS TBD 8 REFERRALS TBD 25 REFERRALS Leaderboard REFERRER REFERRALS 1. Albert Dong 11 2. Jeff Dalli 6 3. Joanne 4 4. Shub Gaur 2 4. Aranya 2 5. Mina Iskarous 1 5. condy 1 5. Annie 1 5. Jason Kuperberg 1 5. Esteban Abeyta 1 © 2025 Shrey G Privacy ∙ Terms ∙ Collection notice Start writing Get the app Substack is the home for great culture",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/leaderboard"
    },
    {
      "title": "Snacks: It's not too late for Euro Summer flights",
      "content": "Discover more from Shreycation Time to level up your travel and points game. Tips, tricks, and hacks from a budding travel professional. Subscribe By subscribing, I agree to Substack's Terms of Use, and acknowledge its Information Collection Notice and Privacy Policy. Already have an account? Sign in Snacks: It's not too late for Euro Summer flights Procrastinators rejoice: you can still fly to Europe for 15k miles each way SHREY G MAY 30, 2025 1 Share Hi Shreycationers, It’s been a while! I hope you didn’t miss me too much, but rest assured, Shreycation is back and here to stay. In a later post I’ll share a bit more about what I’ve been up to (launching the world’s first hybrid human + AI travel agency, Anecdote Travel!), but for now, there’s something more pressing: helping you get flights for your Europe summer plans. Nothing quite says summer like hopping across the Atlantic to sip an Aperol spritz, but if you’re a procrastinator like me, those flights are getting pricey. I know I can just buy some Aperol from my local Safeway, but it just tastes better in Europe ya feel? Here’s the price map for roundtrips between San Francisco and various spots in Europe. Big yikes: Really, there’s nothing south of $1000. Fortunately, you read Shreycation and we’ve identified the best opportunities for you to use your points. Here’s how you can get your bank to pick up the tab for your sunny spree on the Spanish coast. Air France/KLM Flying Blue You may remember my love for the Air France and KLM’s joint program, Flying Blue. Every month, Flying Blue chooses a set of cities to enjoy a promotional discount of 25% off — if you fly from those cities to basically anywhere in Europe, you’ll be able to enjoy the promo rate, if they have availability. Economy flights between the USA and Europe cost 25k Flying Blue points one-way usually, so with the 25% discount, you’re looking at 18.75k points instead. And as a cherry on top, if you’ve got a Chase card, Chase Ultimate Rewards currently has a 25% transfer bonus to Flying Blue. That means you just need to transfer 15k Chase points to Flying Blue — that’ll get boosted to 18.75k, and you’re looking at a free flight to Europe! The current promo cities are also quite convenient for my coastal readers here: San Francisco, Atlanta, Washington, Miami, Boston, and even my hometown of Phoenix are all getting repped this time! Even some of my readers over in Asia are getting some love, with discount fares from Hong Kong and Singapore. I’ve rarely seen such a convenient set of origin cities for Flying Blue promo award, so take advantage now. (Full list of promo cities here.) Generally, I saw a decent amount of availability left for July and August flights. Here’s a sample one I found for SF to Madrid on July 5: Flying Blue does charge you for fuel surcharges, so you’ll still owe some money, but it’s still a great deal. Let’s do some quick maths: this flight costs $610 on Google Flights, so after the $120 in surcharges, we’re using 18750 Flying Blue miles to pay for the remaining $490. If you’re transferring from Chase, you’re really only burning 15000 Chase points, so that’s $490/15000 = 3.2¢/point, more than double what your points are worth in the Chase portal! If you like a little more luxury, business class tickets are 45k points as long as you fly from Montreal — this might be a viable move for my NYC friends here (just grab a cheap NYC > Montreal flight, and fly business across the pond). A few quick tips for this Flying Blue promotion: The promotion is almost over — May 31 is the last day to book. However, you can book for any dates up till Oct 31, so there’s no need to fly soon. New promo rates will go live in June, but the origin cities might not be this convenient. If you need to change or cancel, it costs 70 EUR. Even if you’re not sure about your trip, given how good the savings are, it might still be worth getting a ticket. Even if you don’t live in one of the origin cities, you can just buy a cheap flight to one of those cities, and then fly from there. Not all dates will have the promo rates still available. We’re in the last 2 days of this promotion, so many June dates are gone by now, but just use their point calendar at the top of the search screen to locate the 18750 mile fares. It bugs out sometimes when you search roundtrips, so I’d suggest searching one-ways instead. Thanks for reading Shreycation! We’re so excited to be back up and running. Subscribe for more, and share with a friend. Share Virgin Atlantic Another one of my favorite hacks for getting to Europe for cheap is using Virgin Atlantic. For many summer dates, you can fly from NYC to London for just 12k Virgin Atlantic miles. And even better, Chase is also running a 25% transfer bonus for Virgin Atlantic too — you can be in London for just 9600 Chase points. Note that Virgin Atlantic does also charge fuel surcharges, but like with Flying Blue, it’s still a great deal. This flight would usually cost $358 on Google Flights, so after deducting the $76 surcharge and factoring in the Chase transfer bonus, you’re getting just shy of 3¢/point! And if you want to mourn the end of summer with some off-season travel to London, it’s just 6000 Virgin miles for that same flight in September (or just 4800 Chase points)! This is so insanely cheap that I might just buy one of these on impulse. A few quick caveats: Here I showed one-ways to London, but the flights from London back to the US can sometimes be surprisingly expensive if you buy them as one-ways rather than as part of a roundtrip ticket. If you fly back from somewhere else in Europe, this isn’t much of a problem. Unlike with Flying Blue, these cheaper rates exist mostly just for flights to/from London. If you’re on the west coast, expect to pay a little more (e.g. 15k points). Save Money, Travel Well Even though we’re officially in summer now, doesn’t mean you can’t get some cheap tickets to Europe! Flying Blue and Virgin Atlantic consistently offer some great fares to Europe, and they aren’t slouching one bit for summertime. Chase holders get some extra sprinkles on top with that transfer bonus. And if you’re looking for hotels for Europe, it’s still not too late for that either. At Anecdote, we’ve been handling dozens of summer trips — we can help you find a great hotel and add some awesome perks (free breakfast, room upgrades) to boot. Find your hotels, hassle-free The world of points has changed a lot in the last year, so let me know what you want me to talk about next! POLL What should I write about? Which cards are still worth in 2025 50% Is airline status really worth it? 50% My travel must haves and essentials 0% 6 VOTES · POLL CLOSED And if you haven’t yet, subscribe for more travel and points goodness. Subscribe 1 Share",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/p/snacks-its-not-too-late-for-euro"
    },
    {
      "title": "Snacks: How to girl math your Lyfts - by Shrey G",
      "content": "Discover more from Shreycation Time to level up your travel and points game. Tips, tricks, and hacks from a budding travel professional. Subscribe By subscribing, I agree to Substack's Terms of Use, and acknowledge its Information Collection Notice and Privacy Policy. Already have an account? Sign in Snacks: How to girl math your Lyfts Your Lyfts could be free...if you know what you're doing. SHREY G APR 06, 2024 2 Share It’s Saturday and a lot of you are about to end your night by taking a $50 Lyft back home. Not a fun expense, but saving 20% on it would make it feel a bit better. This isn’t a limited time discount — turns out you can get at least 20% off any time on your Lyfts. It just requires a bit of girl math. If you’re about to ride one of these in about 6-7 hours from now, listen up! Credit: Solo Traveller The Chase Sapphire Reserve earns a whopping 10x points on Lyft rides. Last year I flew a $10000 business class itinerary in United Polaris business class by transferring 99k Chase points to United MileagePlus, garnering a value of 10¢/point. I definitely had some of my Lyfts contribute to those 99k points, and since I earned 10x points and redeemed those points for 10¢ a point, I effectively got $1 back for every $1 I spent on a Lyft. In other words, my Lyfts were free. Now a 10¢/point redemption isn’t super common and mostly exists when flying premium cabins, but even if you just redeem on economy flights, you can still get a pretty sizable discount on your Lyfts. At the very least, you can redeem Chase points in the Chase portal directly for 1.5¢/point. But if you transfer those points into airlines, you can easily and routinely get at least 2¢/point. That means you’re effectively earning 20¢ per dollar you spend on Lyft — 20% off! So next time it’s late at night and you’re Lyfting back home, know that if you girl math it, you’re at least getting it at a discount. (Unfortunately for my Uber loyalists, this arbitrage is a Lyft only thing. The Capital One Savor cards will give you 10% off Ubers, but 10% isn’t the same as 10x points.) If you’re subscribed yet, this is your sign. Saving on Lyfts is just the tip of the iceberg. Follow for points tips, tricks, frameworks, and breakdowns that you can actually use. Subscribe 2 Share",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/p/snacks-lyft-girl-math"
    },
    {
      "title": "Robinhood's Latest Quest - by Shrey G - Shreycation",
      "content": "Discover more from Shreycation Time to level up your travel and points game. Tips, tricks, and hacks from a budding travel professional. Subscribe By subscribing, I agree to Substack's Terms of Use, and acknowledge its Information Collection Notice and Privacy Policy. Already have an account? Sign in Robinhood's Latest Quest Is the new Gold credit card really a bullseye? SHREY G MAR 28, 2024 2 Share Hi Shreycationers, This week I was gonna talk about how to hack basic economy, but then Robinhood upended those plans when they dropped one of their biggest announcements in years: a 3% cash back credit card. Credit: Robinhood I mean she is truly a stunning card. But looks aren’t everything. Let’s dive in and see what this card is made of. (It’s made of 17 grams of stainless steel.) (Disclaimer: This post is not financial advice and you should do your own research to ensure the cards mentioned in this article are right for you. Applying will likely affect your credit score.) What’s great First things first, Robinhood’s done a great job stealing headlines with this card, and it’s not just all show. This is indeed a wonderfully designed card. A simple 3% cash back on everything Everyone’s talking about the flagship feature, the 3% cash back on everything. And with good reason: 3% is the highest base cash back rate across any card I’ve seen. There’s not much else to say here — it’s truly a great cash back rate with no hoops to jump through. There’s something refreshing about the simplicity here, and it’s especially great for beginners. But there’s other features that didn’t get as much attention and are also worth highlighting. No foreign transaction fees No foreign transaction fees means you can truly use this card to earn 3% on everything, including that shopping spree in Milan. Waiving foreign transaction fees used to limited to high annual fee cards, but recently low/no annual fee cards have been introducing it too, including the Apple Card and the Capital One Quicksilver. The Robinhood Gold card is by far the most versatile and valuable of these though. For those who don’t like to carry many cards, you can now ditch whatever low annual fee, no foreign transaction fee card you might have and get 3% on your abroad expenses instead. Spend using Virtual Cards This is actually the perk I’m most excited for with this card, because as far as I know, no other card on the market offers native virtual cards. Virtual cards let you hide your true credit card number when spending online, and allow you to set an expiry date and spending limit. The killer use case here is managing subscriptions: if you just want 1 month of Hulu to binge Shogun, you can load a virtual card with $8 and have it expire in a month. If you forget to cancel your subscription, it won’t matter; your payment method will be invalid by the month’s end anyway. Virtual card services like Privacy have existed for a while, but as third party services they’re not as convenient, and their free offerings aren’t as robust as what Robinhood seems to be providing here. Surprising amount of protections The Robinhood Gold card is part of the Visa Signature family, which comes with various optional benefits that credit card providers can activate. I’m happy to say Robinhood really went for extra credit here; this card is loaded with benefits, including: Purchase security: If you buy something nice and it gets lost or stolen in 90 days, you can get up to $1k back. Extended warranties: You can extend the warranty of new purchases by up to a year. Return protection: If you aren’t satisfied with a recent purchase and the store won’t take it back, you can get reimbursed up to $250. Trip cancellation protection: If you get injured before or during a trip, you can get up to $2k to cover nonrefundable arrangements. Auto rental collision damage waiver: You can skip the insurance at the rental car office when you use you card to rent. Many other low annual fee cards have some subset of these perks, but Robinhood is giving you basically everything. If you’ve got premium cards like an Amex platinum, you likely already have access to many of these perks (and with better limits), but this is still spectacular for what is effectively a starter card. The only notable perk that’s missing here is cell phone protection (get reimbursed if your phone is lost/stolen). 5% cash back when booking travel …but that travel has to be booked through Robinhood’s forthcoming travel portal. Now if you’ve used these travel portals through Chase or Amex or other cards, you know these portals aren’t that fun or convenient to use. Also, sometimes these portals don’t have the flights and hotels you’re interested in. Robinhood’s portal isn’t live so it’s hard to make judgements quite yet, but something tells me it won’t be groundbreaking here. 5% cash back has been emerging as a popular number for spend in travel portals, so this number isn’t as groundbreaking as the 3% cash back. You’ll earn the same with a Chase Freedom or a Capital One Quicksilver. But still, 5% is 5%, and it’s good to see Robinhood meeting the industry standard here. What’s not so great You need Robinhood Gold…and you need to maintain it The card’s $0 annual fee branding is a little bit misleading. In order to get the card, you’ll need to be a Robinhood Gold subscriber. But you also need to maintain Robinhood Gold to keep the card. This will be one of the first times I’ve seen a card’s good standing status tied to some external monthly subscription, and I’m not totally sure how this will work. If you decide not to pause your Robinhood Gold subscription for a month or two, do they close your credit card? Who knows. Fortunately, Robinhood Gold is only $5/month, and if you already invest with Robinhood, it’s a bit of a no brainer: you’ll get a free $1k in margin, lower margin interest rates, 5% on uninvested cash, and more. This card earns cash back, not points In the world of cash back cards, Robinhood’s 3% universal cash back might as well make it the new king. But cash back cards are the little league since they aren’t nearly as flexible or value as cards earning points. That’s because the value of cash back is fixed but the value of points is variable. 1¢ of cash back is 1¢ of cash back and will always be just 1¢ of cash back. But depending on your skill and luck, 1 point could be redeemed for anything from 1¢ to 10¢. That means a card that earns a standard 1x points on everything could be the equivalent of earning 1% to 10% cash back depending on how you use those points. Shreycation is all about helping you learn how to use your points well. With some basic knowledge, it’s pretty easy to achieve a rate of at least 2¢/point on virtually all of your award travel redemptions. That means a card like the Chase Freedom Unlimited that earns 1.5x points on everything nets me at least 3¢ per dollar I spend. On the other hand, the Robinhood Gold card also earns me 3¢ per dollar, but that’s a hard cap — it’ll only earn me 3¢ per dollar. Two ways you can spend $100. Obviously taking the cash back option for Chase isn’t the move, but transferring those points into say, United, could get you more value than the Robinhood card gives you. Especially if you use the Chase Freedom Unlimited on dining or drugstores. No sign up bonus or intro 0% APR The Robinhood Gold account comes with no sign up bonuses or introductory 0% APR rates whatsoever. For other cards in this category, there’s usually a ~$200 sign up bonus, and at least 1 year of 0% APR. If you intend on actively using this card for many years, the lack of a bonus might not be a huge issue today, but do note that it’ll take almost $7k in spending to match the free sign up bonus of its peers. The bigger issue is the lack of a 0% APR intro period. Right now, if you rack up a $10k balance on a card with 12 months of 0% APR, you can instead invest all that money in a high yield savings account and earn 5% over the course of the year. That’s basically the equivalent of a 5% cash back on everything. You’re forgoing that option if you choose to spend more on a Robinhood Gold card. A word of caution The card has some pretty awesome perks and a killer cash back earning structure today, but these aren’t necessarily guaranteed in the future, especially for younger companies like Robinhood. We’ve seen this in the past with cards like the Uber Visa Card, which used to give 4% on dining, 3% on travel, and 2% on Ubers — pretty awesome for a no annual fee card. But over time, the card kept getting nerfed and eventually became less and less compelling until it was finally shuttered. That’s not to say this will necessarily happen to the Robinhood card, but it’s good to know that this may not last in perpetuity. If you’re enjoying our breakdown of the Robinhood Gold card, subscribe for more! I’ll be writing about my favorite underrated cards and hacks to save you money. Subscribe Who should actually get this card? Beginners and people who don’t wanna deal with points. By itself, this card ticks a lot of boxes: great cash back on everything, solid protections, no transaction fees. This makes it an excellent card for beginners. I’ve waxed poetic about the value of points above, but if care more about simplicity, a card that gives 3% cash back without having to think about it is a pretty solid middle ground. And if you don’t travel much in the first place, you won’t be able to extract much of the value of your points anyway — cash back could be the better option. The Robinhood Gold card also effectively renders many other cash back cards obsolete, meaning you can double down on simplicity and get by with fewer cards. Most cash back fans can now get by with just two cards: (1) the Robinhood Gold, and (2) some card that earns 5% on seasonal categories (e.g. Chase Freedom Flex, Discover It). People who don’t have a great catch all card yet A key element of any good personal card portfolio is a “catch all” card that earns > 1% cash back or 1x points on non-category spend. In other words, it’s cool if you have swanky cards that earn 3% on travel and dining (“category spend”), but if you also drop $3000 a year on Rumble Boxing or have a crippling shopping addiction, it would be nice to earn boosted cash back here too. Catch all cards usually don’t have highly boosted cash back on special categories, but they do have slightly boosted cash back on everything. Up till now, 2% was about the best you could do for a catch all cash back card (RIP Citi Double Cash), but now Robinhood has blown this out of the water with its 3% and is the obvious choice. There’s one big caveat: if you have one of the premium travel cards — a Chase Sapphire, Amex Gold or Platinum, or a Capital One Venture — it might make sense to choose a card in those ecosystems as your catch all card. That’s a topic for another Shreycation issue, but generally you’ll get more value (and better purchase protections) on those cards than the Robinhood Gold. People who hate taxes but like math Death and taxes may be the only two things guaranteed in life, but the Robinhood card can help you reduce your annual subscription to Uncle Sam. The IRS lets you pay your outstanding taxes using a credit card. They’ll charge you 1.8% for this privilege, but if you’re using a card that gives you 3% cash back…you see where I’m going here. Courtesy of Robinhood, you can now enjoy a 1.2% discount on income taxes you pay directly. If most of your income comes from W-2 earnings, your employer is already withholding most of your income taxes for you and you’re likely not paying much on tax day, meaning this hack probably won’t be as useful. But if you have lots of 1099 earnings (e.g. from freelancing or side gigs), have high capital gains, or own a business and pay quarterly taxes, you’re usually paying a large chunk of your tax liability directly. By using the Robinhood Gold card to pay, you could keep hundreds of extra dollars in your pocket. We can go one step further for a really cheeky version of this hack. Since you’re paying taxes with a credit card, you have at least a whole month to pay down the balance while avoiding an interest charge. So maybe instead of paying down the card immediately, stick that tax money in a 5% APY high yield savings account for a month, and then pay your card. 5% APY earned for one month translates to a ~0.4% ROI, boosting your effective tax discount to 1.6%. You can also do this hack with the Paypal Mastercard (which gives you 3% cash back on Paypal transactions), but the Robinhood Gold card is a way more versatile card to have in your wallet. If you’ve decided the Robinhood Gold is the way to go for you, you can use the link below to add yourself to the waitlist. We’ve also got some alternative cards below that are worth your consideration! Sign up for the Robinhood Gold Waitlist Other cards that might be worth instead Chase Freedom Unlimited Credit: Fortune I’ve mentioned this card a few times in this article, but the Chase Freedom Unlimited is a very compelling alternative to the Robinhood Gold if you’ve already got a Chase Sapphire Preferred or Reserve. 1.5% cash back on everything…BUT if you have a Chase Sapphire card, you can opt to receive 1.5x points instead. And as we discussed above, 1.5 pts is easily worth at least 3¢. Also, 5x on travel booked through Chase Travel, 3x on dining, 3x on drugstores Many of the same protections as the Robinhood card, minus return protection. Sign up bonus of 20000 points and 15 months of 0% APR. No annual fee. Apply for a Chase Freedom Unlimited Wells Fargo Autograph Credit: Fortune Wells Fargo has really been stepping up its game lately and has started building their own points ecosystem with their own transfer partners. I’ll write more about it later, but their starter card is the Wells Fargo Autograph and its quite compelling. 3x points on many categories: dining, gas, travel, transit, streaming, and phone services. For some of you, this might be the majority of your spend (groceries and shopping are notably missing though). Sign up bonus of 20000 points and 12 months of 0% APR. Doesn’t have as many protections as the Robinhood Gold, but does offer cell phone protection. No annual fee. Apply for a Wells Fargo Autograph Thanks for reading! At the end of the day, Robinhood is selling simplicity, but credit cards don’t exist in a vacuum — they exist in your wallet with your other cards. I hope this article helped breakdown the Robinhood Gold card, and gives you a good sense of whether its right for you. As always, feel free to add questions in the comments, and share with a friend. Share Bon Voyage, Shrey 2 Share",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/p/robinhood-gold-card"
    },
    {
      "title": "How to get 10x the value from your points - by Shrey G",
      "content": "Discover more from Shreycation Time to level up your travel and points game. Tips, tricks, and hacks from a budding travel professional. Subscribe By subscribing, I agree to Substack's Terms of Use, and acknowledge its Information Collection Notice and Privacy Policy. Already have an account? Sign in How to get 10x the value from your points SHREY G JAN 11, 2024 14 2 Share Hi! I'm Shrey, and I'm a software engineer turned travel advisor. Back in March 2020, the travel bug bit me hard at probably the worst possible time. While the rest of the world was in quarantine picking up new hobbies, baking sourdough, and doing TikTok dances, I spent all my free time reading about the one thing I couldn’t do at the time: travel. Over the past two years, I've traveled hundreds of thousands of miles and redeemed tens of thousands of dollars in free travel. There’s a pervasive myth that traveling the world on points requires seven-figure spending or constantly hopping coast to coast for some big consulting firm. That hasn’t been my experience: I rarely traveled for work as an engineer and I’d like to think I spend frugally, yet I’ve learned to make these credit card and frequent flyer programs work for me. There’s no shortage of travel hacking content online, but points are a chaotic, complex web of unintuitive axioms and odd stipulations. I’ve always found that you can’t actually get anywhere without reading dozens of articles, and even then, it feels like you’re trying to clear a forest with a butter knife. In this Substack, my goal is to cut through the noise and clear the path for you. You’ll learn hacks that you can apply today, and hopefully over time, you’ll also develop an intuition for hacking on your own too. Today we’re tackling transfer partners, one of the most important and high impact topics that will show you the path to doing tons of free flights. I imagine people are at very different levels of familiarity with transfer partners, so if you’re new, keep reading, and if you’re a seasoned veteran, feel free to scroll down a bit unless you want a refresher! For beginners: Why do Transfer Partners matter? If you’ve seen people zipping around on free business class flights, chances are they’re not just secretly point millionaires. Instead, they’re stretching their credit card points by transferring them into specific airline frequent flyer programs. The major credit card programs for travel are Amex, Chase, Citi, Capital One, and Bilt — I’ll call these the Big 5. Most travelers know that the Big 5 programs each have a travel portal where you can easily redeem your points on flights. The catch is this usually involves spending your points at a fixed rate of 1-1.5¢/point. That means if you want a $1000 flight, you’re could be burning as much as 100k points — that’s more than most credit card sign up bonuses, just for one flight! What savvy travelers know is the Big 5 also allow you to transfer your points to specific frequent flyer partners, and this is the key to unlocking their true value. This is because unlike the Big 5 travel portals, most frequent flyer programs don’t set a fixed exchange rate. This means your points could be worth way more when you transfer! You can routinely find redemptions of 2-3¢/point, and if you’re really skilled or lucky, I’ve seen killer redemptions as high as 12¢/point! That same $1000 flight could cost you as little as 8k points — you might earn that in just a single month of smart spending. My free birthday trip last year, sponsored by my points! Also got to enjoy United's Polaris lounges which come with a free table service restaurant. I could probably write a PhD thesis on transfer partners, but for now I’ll try and give you my best 10 minutes on the topic. Rules of the Game Getting high redemptions doesn’t come for free, and it does involve a bit of a learning curve. First, a few ground rules for working with points: Transfers are one way. Once you transfer points from a credit card program to a frequent flyer program, you can’t go back. Only transfer if (a) you have a redemption in mind and are about to book or (b) there’s a great transfer bonus (we’ll talk about this in future issues). You can’t just transfer to any program. Each of the big 5 credit card programs partners with specific frequent flyer programs. This is why it’s best to own cards across various programs. You usually can’t transfer points across frequent flyer programs. For example, a mile in United MileagePlus usually can’t be transferred to Air Canada Aeroplan. (There are a few limited exceptions, but I’ll cover those in future issues.) Transfers are usually 1:1 but not always. For example, you can convert 1 Chase point into 1 United mile. While the majority of transfer partners for the Big 5 are 1:1, some have slightly unequal ratios like 1:2 or 2:1.5 for some of the less commonly used partners. A motivating example: Let’s go to London in the spring! Now for some examples! Let’s say you want to take advantage of the shoulder season for London in April — it’s starting to warm up but you’re not paying peak season prices. If you have a Chase Sapphire or Bilt card, you can transfer your credit card points to United MileagePlus and book a United Polaris business class flight departing March 30th from EWR to LHR for 80k miles. Found on the United Airlines award search tool here; just select “Pay with Miles”. The actual flight would cost $1988 if we bought outright in cash according to Google Flights: That means we’re redeeming our points at a rate of roughly 2.48¢/point! Compare this the quote of 132487 points we get from the Chase portal: Since I have the Chase Sapphire Reserve, my Chase points redeem at a fixed rate of 1.5¢/point in their portal (a signature benefit of that card), but just by transferring into United instead, I squeeze out 65% more value from my points! If you want to go far, go together: The magic of airline alliances As I mentioned earlier, each of the Big 5 programs has a designated list of transfer partners. Here’s the list for Bilt for example: It’s perfectly normal to look at this list and think “I’ve never heard of half of these airlines, let alone flown them.” But you don’t actually need to fly these airlines to get tremendous value out of their frequent flyer programs. Let me explain. Most airlines are part of a major airline alliance. You’ve probably heard of them: Star Alliance (cofounded by United) Skyteam (cofounded by Delta) Oneworld (cofounded by American) When an airline join an alliance, they agree to allow other airlines in the alliance sell tickets on their flights, and in return they get to sell tickets on their partners flights. When you go on the United website and you see an option to buy a ticket that’s actually operated by Turkish Airlines, that’s why — both of them are in Star Alliance. Fortunately for us, this cross-selling phenomenon isn’t just limited to tickets bought in cash (“revenue tickets”, in point hacker parlance). It also applies to tickets bought on points (“award tickets”)! In other words, Turkish Airlines can let members of their frequent flyer program, Miles&Smiles, book award tickets on United flights using their Turkish Airlines miles. Similarly, United MileagePlus members can often book Turkish Airlines flights using their United miles. This opens up a whole glorious world of possibilities and points arbitrage. Each frequent flyer program uses a different method to calculate how many points a given flight should cost. Some look at the flight distance, some look at which regions the flight transits between, and others look at how much demand exists for that seat. This means you can sometimes find the exact same flight and cabin for fewer points in a partner program! So let’s go back to our example: EWR-LHR in business class on flight UA 110. If we check the Turkish Airlines award search, we can find that same exact seat for just 45k Turkish miles. That’s a whopping 4.97¢/point! Found on the Turkish Airlines award search tool here. (You will need to make a Turkish Airlines account to access this.) If you’ll recall, this same flight would have cost 80k United miles or just above 130k Chase points — we’ve literally gotten 2-3x the value just by going through a United partner. You may think “but wait, I don’t have any Turkish miles.” But if you have a Bilt card (or selected Citi or Capital One cards), your credit card points can transfer at a 1:1 ratio into Turkish Airlines Miles&Smiles. This is why these transferrable points programs are so powerful: you can use them to book flights in programs you don’t regular use. Now let’s say you only have an Amex. You wouldn’t be able to transfer to Turkish Airlines unfortunately, but there’s still a deal for you! Chances are you’ve never flown or even heard of Avianca, but all you need to know is they’re a Star Alliance partner too. And that same EWR-LHR United business class seat is still available for 60k Avianca Lifemiles. Not as amazing as the Turkish redemption, but still a nice discount from the United MileagePlus one! Found on the Avianca Lifemiles award search tool here. You will need to create a Lifemiles account to access. (As you can see, it does pay to have exposure to various Big 5 programs so you can always get the optimal redemption.) Knowing how alliances work can lead to tremendous savings and help us easily maximize our points. It’s not always easy to find these redemptions though, and exploring the whole web of airlines alliances can get complicated. That’s why point hacking is a skill, and it definitely takes practice to get better at it! In the “Advanced” section below, I share a few tips for finding these redemptions, and I’ll share more in future issues too. By the way, that March 30th EWR-LHR flight I’ve been using as my example? That’s a real flight with actual award availability as of 6am this morning. Good points deals often get snapped up fast, so take a look if you’re interested! Like what you see so far? Subscribe for the next free issue, coming out in 2 weeks! Subscribe Some notes on redemption rates Typically you’ll see the really mouthwatering redemptions (>= 5¢/pt) on premium cabins. However, you can still find nice economy redemptions at a rate of 2-3¢/pt! For instance, our example EWR-LHR flight costs $460 for economy and is also available for 20k Avianca Lifemiles; that’s 2.3¢/pt. I’ve talked a lot about how you can get > 1¢/point by transferring points. But since the redemption rate isn’t fixed in most frequent flyer programs, the opposite can also be true. Sometimes you may see terrible redemptions of 0.5¢/point, in which case you need to look elsewhere, book via the credit card portal, or maybe even just book on cash. How do I actually transfer points? Usually you can transfer points in your credit card’s rewards portal. Look for words like “transfer to partners”. From here, you’ll be asked to link your frequent flyer account — ensure that you’re entering your member number accurately! Once you’ve done that, you’ll be able to transfer points, usually in increments of 1000 points. For Chase, you can go to the Ultimate Rewards portal here and click “Transfer points to partners” under the “Travel” tab. For most partners, the transfer is nearly instant. Go make a coffee and your freshly transferred miles should be deposited in your frequent flyer account by the time you’re back. On some occasions though, the transfer can take longer. This can be a bit inconvenient if you’re booking a particularly popular award ticket that may run out of space; I’ll talk about how to get around this in a future issue. Does this mean I should never use my points my credit card’s travel portal? Nope! If you’re trying to save cash, ultimately free travel is free travel. You might not be maximizing your points, but that might not be what matters then. However, be careful not to exhaust all your points in the portal; missing a killer partner redemption because you’re out of points is quite painful. Many portals also offer a combo of cash + points payment option. This can help take the edge off a particularly pricey flight by letting you, in effect, set your own preferred discount using points. I recently did this for a last-minute domestic flight; flights were $200 more than usual, so I used 13,000 points to offset the increase. Additionally, by using the Chase portal with my Chase Sapphire Reserve, my points were valued 50% higher (1.5¢/pt), and I earned 5x points on the cash portion— not bad! We were unable to load this poll. Please refresh the page. For experts: Two of my favorite underrated transfer partners As experts, you’ve probably used your fair share of transfer partners and gotten some awesome redemptions. There’s a few programs I don’t think get enough love, and I figure I’d talk about them below and exactly how you can add them to your repertoire. Types of award space (For some of you, this may be review; I just want to make sure we have a shared vocabulary here!) Not all award space is created equally. Usually when an airlines releases award tickets for a given flight, they release it into 4 buckets: Airline saver space Non-saver space Partner saver space Airline saver space is a special promotional rate offered for award tickets. If you can snag one of these rates, you know you’re getting the best points rate that program can offer. Often airlines will have a fixed rate for saver space (e.g. “one way US-Europe economy = 20k”), but unfortunately many US-based airlines have dynamic rates even for saver space. There’s very limited seats available in this bucket, and once it’s exhausted, you’re just left with non-saver space. Non-saver space is usually much pricier (think ~2x the cost), and is more likely to be dynamically priced based on demand (read: you’re not gonna get a stellar redemption rate here). Non-saver space can still be worth booking though if the cash fare for the flight is super expensive. Finally the partner saver space bucket is similar to airline saver space, but allocated for the airlines’ partners instead. The partner program is allowed to choose whatever pricing strategy they want for these seats, and often, the best deals come from partners that price their partner saver space cheaper than the airlines’ own saver space. One catch: the amount of partner saver seats is less than the amount of airline saver space, so if you find one, you better book fast. Turkish Airlines Miles&Smiles for domestic coast-to-coast trips on United The Sweet Spot Yes, weirdly enough the cheapest way to fly across the USA on points is through a non-US based airline! The Miles&Smiles program uses a region-based award chart where the point cost of a flight depends on your start and end region. Generally most programs using such charts tend to split the US into an East and a West region, which bumps up the cost of flying cross country. Fortunately, Turkish Airlines has a sweet spot here: flights within a single country count as flying within a single region, regardless of the size of the country. If we reference their award charts, we can see the saver (“promotional”) award ticket rate for domestic/intracountry flights is just: Economy one way for 7.5k miles Business one way for 12.5k miles (Turkish is in Star Alliance, so these flights are actually just United flights being cross-sold by Turkish.) This is such a ridiculously low cost award that has managed to stay under the radar for quite a while now. But there’s a good reason for that: for the longest time, the only way to transfer to Turkish was through Citi or Capital One, which aren’t as popular. But that’s all changed with the Bilt card; it’s one of the fastest growing cards in America, and they have recently become the 3rd transfer partner for Turkish. Now these deals are way more accessible to travelers! Finding Award Availability Unlike other airlines, Turkish Airlines unfortunately doesn’t let you see a calendar of available dates, which makes finding award availability hard. However, we can use a little trick: we can use a different Star Alliance partner with a better award search tool to find the available dates, and then pop those dates into the Turkish award search and book from there. This works because all Star Alliance partners will have access to the same partner saver space; it’s just a matter of finding it. Air Canada Aeroplan is known for having a really great award search tool for Star Alliance partner space, so we can just pop in our origin + destination city here and some rough idea of a date we want to travel on. Once you sign into your Aeroplan account, you’ll be able to see a 5 day availability calendar at the top. Generally you’re looking for anything that is priced low (like 15k miles or less), and on United metal — chances are that’s partner saver space. Let’s look for NYC > SFO for Feb 13 (perfect V-Day timing for all the cross-country long distance couples!). Found on the Air Canada Aeroplan award search tool here. Make sure to check the “Book with Aeroplan” box and make an Aeroplan account to see the calendar. According to the calendar at the top, we could also book on Feb 12 or Feb 14, but not Feb 11. Now that we’ve identified a date that has partner saver space, we can head back to Turkish and search there: And voila! We found Turkish partner saver space for this domestic United flight, and its just 7.5k Turkish miles compared to 12.5k Air Canada miles! One caveat: before you get too excited about the 12.5k mile domestic business class redemptions, I should say that it’s very very hard to find award availability for this one. I’ve never succeeded on it personally, and if you find it, you might wanna buy a lottery ticket. The economy tickets are usually very doable though. Air France/KLM Flying Blue for insanely cheap trips to Europe This one isn’t that underrated, and is actually one of the more popular redemptions for people who are getting started in the points game. It doesn’t hurt that Flying Blue is a transfer partner for each of the Big 5 credit card programs too! The reason I’ve still listed it here is many people tend to consider Flying Blue as just a good way to book Delta awards if you don’t have an Amex, but they’re missing the best part: Flying Blue promo rates. Every month, Flying Blue releases a new set of cities that they offer promotional pricing on (usually 25% off their regular partner saver rates). As long as you fly between any country in Europe and these cities, you’re eligible for the discounted pricing (while seats last of course). The discounted pricing is in effect for trips within 6 months of the current month, so the January promos are in effect for trips till June 30. Unfortunately there’s no US-based cities on this list for January, but in December, you could have booked flights from the following cities for a discount: Washington D.C. to Europe from 15k miles (25% off) Boston to Europe from 15k miles (25% off) This month there are lots of Canadian cities on the list though (Toronto, Montreal, Ottowa), so for my Canadian friends out there, it’s your time to shine! You can always see the list of cities here under “Long-Haul Flights” (I suggest bookmarking this link!) Let’s check out an example. Let’s say you’re looking to do V-Day in the city of love, Paris. We can pop in Toronto for the origin and Paris for the destination, and select Business. Seems there’s some partner saver space for Feb 13! You can tell because the button is in green; non-saver space is shown in blue. 50k ain’t bad for Air France business class! You will need to pay a bit of a higher fee here (220 euros), but this flight is going for $5526 right now, so you’re getting an insane 10.5¢/pt redemption here. What a steal for V-day in Paris. (Pro tip: You don’t have to reside in Toronto to take this flight…there’s dozens of NYC <> YYZ flights every day, and you could just book a cheap one like the one below, chill in the Air Canada lounge for free with your business class ticket, and hop over to Paris from there.) There’s so many more underrated transfer partners I could include, but this issue is getting kinda long, so I’ll throw ‘em in a future issue! We were unable to load this poll. Please refresh the page. Deals and Other Awesome Stuff Bilt Dining has 100 restaurants participating in NYC Restaurant Week! You’ll earn extra Bilt points on these restaurants, even if you don’t use your Bilt card (just make sure to register your other card in the Bilt wallet). Plus you can register any Mastercard here (including your Bilt one) to get $10 in statement credits per restaurant, up to $30. You can check your Bilt app for the full 100 restaurant list. Chase Offers has a few cool promos running (may vary by card). Be sure to activate them in the Chase app! Here’s a few on the Chase Sapphire Reserve: 10% cash back on Liquid IV and McDonald’s for your next drunk night out wholesome night in. 10% back on various hotel chains, including Intercontinental, Crowne Plaza, Le Meridien, Kimpton, Hyatt Place, and Holiday Inn. $10 cash back on Turbotax: file your taxes early and feel like a true adult Since I’m a travel advisor working under a licensed travel agency, I can get you access to perks and rates that aren’t publicly available when you book through me. Virtually all of these options include free perks like buffet breakfast for 2, $100 hotel credit, and room upgrades! Here’s a few of the coolest ones: Park Hyatt Bangkok: Stay 3 nights, pay for 2 on stays till March 31. Also, stay 2 nights, pay for just 1 for specialty suites (with same perks) Andaz 5th Avenue (NYC): Stay 4 nights, pay for 3 on stays till March 31 (includes perks like free breakfast, $100 hotel credit, and room upgrade). The Andaz is one of my personal favorite hotels in NY! Thompson Denver: Stay 3 nights, pay for 2 for stays till March 10. Those of you going for a *cough* certain digital asset conference *cough* might find this one useful! (I’ve stayed there personally too for that same conference in the past) Grand Hyatt Playa del Carmen Resort: Stay 3 nights, pay for 2 for stays till June 30. Also, you’ll get an extra $50 to spend at the spa (on top of the $100 hotel credit). If you’re staying at a Kimpton hotel this month or next, say “Chalet All Day” to the front desk. You’ll be glad you did! Thanks for making it this far and I hope you’re enjoyed this first issue! It’s my first time doing anything like this, and I’d really appreciate your thoughts and feedback in my Google form here! Bon Voyage, Shrey Thanks for reading Shreycation! Subscribe for free to receive new posts and support my work. Subscribe 14 2 Share",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/p/issue-1"
    },
    {
      "title": "Why you need a Bilt card in your wallet - by Shrey G",
      "content": "Discover more from Shreycation Time to level up your travel and points game. Tips, tricks, and hacks from a budding travel professional. Subscribe By subscribing, I agree to Substack's Terms of Use, and acknowledge its Information Collection Notice and Privacy Policy. Already have an account? Sign in Why you need a Bilt card in your wallet SHREY G JAN 17, 2024 6 1 Share One of the biggest questions I’ve gotten this past year is what in the **** is a Bilt card? It’s a justified question: their ads are everywhere from airports to subways, and they’ve quickly become one of the hottest credit cards on the market. In my opinion they very much deserve the hype. I was a skeptic when I first heard of the card, but their team continues to deliver tremendous value. Here’s a few reasons why Bilt has quickly reached the top of my card stack. Points on Rent The marquee benefit of Bilt is the ability to earn 1x points on rent without paying the credit card transaction fees. Technically, you can earn 1x points on rent on many other cards too (rent would just fall in the “other” purchases category) but you’d have to pay a ~3% transaction fee, which wouldn’t be worth it in most cases. Bilt lets you bypass those fees and feasibly earn points on your rent. If you’re living in a typical US metro area, you’ll easily earn tens of thousands of free points per year this way! Given this is the only card product on the market that does this, it’s natural to have some questions: “So wait are they just fronting the transaction fee?”: Nope, Bilt spins up a special bank account that has your rent preloaded, and you use that to pay for your rent instead of your personal bank account. Your online rent payment portal will omit the standard credit card fee since you’re technically paying via bank transfer, and Bilt will charge you for the debited amount. “What if I don’t have an online rent portal?”: Bilt can send a check, PayPal, or Venmo to your landlord. This requires a bit of one-time setup, but you’ll earn points all the same. They don’t support Zelle yet unfortunately. “What if I Venmo my share of the rent to my roommate? How about subletting?”: Bilt can handle this too. You can set your special Bilt bank account as a payment option in Venmo and use that to pay your roommate. Bilt may ask for lease verification if you go this route though, which means YMMV for sublet situations. “Any catch?”: You need to use your Bilt card 5x a month to earn points on rent, but that’s about it! As you’ll see below, you’ll want to use it way more than that anyway. The card isn’t just a one trick pony, and you’ll also earn 3x points on dining and 2x on travel. The dining multiplier rivals the best cards on the market, but that travel multiplier is middle of pack; I’d use other premium travel cards like the Amex Platinum card to book travel if you have them. Surprisingly Good Transfer Partners Cool, so you can earn points on rent, but that’s only worth something if the points are useful. As we discussed in Issue 1, points are only as good as their transfer partners, and honestly, I’ve been shocked by how good the list is for Bilt: That’s a pretty impressive list. Here’s some highlights: Bilt is the ONLY card program that transfers to American. Oneworld loyalists rejoice! Also, American has been putting up some impressively cheap award tickets for Asia travel lately, but more on that in a future issue. Bilt also covers United, which makes them the only card program that partners with 2 major US airlines. If you’re also sitting on an Amex, note that this gives you direct point transfers to the full US trifecta: United, American, and Delta. I’ve written about Air France/KLM before, and it’s a fantastic program for dirt cheap Europe trips. Air Canada, British Airways, Virgin Atlantic are also fantastic for a whole variety of partner awards, and I’ll certainly write about them soon. Most major card programs are partnered with these four airlines though, so this isn’t a unique benefit. Turkish Airlines and Avianca are stellar options for rare but super high value redemptions within Star Alliance. If you’re curious, you can learn how I saved 70k-90k points using these programs for an EWR-LHR trip, and how I used Turkish to fly cross country for a mere 7.5k miles. Turkish isn’t partnered with Amex or Chase, and Avianca isn’t partnered with Chase, so if you’re holding these cards, Bilt helps round out your transfer partner portfolio. Honestly, their BizDev team must be doing the most. I’ve personally been very invested in the Chase ecosystem, yet I’ve found myself spending more on Bilt lately because Bilt has access to killer partners I just don’t have on Chase. Learning something from this post? Subscribe for more weekly travel tips and tricks! Subscribe Rent Day Promotions Paying your landlord isn’t typically something to celebrate, but Bilt makes the first of the month a little sweeter with their “Rent Day” bonuses. Every Rent Day, Bilt provides some wildly good deal or transfer bonus or status trial that’s usually hard or even impossible to find otherwise. Here’s some examples from the past: Up to 150% transfer bonuses for frequent flyer programs like Air France/KML Flying Blue, Emirates Skywards, and Virgin Atlantic Flying Club. Up to 18x on restaurants partnered with Bilt (more on that below). Complimentary United Silver or Gold status for 120 days, with the potential to retain it for a full year. 90 day free trial of World of Hyatt Explorist status, Hyatt’s 2nd best status tier providing complimentary room upgrades and late checkouts. Transfer bonuses of 150% are absolutely unprecedented in the points world; usually people would rejoice over a 30% transfer bonus on the other major card programs. And re: the restaurant points boost, I have a friend who put his Bilt card down on a $750 friends’ dinner and walked away with a whopping 12k points — a free cross-country flight right there. (Note that some bonuses scale with your Bilt status tier. I won’t get into it this time, but Bilt has their own status program and you earn status based on the points you’ve earned. But even the entry-level tier got 75% transfer bonuses; still an insane deal.) Bilt is perhaps the most gamified, content-forward, and youthful of the Big 5 credit card programs, and as such they have some fun Rent day programming too: Point Quest: A trivia show where you earn up to 250 points for answering current events questions. (They also release their content on TikTok!) HQ Trivia is back, but with points?? RentFree: A Family Feud-style game show where you enter a drawing to get your rent paid for by Bilt. Complimentary spots at local SoulCycle classes. All spend categories (besides rent) earn double points! Dining goes from 3x to 6x, Travel goes from 2x to 4x, and all other non-rent spending goes from 1x to 2x. Bilt Dining Bilt has partnered with a whole variety of restaurants in major US metro cities, and you’ll earn anywhere from 2x to 10x extra points per dollar when you dine there. That’s on top of the 3x points you earn from any dining transaction on your Bilt. One of the coolest parts of this program is you don’t even need to use your Bilt card; you can register other cards you own into your “Bilt Wallet” and you’ll still earn the extra Bilt points! I’ve registered my Chase Sapphire Reserve in my Bilt Wallet. Now let’s say I go eat at one of my new favorite NYC spots, 8282 in Lower East Side. 8282 is listed as a +3x Bilt Dining partner. I’ve got two options to earn points on my meal: As you can see, Bilt Dining affords you flexibility on how you earn points on your nights out, which can be very useful as you try to build up points balances in multiple programs. You can see the full list of Bilt Dining restaurants here. Bilt Dining has restaurants in many major cities like NYC, Boston, San Francisco, Seattle, Atlanta, Miami, and more, but I will say that some cities definitely have a more developed list of restaurant choices. Also, as of yesterday it’s officially NYC restaurant week, and there’s plenty of Bilt Dining restaurants on the list right now! If you’ve already got the card, there’s a whole list of them in the app. Bilt Experiences Many major credit card programs technically offer “exclusive experiences” for cardholders, but it’s often hard to access these, and they’re typically quite niche. Bilt has a significantly better experience program with events you’ll likely want to go to. In the past, they’ve offered unique dining experiences and even box tickets at NFL games bookable on points. I went to one of their events in November at Meduza, an up-and-coming mediterranean restaurant that had literally just opened a few days prior! It was a lovely 5 course menu with a cocktail pairing, and the vibes were excellent. They had all the guests sit on a long table together, so everyone got to socialize and become friends while drinking way too much. Plus they had some of the Bilt team at the event too, and I got to ask a bunch of my prying questions about the card. 5 course menu in a super vibey spot. The bluefin tuna tartare topped with caviar was definitely one of my faves. The dining experiences were bookable in the Bilt app for $150/seat or 12,500 Bilt points; I personally opted for the former because I know I can extract more than 1.2¢ of value per point. They’ve also run dining experiences in Miami, Dallas, and Boston. I’m not personally the biggest football fan, but back in September, they also let cardholders book spots in a box suite for a Jets vs. Chiefs game. The cost was just 10k Bilt points — given that a typical box suite goes from $5-25k for 20 people, this was quite the steal! Plus apparently Taylor Swift attended that game to cheer on Travis Kelce, so who knows, you could have bumped into her at the stadium too. Peace of Mind + Protections Because the Bilt card is also a World Elite Mastercard, you get some additional travel protections for peace of mind: Auto rental collision damage waiver: Rent a car and you can decline the extra collision insurance from the rental company. Trip delay reimbursement: If your trip gets delayed 6+ hrs, they’ll help cover costs. Trip cancellation protection: If your trip gets cancelled due to medical reasons, they’ll reimburse you even for non-refundable plans. Cellphone protection: If you pay your phone bill with Bilt, they’ll pay you if you phone gets destroyed or stolen. Purchase protection: Buy something recently and it got destroyed or stolen? Bilt will reimburse you. I’m being a bit vague on the exact terms and reimbursements deliberately, since that deserves its own post. Most travel-focused cards have these protections too, but not all protections are created equal. The devil tends to be in the details, and having reviewed the fine print myself, I’ll say Bilt is probably below average in terms of the quality of these protections. Still, something is better than nothing, but if you’ve got cards like a Chase Sapphire or Capital One VentureX, I’d rely more on those protections instead. I’ll do a proper deep dive that compares the different cards and their protections in a future issue. Best Part: $0 Annual Fee All of this comes for a $0 annual fee, which is honestly a bit wild. This makes it a super friendly “first travel card” for beginners, and an easy addition for experts. We were unable to load this poll. Please refresh the page. My Verdict Friends have been asking me for years about the best card to start travel hacking with, and I used to say the Chase Sapphire Preferred. While that’s still an awesome card, it has a $95 annual fee, and Bilt is free with amazing benefits and partners to boot. I would highly recommend this card for beginners, but as I discussed above, there’s plenty of perks even for seasoned veterans. Even if you don’t pay rent, the rent day bonuses and transfer partners alone make the card worth it. The card is definitely targeted towards younger generations living in major US metro cities, which is a refreshing positioning compared to some of the other cards. If you’re based in NYC, Bilt has an especially strong presence here (they’re based here after all), but you’ll also get a decently fulfilling set of perks and benefits on Bilt Dining and Bilt Experiences in other major US cities. From a business perspective, I’m also generally amazed at how fast their team has been building and how they’ve carved out a growing wedge in an otherwise oligopolized market run by legacy players. More than other cards, they’ve been focusing a lot on strategic partnerships that lend the card more utility, revenue streams, and virality. I have to imagine Bilt has identified fairly diverse revenue streams given their $0 fee strategy. This all means there’s likely more to come with this card! If you do decide to get a Bilt, I would appreciate if you use my referral link below! It gets me some extra points which I can use to travel more and power more issues of Shreycation. I only provide this because Bilt is a product I’m personally a huge fan of (can you tell?), and I hope you enjoy it too! Apply for Bilt (Disclaimer: This post is not financial advice and you should do your own research to ensure this card is right for you, and that you have a reasonable chance of being accepted. Applying will likely affect your credit score. I’ll do a post later with tips on getting and maintaining high credit scores to maximize your chances of getting good cards and getting high limits.) If you enjoyed this issue of Shreycation, please subscribe and share it with a friend! Share Shreycation If you’d like to help make the next issue of Shreycation better, fill out my feedback form here. 6 1 Share",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/p/issue-2"
    },
    {
      "title": "How to actually transfer your points - by Shrey G",
      "content": "Discover more from Shreycation Time to level up your travel and points game. Tips, tricks, and hacks from a budding travel professional. Subscribe By subscribing, I agree to Substack's Terms of Use, and acknowledge its Information Collection Notice and Privacy Policy. Already have an account? Sign in How to actually transfer your points A button by button tutorial SHREY G FEB 16, 2024 5 Share Hi Shreycationers, We’ve been talking a lot about how you can use your credit card points to get outsized value on your points. Instead of just getting 1¢/point, you can squeeze out 3x, 5x, or even 10x the value just by transferring your points into airline mileage programs to book “award travel.” This also lets you book free flights on airlines where you might not otherwise have any miles; just transfer them over from a card! There are entire forums dedicated to going down the rabbit hole on strategies for optimally deploying your points. But if it’s your first rodeo, you’re probably hung up on a more fundamental question: how do I actually move the points from one program to another? The UIs for many of these credit card and airlines program are historically a bit lacking, so the process can be unintuitive. So without further ado, a play by play guide on how to actually transfer your points. Step 0: Identify your redemption One of my dear Shreycation readers was recently fed up with the 29 degree weather in NYC and needed to escape somewhere warm. He wanted to book a flight to Hawaii, so I helped him through the process. Now I’ll be walking you through that same process in this issue. Way better than 6 inches of snow… Before we can book our travel using points, we must pinpoint available award seats that can be redeemed with an airline's mileage program. It’s essential to ensure this award space exists BEFORE we transfer points from your credit card, as once points are transferred, there's no going back. Point transfers are one-way and irreversible. Finding ideal award space is the subject of Shreycation issues past, present, and future, but for the purpose of this example, we’ll work with one of my favorite award redemption paths. I’ve previously talked about how you can book dirt cheap domestic flights on United Airlines by redeeming miles in the Turkish Airlines Miles & Smiles program. (Turkish and United are partners, meaning I can redeem Turkish points on a United ticket.) Traveling to Hawaii counts as domestic travel in Turkish’s eyes, so we can take advantage of a sweet spot here and book a EWR (Newark) to HNL (Honolulu) flight for a very cheap 10k Turkish miles. (Booking this flight directly with United would cost 30k+ United miles.) Hard to see in this image, but there’s a very tiny little United logo in the search result that indicates this is a partner flight. Now I don’t have any Turkish miles since I rarely fly on Turkish in the first place, but there’s where our credit card points come in. We can mint miles in Turkish by transferring from points from a card. Step 1: Transfer the points Now that you know where you want to redeem your points, go to your credit card rewards portal to start the transfer. You’re looking for a button that says something like “Transfer points.” Note that you do NOT want to go through their “Book travel” feature; this is for booking travel on cash (or using your credit card points directly, which is usually a pretty poor use of points). Some quick links to your rewards portal: Chase, Amex, Capital One, Citi, Bilt (use app) Here’s where to find the magic “transfer points” button in a few major card portals: How to access the point transfer feature in various credit card rewards portals. In order: Chase, Amex, Bilt. Don't click the buttons marked with a red X; these are for regular cash travel. Tap images to see in more detail. Confirm your credit card is partnered with your desired airline mileage program Not all airlines are partnered with all credit card partners, so you’ll first need to make sure you use a credit card that can transfer to your desired airline mileage program. (This is also why I recommend having cards in multiple programs, even if it’s the entry level cards!) Here’s a handy diagram I made for y’all to see all the transfer partners at a glance: Print or download this for future reference! I made this diagram because I couldn’t find anything like it on the web. Going back to our EWR-HNL example, we’re booking through Turkish Airlines, so according to the diagram above, I’d need to use Bilt, Capital One, or Citi to transfer points. If I go the “Transfer” tab in the Bilt app, I can scroll down and select Turkish: If you haven’t made an account with the target mileage program yet, you’ll need to do that first and enter your account number when transferring. Calculate how many points you need to transfer Most of the time, this is dead simple. The vast majority of points transfer tend to be at a 1:1 ratio, so if you need 10k airline miles, just transfer 10k credit card points. That means I just need to transfer 10k Bilt points into Turkish Airlines to book my EWR-HNL flight. A few caveats: There are some rare exceptions to the 1:1 transfer ratio, like transferring to EVA Air via Capital One. Credit card programs often run transfer bonuses where you get more miles per point you transfer. You can take advantage of these bonuses to get hilariously cheap award travel, like many Shreycation readers did on Air Canada earlier this month. Bilt is renowned for their killer 75-150% transfer bonuses on the 1st of each month, and other programs like Chase and Amex have run 30-60% bonuses in the past. Learning how to finally use that small fortune of points you’ve been sitting on? Send this article to a friend who desperately needs some help! (We have a referral program here at Shreycation that’ll score you some dope content and perks; use the button below to make sure your referral counts.) Refer a friend Step 2: Wait Many point transfers are nearly instant. Once you’ve triggered the request from the credit card portal, you can usually make a quick coffee and by the time you’re back, the miles will be credited to your airline mileage account. For example, my points took 10 minutes to transfer from Bilt to Turkish, and I got an email confirmation from Bilt telling me the deed was done. After 10 mins of waiting, I got an email from Bilt… And sure enough, they’re right there in my Turkish account! Sometimes, the transfers can take longer though. For example, transferring Bilt points to American AAdvantage or Amex points to Singapore KrisFlyer can take up to 24 hours. Good award tickets tend to go away quickly, so if you’re dealing with a partner that has a transfer delay, you can often call up the airline to “hold” the award for you. This lets you rest easy knowing someone else won’t swoop your spot just because your points were in transit. Step 3: Book it Now that you’ve transferred the points, you can return back to the portal for the airline you’re booking through and complete your booking! Wait why am I being charged cash too? Often when booking award travel, you might notice you’ll still need to enter your credit card and pay some cash. This is because most award travel has a few taxes and surcharges, on top of the miles you’re redeeming. You can’t pay for these extra fees in miles unfortunately. The surcharges vary pretty significantly across different mileage programs. Some programs like United charge a nominal amount of $5.60 (to cover the TSA security fee). However, others may charge you the dreaded “fuel surcharge”, a fee that often scales by distance and cabin class and can add hundreds to the flight cost. Air France is known for doing this: Sample economy class award from Air France with a hefty $166 fuel surcharge. Since these fuel surcharges can be hefty, it’s important to consider those when valuing your redemption — spending 27k miles to get a $400 flight for free is less compelling if you’re spending $170 in surcharges. We were unable to load this poll. Please refresh the page. Step 4: Manage your flight Now that you have your flight booked, you might be wondering how to manage your flight (e.g. check in, change your seat, upgrade, etc.). This differs based on whether you booked your award directly with the airline or if you booked via a partner. If you booked an award with the airline directly If you booked an award ticket with the same airline that’s operating the flight (e.g. you booked on United and you’re flying United), it’s business as usual. Once you book, you’ll already see your flight linked to your mileage account and in your app, no action required. You’ll also be able to change seats, upgrade, check in, etc. like it’s a normal flight. If you have an issue, you just take it up with the airline. If you booked an award via a partner In our example though, we’re using Turkish to book a ticket on a United flight, so things get a little more complicated since there’s 2 airlines involved: the one we booked from (Turkish), and the one we’re actually flying (United). Upon booking, Turkish will send me an email with a confirmation number. FAKENO is a dummy reference number for example sake. Now I can enter that confirmation on the United website and it should link the reservation to my MileagePlus account (sometimes you may need to contact them if this doesn’t work automatically though). United may assign me a different confirmation number than the one Turkish gave me, but rest assured, it’s the same flight. On the left, I opened the United app and linked my trip to my United account using the code Turkish gave me. On the right, you can see United successfully retrieved my flight details. Since I have United status, linking my trip to my United account lets me enjoy my United perks on the flight (e.g. picking a Economy Plus seat for free). To be clear, I won’t earn any United miles or status points on this flight, but I will get to enjoy my existing perks. What if I need to make changes or need customer support? If you need help with the booking (e.g. cancel/change flight), contact the airlines you booked through (Turkish in this case). If you need help with the flight (delays, missed flight, seat change), contact the airline you’re actually flying on (United in this case). Putting it together We’ve now gone through the full process of transferring points to get killer redemptions. It may seem like a lot at first, but after a few redemptions, it’ll be second nature to you! As I mentioned earlier, this article is inspired by an actual Hawaii trip I was helping a Shreycation reader with. The golden rule of free travel is to earn lots of points per dollar and redeem them for lots of cents per point. Using tips and tricks we’ve covered in previous issues, he executed this to a T. He earned 10k miles from a single fancy dinner with friends because he took advantage of a whopping 16x bonus on Bilt Dining on the 1st of the month. He then identified a Turkish airlines redemption for his Hawaii trip for just 10k miles. Just by strategically earning and deploying points, his one dinner from 2 months ago paid for his Hawaii flight today. (That flight would have cost $775 by the way. That’s 7.75¢/point — insane value, especially for economy.) Note for the Eagle Eyed: Turkish Devaluations Those of you who have been following along with previous Shreycation issues might have noticed that the Turkish redemption here is 2.5k miles more than expected. After all, just 1 month ago I wrote that all domestic redemptions were 7.5k miles. Unfortunately, this week Turkish has finally succumbed to inflation the same way United and many others have, and they made various routes more expensive (sometimes as much as 90% higher). The silver lining is domestic trip awards only increased 33% from 7.5k to 10k, so it’s still one of the best deals out there for domestic travel. Thanks for reading! I know it’s been a minute. I’ve been working on something new and exciting in the travel space, and y’all will be the first to hear about it once it’s up. It’s the culmination of months of work, and I’m excited to share it soon! Shreycation has received so much love and support from y’all, and I’d love to keep that going. Share with a friend, and if this is your first time reading Shreycation, subscribe for more. Share Shreycation Subscribe 5 Share",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/p/how-to-actually-transfer-your-points"
    },
    {
      "title": "Let the government pay for your next flight - by Shrey G",
      "content": "Discover more from Shreycation Time to level up your travel and points game. Tips, tricks, and hacks from a budding travel professional. Subscribe By subscribing, I agree to Substack's Terms of Use, and acknowledge its Information Collection Notice and Privacy Policy. Already have an account? Sign in Let the government pay for your next flight How to use stopovers to hack your multi-city itineraries SHREY G JAN 26, 2024 4 1 Share Did you know Etihad Airways will practically pay you to visit Abu Dhabi during your next international trip? It’s called a stopover, and it’s the easiest hack for adding an extra stop to your itinerary. Here’s how it works. Let’s say I’m traveling from NYC to Delhi during mid March. There’s a $411 option that involves connecting through Abu Dhabi (AUH) with a 3.5 hour layover: But Abu Dhabi is beautiful and maybe I’m not quite satisfied just exploring the airport — after all, if I’m connecting through Abu Dhabi anyway, I might as well stay there for a few nights and explore! This mean I need to book 2 separate one-way trips (JFK > AUH, AUH > DEL), but that costs a total of $802; almost double my original itinerary price! Here’s the secret galaxy brain travelers know: Etihad has a free stopover program where they’ll let you book an itinerary with a multi-day Abu Dhabi stay in between, but without the extra markup + taxes from booking two separate one-way trips. In other words, Etihad will just pretend you’ve booked a single trip (NYC-DEL in this case) that just happens to have a verrrrryyy long connection in their home city (AUH). Getting this free stopover is easy; I simply go to the Etihad site and check the box saying I’d like a free stopover: This gives me access to a new itinerary option that costs $434, almost the same price as my original itinerary, but with one big difference: I get a 48 hr connection time rather than just 3.5 hrs. And obviously, I’m more than welcome to leave the airport and explore the city during that time. So far, Etihad has subsidized my airfare by effectively treating my two separate trips as if it were just one. But Etihad goes one step further and actually comps my hotel for up to 2 nights! Etihad will let you choose from one of nine 3-star partner hotels for your complimentary stay (usually would cost $60-$100/night). Etihad also gives you the option to upgrade your stay by giving you deep 40% discounts on bougie 5-star hotels like the Shangri-La Qaryat Al Beri or the Grand Hyatt Abu Dhabi (details here). Let’s recap. I was going from NYC to Delhi but noticed I had a connection in AUH. Initially I was going to just rot at my gate for a lackluster 3.5 hr layover, but because of Etihad’s stopover program, I’m actually able to explore the glory of Abu Dhabi for 2 nights for practically the same cost! That’s 2 trips for the price of one! (If you’re doing the math, between the subsidized airfare and the free hotels, that one little stopover checkbox on the Etihad site has saved me over $500.) Literally get to spend 48 hours exploring these tall buildings at practically no extra cost, all thanks to stopovers. Inspired to enjoy a free stopover with a friend? Let them know! Share Quick Vocab Note: Layover vs Stopover Layovers are less than 24hrs in length, and usually don’t involve leaving the airport. The vast majority of flight connections are layovers — you’re just there as a means to an end. Stopovers are usually 24hrs or more, and involve you intentionally leaving the airport to explore the city. The connecting city becomes a destination in and of itself. Some stopover programs require you to contact customer support, so knowing the difference and using precise language with the support rep can expedite your process. Why do free stopovers even exist? As you saw in the Etihad example, stopovers save you a ton of money on multi-city trips. But why does Etihad care about subsidizing your travel like this? Why do free stopover programs even exist? To answer these questions, we need a quick airlines industry lesson. Many of the world’s major airlines are at least partially, if not majority-owned by their home government. The Singaporean government’s investment arm, Temasek, owns 56% of Singapore Airlines. TAP Portugal was swallowed up by the Portuguese government in 2020 when they bought out 72.5% of the carrier — the list goes on. These nationalized carriers are often called “flag carriers.” Most governments have an active interest in boosting tourism to their nation. Since they have a majority stake in their flag carriers, foreign governments can use them to incentivize impulse visits by implementing stopover programs. So when Etihad offers you a free stopover in Abu Dhabi, you’re getting your travels subsidized by the Emirati government in the hope that you’ll come again and maybe even tell your friends. Talk about customer acquisition cost… This concept might be a bit foreign to us in the USA; the airlines industry was deregulated and privatized in America in the 70s, so the USA doesn’t have official “flag carriers” that have the US government’s investment and blessing. For my international readers, that means stopovers in the US aren’t really a thing (although there is a hack that I’ll share in a future Shreycation Snack!). Five awesome stopover programs There’s a ton of stopover programs out there, and they all vary in their perks, pricing, and how long you’re allowed to stay. Most aren’t as generous as Etihad and won’t comp your hotel, but in all cases, the programs below will let you stay a few days in their host city without needing to book separate one-way tickets, which saves you some dough. Other programs let you do free stopovers, but only on award tickets (i.e. tickets you buy using points/miles). Going through all the stopover programs is beyond the scope of this article, but I will introduce a few fan favorites: Turkish Airlines Like Etihad, Turkish also gives you a truly free stopover experience with hotels and all. The rules are a little more specific though: you need to have already booked a route with a 20hr+ layover in Istanbul (IST). If you are, you’re entitled to (a) stopover without increasing your airfare and (b) one night in a 4-star hotel if you’re flying economy, or two nights in a 5-star hotel if you’re flying business! This can be a fantastic way to explore one of the world’s oldest and most historic cities. As always though, Turkish is a little behind the times on technology. There may be little indication during the booking process that your flight is eligible, and you’ll need to contact them via email to actually arrange your stopover (it’s not an automatic process like others on this list). What if my layover is less than 24 hours? Well turns out Turkish still has something for ya! If your layover is 6-20 hrs, Turkish offers layover service! You can just hit up a “TourIstanbul” counter during your layover and they’ll put you on a tour bus and show you around and give you a meal for free. If you’re at the upper end of this layover range (12+ hrs), Turkish will let you relax in a hotel for free too (think of this as “Stopover-Lite”). Links: Stopovers, TourIstanbul, Layover hotels JAL Japan Airlines will let you spend 1-6 nights in Tokyo or Osaka. If you’re heading to say, Niseko for skiing this season, might as well throw in a stop at Tokyo! Technically, you should be able to use Japan Airlines’ multicity booking tool to just specify your desired stopover, and it should give you the same price as with a non-stopover itinerary. In practice, JAL’s tech isn’t that great, so sometimes you’ll see the price jump. No worries though; you can call up their booking agents and they can set up the stopover without the price difference. I’m working on a definitive guide to stopovers that covers all the carriers that offer free stopovers, and the easiest way to book them. As you’ve seen above, stopover programs have various rules and quirks, but I’m working on compiling those in one place for you. If you refer 3 new subscribers to Shreycation, I’ll send it to you for free! Make sure to use the share button below (or the one earlier in this post), or your referral may not count. Refer a friend TAP Portugal TAP Portugal has been gaining popularity these days as one of the cheapest ways to fly to Europe on cash. If you’ve taken one of these flights, you know that you’ll likely layover in Lisbon or Porto. But you can also stopover in these cities for up to 10 days! TAP makes it super easy to book these directly on their site. This pops up right when you search on the official TAP Portugal site; so easy. Also, TAP will give you 25% off airfare to other Portugal destinations during your stopover, including exotic getaways like the Azores! Singapore If you’re flying into Asia, you can add a free stopover in Singapore as long as you’re booking using Singapore KrisFlyer miles (sorry, no free stopovers on cash tickets). For example if I want to fly SFO > BKK (Bangkok), that would cost 42k miles each way on Singapore Airlines, with a connection in SIN (Singapore). In theory, if I wanted to build in my own SIN stopover on miles, I’d actually need to book 3 flights on miles: SFO > SIN (42k), SIN > BKK (13k), BKK > SFO (42k), total of 95k miles. But since Singapore has a free stopover program, that SIN > BKK flight basically becomes free, and I save 13k miles! Note that you get 1 free stopover if you book a roundtrip saver award, or 1 free stopover on a one-way advantage award (saver, as the name suggests, is a cheaper award that has limited capacity). Also, Singapore doesn’t give complimentary hotels, but they do offer deep discount stopover packages that include accommodations, transportation, and attraction tickets. But Shrey, I don’t have KrisFlyer miles! Yes you do. Every major card program except Bilt transfers points into Singapore KrisFlyer. If you’re not sure what that means, check out my breakdown on transfer partners! What if I have a long layover in SIN but I don’t want to stopover? SIN is widely considered the world’s best airport and there’s so much to do there (I almost missed a connection because I was too engrossed), but if you do want to get out, Singapore does offer free 2.5hr tours if your layover is 5.5hrs or longer. Singapore is probably one of my favorite cities in the world; you bet I’m taking a free stopover there if I can get it. Photo: Nicolas Lannuzel Air France/KLM Flying Blue I’ve written about the Flying Blue frequent flyer program before, and it’s truly the gift that keeps on giving. Let’s say you wanted to book an economy ticket on points from Toronto (YYZ) to Rome (FCO) for the Italian summer. Flying Blue currently has promo fares for routes involving Toronto, so you’d get a great rate; just 22k miles for YYZ > FCO on KLM, connecting through Amsterdam (AMS). But we can stretch our miles even further and make our AMS layover into an AMS stopover at no extra points cost! Unfortunately, you do have to book these over the phone, as their online award search tool doesn’t let you book multi-city itineraries. But Flying Blue makes up for it with the most liberal stopover policies of any other program on this list: you can stopover in ANY of the connecting cities on ANY of their partners. Flying Blue has 34 partners (including SkyTeam airlines like Delta and Virgin Atlantic), so you could do stopovers anywhere from LHR to HKG to CDG to GRU (Sao Paolo) and more. This is in stark contrast with other programs that only let you stopover in the carrier’s host country. Also, they let you spend up to 12 months on you stopovers; great for digital nomads! Thanks for reading! As always, your feedback is crucial to making the next issue of Shreycation even better. If you’ve got 60 seconds (seriously), drop me some feedback here. And if you haven’t subscribed yet, what are you waiting for? New issues every week. Subscribe 4 1 Share",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/p/issue-3"
    },
    {
      "title": "Using Air Canada to fly cross-country for just 5k miles",
      "content": "Discover more from Shreycation Time to level up your travel and points game. Tips, tricks, and hacks from a budding travel professional. Subscribe By subscribing, I agree to Substack's Terms of Use, and acknowledge its Information Collection Notice and Privacy Policy. Already have an account? Sign in Snacks: fly cross-country for just 5k points?! Deal of the month courtesy of Air Canada 🤝 Bilt SHREY G JAN 30, 2024 5 Share This snack covers a Bilt-specific deal, but if you don’t have one, scroll down because there’s still a bonus snack for you to nibble on! I’ve mentioned before that one of the best ways to fly cross-country routes like NYC <> SFO/LAX is via Turkish Airlines for 7.5k points. But on February 1, we get to breathe rare air and go up to 33% cheaper. Bilt has a habit of pulling out some killer transfer bonuses on the 1st of the month, and February is no exception. On February 1, Bilt is offering a whopping 75-150% transfer bonus to Air Canada’s Aeroplan frequent flyer program. Your exact bonus depends on your status level with Bilt, which you can check in the app. Higher status in Bilt gets you higher transfer bonuses on Rent Day. Makes it worth getting Bilt status! I want to emphasize how crazy this deal is. In the past, programs like Chase have offered a 20% bonus; even the lowest-tier Bilt members get almost 4 times that here! Now here’s how you turn that into the cheapest cross-country flight I’ve ever seen. We can go on the Air Canada Aeroplan site and look up EWR <> SFO flights on March 5 and we’ll see these options: This is a live example, and chances are you’ll still be able to book it on Feb 1. Flying cross-country takes 12.5k Aeroplan miles on a typical day, which usually means transferring 12.5k Bilt points. But on Feb 1 we’re armed with a huge transfer bonus from Bilt, which means it could cost as low as 12.5/2.5 = 5k Bilt points if you’re Bilt Platinum. But even if you’re just Bilt Blue, it’s still just 7.2k points — strictly better than transferring 7.5k points to Turkish! Also, the cash value of regular economy on these flights is $165. That values your Bilt points as much as 3.3¢/point. That’s pretty darn good, especially for economy! This deal is ONLY available on Feb 1, so make sure not to miss out! Aeroplan is quickly becoming one of the most compelling Star Alliance programs, and I’m not sure when we’ll be lucky enough to see an Aeroplan bonus this crazy again. Subscribe so you can stay in the know next time a great deal comes around! Subscribe But Shrey, I can’t really commit to a flight today. That’s fine! All you need to do on Feb 1 is transfer some miles. You can book later. Do Aeroplan miles expire? That is a great question. Aeroplan miles do expire 18 months after you receive them, but only if you have zero activity on your Aeroplan account. Basically anything you do with Aeroplan resets the clock, including transferring more points. So if you’re worried about forgetting, you can add yourself to this calendar invite for July 2025, which will remind you to transfer the minimal amount of points to Aeroplan to delay expiration. Is NYC <> SFO the only good route to book? Nope! You can use this transfer bonus to book any of the awesome routes in the bonus snack below. If this article made you curious about the Bilt card, you can learn more in my review here. If you do end up getting it, I would appreciate you using my referral link. It gets me some extra points which I can use to power more issues of Shreycation! Apply for Bilt (Disclaimer: This post is not financial advice and you should do your own research to ensure this card is right for you. Applying will likely affect your credit score.) Bonus Snack: Air Canada vs. United You know how your Chipotle bowl costs 20% more because of inflation? Turns out points are affected by inflation too, and in summer 2023, United devalued their points program. Routes that may have cost just 35k United miles now cost upwards of 55k. This opens the field for other programs to offer some great deals. United MileagePlus used to be one of the most cost-effective ways to book many Star Alliance flights on points, but now Air Canada Aeroplan is eyeing that crown. Let’s analyze some of the most popular travel routes: Aeroplan outperforms in the vast majority of routes except for West Coast <> Europe. Especially great savings come from the short-haul North American routes, North America <> West/South Asia routes, and North America <> South America routes. We were unable to load this poll. Please refresh the page. Eagle-eyed readers will notice that Air Canada levies higher cash fees on their award flights. But don’t worry, the math is mathing. Let’s take North America <> East Asia for example: 50k miles + 77 CAD on Aeroplan vs. 55k miles + 6 USD on United. 77 CAD is about 56 USD, meaning there’s a difference of +50 USD and -5k miles between the two. 5k miles is worth just 50 USD only if you’re a points novice and value each mile at 1¢/point. But the whole point of Shreycation is to help you get way more value from your points than the default 1¢/point, so just by subscribing, you’re making those 5k miles worth way more than 50 USD! The math indeed maths. And if you’re wondering why the Delhi route is so cheap, it’s because Air Canada considers India part of the “Atlantic” region, along with all of Europe and Africa. Air Canada is filled with fun sweet spots like this that I’ll cover in depth in the future. Thanks for reading! Wielding the point-hacking force is a lot more fun with friends. Plus, if you refer 3 friends, I’ll send you my exclusive, comprehensive guide on stopover programs so you can hack multi-city trips. (And if you don’t know what stopovers are, boy are you missing out.) Refer a friend 5 Share",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/p/snacks-air-canada-bonus"
    },
    {
      "title": "Snacks: Alaska joins Bilt - by Shrey G - Shreycation",
      "content": "Discover more from Shreycation Time to level up your travel and points game. Tips, tricks, and hacks from a budding travel professional. Subscribe By subscribing, I agree to Substack's Terms of Use, and acknowledge its Information Collection Notice and Privacy Policy. Already have an account? Sign in Snacks: Alaska joins Bilt Also: half off London flights, check if you're flying Boeing, and more SHREY G MAR 20, 2024 3 Share Hi Shreycationers, It’s been a minute! Some awesome stuff coming soon, but for now, a nice ol’ bag of snacks. Alaska Airlines Joins Bilt Alaska Airlines has some of the best redemptions in the market, but they’ve always been so hard to claim since Alaska wasn’t a transfer partner of any major credit card. Read: if you want Alaska miles, you gotta fly Alaska. That changed last week, when Bilt signed on Alaska as a transfer partner. I swear, I’m not sponsored by Bilt but they do keep rolling out the hits. I’m actually surprised they managed to make this partnership work, but they also did manage to break through with American Airlines, and American + Alaska have their own partnership too now … maybe just a simple matter of 2 + 2. Alaska Airlines’ Mileage Plan program has a couple awesome attributes: You can book flights across all of oneworld (e.g. American, British Airways, Cathay Pacific, Japan Airlines, Qatar, Qantas, Iberia) AND their non-alliance partners (e.g. Korean Air, Singapore Airlines, LATAM). This list covers some of the best airlines in the world! You can book free stopovers even on one-way awards. If you don’t know what a stopover is, I’ve written extensively about them before — it’s your way to turn a single trip into multiple for free. Alaska Airlines Mileage Plan is one of the most popular ways to book premium cabins on Japan Airlines (credit: Prince of Travel) Here’s how you can use all this to your advantage. Let’s say you want to do a huge Asia trip. You can book NYC <> HKG (Hong Kong) with a stopover in Tokyo on the way there and another stopover in Singapore on the way back. This would usually cost you 152k miles if you booked every leg individually, but thanks to the free stopover policy, you only spend 108k miles. Valuing your miles at 2¢/point, that’s $880 saved on a 3 destination Asia trip. H/t to my buddy Sweyn for sending me this even before it came up on my news feed. Check if you’re on a Boeing plane Boeing has been in the news for all the wrong reasons lately. I won’t care to speculate on the causes here, but even though air travel remains remarkably safe, it’s understandable if you to avoid Boeing so you can sleep better on your flight. If you’ve got a flight coming up, you can check out amiflyingonaboeing.com, made by yours truly to quickly check what aircraft you’re flying on. 50% off London flights via Virgin Atlantic Virgin Atlantic has a 50% off deal on all award flights from the US to the UK ending midnight tonight! That means for a sample NYC <> LHR trip: economy roundtrips start from 10k miles (usually 20k) premium economy roundtrips start from 17.5k miles (usually 35k) business economy roundtrips start from 47.5k miles (usually 95k) Note that this only applies to flights on Virgin Atlantic itself, and must involve trips that complete before June 30. Now there is one somewhat unfortunate issue preventing this from being one of the greatest points deals this year. Virgin Atlantic charges fuel surcharges on award flights, meaning you can’t just focus on the miles cost. For example, a roundtrip starting May 10th requires 10k Virgin miles + $492, but the equivalent “Economy Classic” ticket would cost $667. That still values your miles at 1.75¢/point (($667 - $492) / 10000), but it’s not amazing. Premium economy gives you some better value, at 3.1¢/point (would usually cost $1773 in cash). Sample roundtrip for NYC <> LHR for May 10 - May 14 But there’s a hack. I won’t get into the weeds here, but often you can get cheaper fuel surcharges if you book two separate one-way tickets rather than one roundtrip. For example, here’s what happens if I book the same premium economy itinerary, but as two one ways. Outbound flight Return flight Note the points cost remains the same: 8.75k + 8.75k = 17.5k miles. But the fuel surcharge is cheaper; instead of $1227, it’s $453 + £394, which converts to $957. You save $270 literally by clicking some buttons differently. Wait I don’t have Virgin Atlantic miles though. Oh my friend, you most definitely do. Virgin Atlantic partners with every major card program, so transfer away. (If you ever forget who transfers to who, I’ve made a super nice diagram here.) What if I’m not ready to commit to a flight now? It’s inconvenient that this deal expires tonight. But you can always change your flight for $50. You can also cancel at least 24 hrs before the flight to get your miles and taxes back. Fuel surcharges should also be refunded in most cases. Use AirTags to save your bags One of my favorite travel hacks is sticking an AirTag in your luggage. There’s nothing like having peace of mind that your checked bags have truly made it onto the plane! And if something goes wrong, you have some reference of where your bag might be. Since chances are someone handling your bag has an iPhone, you can usually track your bag’s journey in granular detail. Also, as soon as you log onto inflight wifi with an iPhone, chances are some other iPhone user is sitting just above where your bag is in the cargo hold, and you can make sure your bag is happily enjoying its flight too 😄 AirTags are on discount right now too! AirTags usually cost $100 for a set of 4, but Amazon is selling them for $80 right now. Thanks for reading! I know I’ve been away for a while; I’ve been gearing up for a launch that’s very near and dear to my heart, and you’ll be hearing it first here. I’ve also got so many awesome in-depth articles planned for the coming weeks, including how to hack basic economy, the (only) hotel program that’s worth pursuing, and a framework on how to actually think about using your points. If you’re not subscribed yet, be sure to subscribe and share with a friend so you don’t miss out! Subscribe Bon Voyage, Shrey 3 Share",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/p/snacks-alaska-joins-bilt"
    },
    {
      "title": "Shreycation Snacks: earn free miles when shopping",
      "content": "Discover more from Shreycation Time to level up your travel and points game. Tips, tricks, and hacks from a budding travel professional. Subscribe By subscribing, I agree to Substack's Terms of Use, and acknowledge its Information Collection Notice and Privacy Policy. Already have an account? Sign in Snacks: earn free miles when shopping I flew NYC to SF for free and all I did was click a button SHREY G JAN 22, 2024 2 1 Share Hi y’all, Welcome to Shreycation Snacks. This isn’t a full feature Shreycation issue — it’s a bite-sized snack with tasty tips. Read it on the subway, read it during a boring Zoom call, read it on the toilet — you do you. (Don’t worry, Issue 3 still comes out this week.) Earn free miles on stuff you’re already buying Everyone shops online, but in 2024 it’s time to get rewarded for it. Virtually every major US airline and credit card program has its own shopping portal where you can earn free miles. It’s easy. Let’s say I need to get yet another one of my favorite pants from Theory. If you’ve read my previous issues, you can guess I’m a big United MileagePlus fan. Before I buy, I’ll log onto shopping.mileageplus.com first, look up Theory, and click the “Shop Now” button. I’ll then proceed to buy the pants using any credit card, and I’ll get a free 2x United miles for doing basically nothing, on top of whatever points I get on my credit card. Could not load video. Bam, that’s 400 free miles right there — same amount you’d get flying LAX to SFO. Sometimes these programs will run promos where you’ll earn more miles (like 5x+) at certain merchants. They also run bonuses where if you spend say, $150 across all merchants, you get a bonus 500 miles. Also if you’re ever in the market for one of those money-losing D2C subscription companies (Hello Fresh, Stitch Fix, etc.), they’ll give you hella bonus miles (like 1000+ miles). It adds up. I’ve been using these for a year and I’ve racked up about 20k miles; I recently used 15k for a last minute NYC-SFO flight that would have cost $400 otherwise. Links for portals (bookmark them!): American, United, Delta, Alaska, Southwest, JetBlue, Capital One, Citi, Chase. (Unfortunately Amex and Bilt don’t have portals.) Tips for success: Make sure to temporarily turn off your adblocker (cmd + period on Chrome for Mac) OR add the adblock filter list for your preferred shopping portal (e.g. here’s United’s). Sometimes you can download browser extensions that will pop up whenever you go on a site that earns miles. No need to go to the shopping portal! For example, here’s United’s. If you use Honey, you gotta disable it. No double dipping unfortunately. Make sure to complete your purchase in the tab that opens from the portal. If you shop via a credit card shopping portal, you’ll usually need to use one of their cards to get the points. For airlines shopping portals, anything works. Liked this snack? Give the gift of knowledge and share with a friend! I’ll be so elated :) Share Bonus snack: new Chase Sapphire lounge in LGA just dropped The lounge battles are heating up. Chase is officially pissed that Amex cornered the market with their Centurion lounges, and they’ve decided enough is enough. Last week, Chase finally opened their hotly-anticipated Sapphire Lounge in LGA terminal B, their third lounge after BOS and HKG (hong kong). The new LGA lounge is over 21800 sqft with plenty of little nooks for privacy, children’s play room, game room, and conference desks + phone booths. Also, they offer an upscale bar (with cocktails inspired by NYC’s own Apotheke and wine line from Parcelle), amazing food (both buffet + a la carte style), and complimentary mini-facials and skincare kits. For those who want extra style, they’ve got bookable private suites with caviar and wine service. The only issue is the lounge has no natural light or runway views, but it is very cozy. I haven’t had the pleasure of going yet, but here’s some pictures and videos from others: Pictures from ABC News, Upgraded Points, and The Points Guy. Video below is from my friend Riley! Could not load video. How to access: If you have the Chase Sapphire Reserve, you can visit for free whenever with 2 guests. If you have Priority Pass through some other card, you get 1 free visit per year but no free guests. Chase also has a JFK lounge opening tomorrow (!!) and is adding lounges in LAS, PHL, PHX, and SAN soon. If you haven’t subscribed yet, what are you waiting for? New longform issues and shortform snacks dropping weekly. Subscribe 2 1 Share",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/p/snacks-free-miles-shopping-portals"
    },
    {
      "title": "About - Shreycation",
      "content": "Subscribe Sign in Home Snacks Leaderboard Why subscribe? Subscribe to get full access to the newsletter and publication archives. Subscribe Stay up-to-date Never miss an update—every new post is sent directly to your email inbox. For a spam-free, ad-free reading experience, plus audio and community features, get the Substack app. Join the crew Be part of a community of people who share your interests. Participate in the comments section, or support this work with a subscription. To learn more about the tech platform that powers this publication, visit Substack.com. People Shrey G @SHREYCATION Follow © 2025 Shrey G Privacy ∙ Terms ∙ Collection notice Start writing Get the app Substack is the home for great culture",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/about"
    },
    {
      "title": "Archive - Shreycation",
      "content": "Subscribe Sign in Home Snacks Leaderboard Failed to load posts © 2025 Shrey G Privacy ∙ Terms ∙ Collection notice Start writing Get the app Substack is the home for great culture",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/archive"
    },
    {
      "title": "Robinhood's Latest Quest - by Shrey G - Shreycation",
      "content": "Robinhood's Latest Quest Is the new Gold credit card really a bullseye? SHREY G MAR 28, 2024 2 Share Hi Shreycationers, This week I was gonna talk about how to hack basic economy, but then Robinhood upended those plans when they dropped one of their biggest announcements in years: a 3% cash back credit card. Credit: Robinhood I mean she is truly a stunning card. But looks aren’t everything. Let’s dive in and see what this card is made of. (It’s made of 17 grams of stainless steel.) (Disclaimer: This post is not financial advice and you should do your own research to ensure the cards mentioned in this article are right for you. Applying will likely affect your credit score.) What’s great First things first, Robinhood’s done a great job stealing headlines with this card, and it’s not just all show. This is indeed a wonderfully designed card. A simple 3% cash back on everything Everyone’s talking about the flagship feature, the 3% cash back on everything. And with good reason: 3% is the highest base cash back rate across any card I’ve seen. There’s not much else to say here — it’s truly a great cash back rate with no hoops to jump through. There’s something refreshing about the simplicity here, and it’s especially great for beginners. But there’s other features that didn’t get as much attention and are also worth highlighting. No foreign transaction fees No foreign transaction fees means you can truly use this card to earn 3% on everything, including that shopping spree in Milan. Waiving foreign transaction fees used to limited to high annual fee cards, but recently low/no annual fee cards have been introducing it too, including the Apple Card and the Capital One Quicksilver. The Robinhood Gold card is by far the most versatile and valuable of these though. For those who don’t like to carry many cards, you can now ditch whatever low annual fee, no foreign transaction fee card you might have and get 3% on your abroad expenses instead. Spend using Virtual Cards This is actually the perk I’m most excited for with this card, because as far as I know, no other card on the market offers native virtual cards. Virtual cards let you hide your true credit card number when spending online, and allow you to set an expiry date and spending limit. The killer use case here is managing subscriptions: if you just want 1 month of Hulu to binge Shogun, you can load a virtual card with $8 and have it expire in a month. If you forget to cancel your subscription, it won’t matter; your payment method will be invalid by the month’s end anyway. Virtual card services like Privacy have existed for a while, but as third party services they’re not as convenient, and their free offerings aren’t as robust as what Robinhood seems to be providing here. Surprising amount of protections The Robinhood Gold card is part of the Visa Signature family, which comes with various optional benefits that credit card providers can activate. I’m happy to say Robinhood really went for extra credit here; this card is loaded with benefits, including: Purchase security: If you buy something nice and it gets lost or stolen in 90 days, you can get up to $1k back. Extended warranties: You can extend the warranty of new purchases by up to a year. Return protection: If you aren’t satisfied with a recent purchase and the store won’t take it back, you can get reimbursed up to $250. Trip cancellation protection: If you get injured before or during a trip, you can get up to $2k to cover nonrefundable arrangements. Auto rental collision damage waiver: You can skip the insurance at the rental car office when you use you card to rent. Many other low annual fee cards have some subset of these perks, but Robinhood is giving you basically everything. If you’ve got premium cards like an Amex platinum, you likely already have access to many of these perks (and with better limits), but this is still spectacular for what is effectively a starter card. The only notable perk that’s missing here is cell phone protection (get reimbursed if your phone is lost/stolen). 5% cash back when booking travel …but that travel has to be booked through Robinhood’s forthcoming travel portal. Now if you’ve used these travel portals through Chase or Amex or other cards, you know these portals aren’t that fun or convenient to use. Also, sometimes these portals don’t have the flights and hotels you’re interested in. Robinhood’s portal isn’t live so it’s hard to make judgements quite yet, but something tells me it won’t be groundbreaking here. 5% cash back has been emerging as a popular number for spend in travel portals, so this number isn’t as groundbreaking as the 3% cash back. You’ll earn the same with a Chase Freedom or a Capital One Quicksilver. But still, 5% is 5%, and it’s good to see Robinhood meeting the industry standard here. What’s not so great You need Robinhood Gold…and you need to maintain it The card’s $0 annual fee branding is a little bit misleading. In order to get the card, you’ll need to be a Robinhood Gold subscriber. But you also need to maintain Robinhood Gold to keep the card. This will be one of the first times I’ve seen a card’s good standing status tied to some external monthly subscription, and I’m not totally sure how this will work. If you decide not to pause your Robinhood Gold subscription for a month or two, do they close your credit card? Who knows. Fortunately, Robinhood Gold is only $5/month, and if you already invest with Robinhood, it’s a bit of a no brainer: you’ll get a free $1k in margin, lower margin interest rates, 5% on uninvested cash, and more. This card earns cash back, not points In the world of cash back cards, Robinhood’s 3% universal cash back might as well make it the new king. But cash back cards are the little league since they aren’t nearly as flexible or value as cards earning points. That’s because the value of cash back is fixed but the value of points is variable. 1¢ of cash back is 1¢ of cash back and will always be just 1¢ of cash back. But depending on your skill and luck, 1 point could be redeemed for anything from 1¢ to 10¢. That means a card that earns a standard 1x points on everything could be the equivalent of earning 1% to 10% cash back depending on how you use those points. Shreycation is all about helping you learn how to use your points well. With some basic knowledge, it’s pretty easy to achieve a rate of at least 2¢/point on virtually all of your award travel redemptions. That means a card like the Chase Freedom Unlimited that earns 1.5x points on everything nets me at least 3¢ per dollar I spend. On the other hand, the Robinhood Gold card also earns me 3¢ per dollar, but that’s a hard cap — it’ll only earn me 3¢ per dollar. Two ways you can spend $100. Obviously taking the cash back option for Chase isn’t the move, but transferring those points into say, United, could get you more value than the Robinhood card gives you. Especially if you use the Chase Freedom Unlimited on dining or drugstores. No sign up bonus or intro 0% APR The Robinhood Gold account comes with no sign up bonuses or introductory 0% APR rates whatsoever. For other cards in this category, there’s usually a ~$200 sign up bonus, and at least 1 year of 0% APR. If you intend on actively using this card for many years, the lack of a bonus might not be a huge issue today, but do note that it’ll take almost $7k in spending to match the free sign up bonus of its peers. The bigger issue is the lack of a 0% APR intro period. Right now, if you rack up a $10k balance on a card with 12 months of 0% APR, you can instead invest all that money in a high yield savings account and earn 5% over the course of the year. That’s basically the equivalent of a 5% cash back on everything. You’re forgoing that option if you choose to spend more on a Robinhood Gold card. A word of caution The card has some pretty awesome perks and a killer cash back earning structure today, but these aren’t necessarily guaranteed in the future, especially for younger companies like Robinhood. We’ve seen this in the past with cards like the Uber Visa Card, which used to give 4% on dining, 3% on travel, and 2% on Ubers — pretty awesome for a no annual fee card. But over time, the card kept getting nerfed and eventually became less and less compelling until it was finally shuttered. That’s not to say this will necessarily happen to the Robinhood card, but it’s good to know that this may not last in perpetuity. If you’re enjoying our breakdown of the Robinhood Gold card, subscribe for more! I’ll be writing about my favorite underrated cards and hacks to save you money. Subscribe Who should actually get this card? Beginners and people who don’t wanna deal with points. By itself, this card ticks a lot of boxes: great cash back on everything, solid protections, no transaction fees. This makes it an excellent card for beginners. I’ve waxed poetic about the value of points above, but if care more about simplicity, a card that gives 3% cash back without having to think about it is a pretty solid middle ground. And if you don’t travel much in the first place, you won’t be able to extract much of the value of your points anyway — cash back could be the better option. The Robinhood Gold card also effectively renders many other cash back cards obsolete, meaning you can double down on simplicity and get by with fewer cards. Most cash back fans can now get by with just two cards: (1) the Robinhood Gold, and (2) some card that earns 5% on seasonal categories (e.g. Chase Freedom Flex, Discover It). People who don’t have a great catch all card yet A key element of any good personal card portfolio is a “catch all” card that earns > 1% cash back or 1x points on non-category spend. In other words, it’s cool if you have swanky cards that earn 3% on travel and dining (“category spend”), but if you also drop $3000 a year on Rumble Boxing or have a crippling shopping addiction, it would be nice to earn boosted cash back here too. Catch all cards usually don’t have highly boosted cash back on special categories, but they do have slightly boosted cash back on everything. Up till now, 2% was about the best you could do for a catch all cash back card (RIP Citi Double Cash), but now Robinhood has blown this out of the water with its 3% and is the obvious choice. There’s one big caveat: if you have one of the premium travel cards — a Chase Sapphire, Amex Gold or Platinum, or a Capital One Venture — it might make sense to choose a card in those ecosystems as your catch all card. That’s a topic for another Shreycation issue, but generally you’ll get more value (and better purchase protections) on those cards than the Robinhood Gold. People who hate taxes but like math Death and taxes may be the only two things guaranteed in life, but the Robinhood card can help you reduce your annual subscription to Uncle Sam. The IRS lets you pay your outstanding taxes using a credit card. They’ll charge you 1.8% for this privilege, but if you’re using a card that gives you 3% cash back…you see where I’m going here. Courtesy of Robinhood, you can now enjoy a 1.2% discount on income taxes you pay directly. If most of your income comes from W-2 earnings, your employer is already withholding most of your income taxes for you and you’re likely not paying much on tax day, meaning this hack probably won’t be as useful. But if you have lots of 1099 earnings (e.g. from freelancing or side gigs), have high capital gains, or own a business and pay quarterly taxes, you’re usually paying a large chunk of your tax liability directly. By using the Robinhood Gold card to pay, you could keep hundreds of extra dollars in your pocket. We can go one step further for a really cheeky version of this hack. Since you’re paying taxes with a credit card, you have at least a whole month to pay down the balance while avoiding an interest charge. So maybe instead of paying down the card immediately, stick that tax money in a 5% APY high yield savings account for a month, and then pay your card. 5% APY earned for one month translates to a ~0.4% ROI, boosting your effective tax discount to 1.6%. You can also do this hack with the Paypal Mastercard (which gives you 3% cash back on Paypal transactions), but the Robinhood Gold card is a way more versatile card to have in your wallet. If you’ve decided the Robinhood Gold is the way to go for you, you can use the link below to add yourself to the waitlist. We’ve also got some alternative cards below that are worth your consideration! Sign up for the Robinhood Gold Waitlist Other cards that might be worth instead Chase Freedom Unlimited Credit: Fortune I’ve mentioned this card a few times in this article, but the Chase Freedom Unlimited is a very compelling alternative to the Robinhood Gold if you’ve already got a Chase Sapphire Preferred or Reserve. 1.5% cash back on everything…BUT if you have a Chase Sapphire card, you can opt to receive 1.5x points instead. And as we discussed above, 1.5 pts is easily worth at least 3¢. Also, 5x on travel booked through Chase Travel, 3x on dining, 3x on drugstores Many of the same protections as the Robinhood card, minus return protection. Sign up bonus of 20000 points and 15 months of 0% APR. No annual fee. Apply for a Chase Freedom Unlimited Wells Fargo Autograph Credit: Fortune Wells Fargo has really been stepping up its game lately and has started building their own points ecosystem with their own transfer partners. I’ll write more about it later, but their starter card is the Wells Fargo Autograph and its quite compelling. 3x points on many categories: dining, gas, travel, transit, streaming, and phone services. For some of you, this might be the majority of your spend (groceries and shopping are notably missing though). Sign up bonus of 20000 points and 12 months of 0% APR. Doesn’t have as many protections as the Robinhood Gold, but does offer cell phone protection. No annual fee. Apply for a Wells Fargo Autograph Thanks for reading! At the end of the day, Robinhood is selling simplicity, but credit cards don’t exist in a vacuum — they exist in your wallet with your other cards. I hope this article helped breakdown the Robinhood Gold card, and gives you a good sense of whether its right for you. As always, feel free to add questions in the comments, and share with a friend. Share Bon Voyage, Shrey 2 Share",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/i/143026629/this-card-earns-cash-back-not-points"
    },
    {
      "title": "How to get 10x the value from your points - by Shrey G",
      "content": "How to get 10x the value from your points SHREY G JAN 11, 2024 14 2 Share Hi! I'm Shrey, and I'm a software engineer turned travel advisor. Back in March 2020, the travel bug bit me hard at probably the worst possible time. While the rest of the world was in quarantine picking up new hobbies, baking sourdough, and doing TikTok dances, I spent all my free time reading about the one thing I couldn’t do at the time: travel. Over the past two years, I've traveled hundreds of thousands of miles and redeemed tens of thousands of dollars in free travel. There’s a pervasive myth that traveling the world on points requires seven-figure spending or constantly hopping coast to coast for some big consulting firm. That hasn’t been my experience: I rarely traveled for work as an engineer and I’d like to think I spend frugally, yet I’ve learned to make these credit card and frequent flyer programs work for me. There’s no shortage of travel hacking content online, but points are a chaotic, complex web of unintuitive axioms and odd stipulations. I’ve always found that you can’t actually get anywhere without reading dozens of articles, and even then, it feels like you’re trying to clear a forest with a butter knife. In this Substack, my goal is to cut through the noise and clear the path for you. You’ll learn hacks that you can apply today, and hopefully over time, you’ll also develop an intuition for hacking on your own too. Today we’re tackling transfer partners, one of the most important and high impact topics that will show you the path to doing tons of free flights. I imagine people are at very different levels of familiarity with transfer partners, so if you’re new, keep reading, and if you’re a seasoned veteran, feel free to scroll down a bit unless you want a refresher! For beginners: Why do Transfer Partners matter? If you’ve seen people zipping around on free business class flights, chances are they’re not just secretly point millionaires. Instead, they’re stretching their credit card points by transferring them into specific airline frequent flyer programs. The major credit card programs for travel are Amex, Chase, Citi, Capital One, and Bilt — I’ll call these the Big 5. Most travelers know that the Big 5 programs each have a travel portal where you can easily redeem your points on flights. The catch is this usually involves spending your points at a fixed rate of 1-1.5¢/point. That means if you want a $1000 flight, you’re could be burning as much as 100k points — that’s more than most credit card sign up bonuses, just for one flight! What savvy travelers know is the Big 5 also allow you to transfer your points to specific frequent flyer partners, and this is the key to unlocking their true value. This is because unlike the Big 5 travel portals, most frequent flyer programs don’t set a fixed exchange rate. This means your points could be worth way more when you transfer! You can routinely find redemptions of 2-3¢/point, and if you’re really skilled or lucky, I’ve seen killer redemptions as high as 12¢/point! That same $1000 flight could cost you as little as 8k points — you might earn that in just a single month of smart spending. My free birthday trip last year, sponsored by my points! Also got to enjoy United's Polaris lounges which come with a free table service restaurant. I could probably write a PhD thesis on transfer partners, but for now I’ll try and give you my best 10 minutes on the topic. Rules of the Game Getting high redemptions doesn’t come for free, and it does involve a bit of a learning curve. First, a few ground rules for working with points: Transfers are one way. Once you transfer points from a credit card program to a frequent flyer program, you can’t go back. Only transfer if (a) you have a redemption in mind and are about to book or (b) there’s a great transfer bonus (we’ll talk about this in future issues). You can’t just transfer to any program. Each of the big 5 credit card programs partners with specific frequent flyer programs. This is why it’s best to own cards across various programs. You usually can’t transfer points across frequent flyer programs. For example, a mile in United MileagePlus usually can’t be transferred to Air Canada Aeroplan. (There are a few limited exceptions, but I’ll cover those in future issues.) Transfers are usually 1:1 but not always. For example, you can convert 1 Chase point into 1 United mile. While the majority of transfer partners for the Big 5 are 1:1, some have slightly unequal ratios like 1:2 or 2:1.5 for some of the less commonly used partners. A motivating example: Let’s go to London in the spring! Now for some examples! Let’s say you want to take advantage of the shoulder season for London in April — it’s starting to warm up but you’re not paying peak season prices. If you have a Chase Sapphire or Bilt card, you can transfer your credit card points to United MileagePlus and book a United Polaris business class flight departing March 30th from EWR to LHR for 80k miles. Found on the United Airlines award search tool here; just select “Pay with Miles”. The actual flight would cost $1988 if we bought outright in cash according to Google Flights: That means we’re redeeming our points at a rate of roughly 2.48¢/point! Compare this the quote of 132487 points we get from the Chase portal: Since I have the Chase Sapphire Reserve, my Chase points redeem at a fixed rate of 1.5¢/point in their portal (a signature benefit of that card), but just by transferring into United instead, I squeeze out 65% more value from my points! If you want to go far, go together: The magic of airline alliances As I mentioned earlier, each of the Big 5 programs has a designated list of transfer partners. Here’s the list for Bilt for example: It’s perfectly normal to look at this list and think “I’ve never heard of half of these airlines, let alone flown them.” But you don’t actually need to fly these airlines to get tremendous value out of their frequent flyer programs. Let me explain. Most airlines are part of a major airline alliance. You’ve probably heard of them: Star Alliance (cofounded by United) Skyteam (cofounded by Delta) Oneworld (cofounded by American) When an airline join an alliance, they agree to allow other airlines in the alliance sell tickets on their flights, and in return they get to sell tickets on their partners flights. When you go on the United website and you see an option to buy a ticket that’s actually operated by Turkish Airlines, that’s why — both of them are in Star Alliance. Fortunately for us, this cross-selling phenomenon isn’t just limited to tickets bought in cash (“revenue tickets”, in point hacker parlance). It also applies to tickets bought on points (“award tickets”)! In other words, Turkish Airlines can let members of their frequent flyer program, Miles&Smiles, book award tickets on United flights using their Turkish Airlines miles. Similarly, United MileagePlus members can often book Turkish Airlines flights using their United miles. This opens up a whole glorious world of possibilities and points arbitrage. Each frequent flyer program uses a different method to calculate how many points a given flight should cost. Some look at the flight distance, some look at which regions the flight transits between, and others look at how much demand exists for that seat. This means you can sometimes find the exact same flight and cabin for fewer points in a partner program! So let’s go back to our example: EWR-LHR in business class on flight UA 110. If we check the Turkish Airlines award search, we can find that same exact seat for just 45k Turkish miles. That’s a whopping 4.97¢/point! Found on the Turkish Airlines award search tool here. (You will need to make a Turkish Airlines account to access this.) If you’ll recall, this same flight would have cost 80k United miles or just above 130k Chase points — we’ve literally gotten 2-3x the value just by going through a United partner. You may think “but wait, I don’t have any Turkish miles.” But if you have a Bilt card (or selected Citi or Capital One cards), your credit card points can transfer at a 1:1 ratio into Turkish Airlines Miles&Smiles. This is why these transferrable points programs are so powerful: you can use them to book flights in programs you don’t regular use. Now let’s say you only have an Amex. You wouldn’t be able to transfer to Turkish Airlines unfortunately, but there’s still a deal for you! Chances are you’ve never flown or even heard of Avianca, but all you need to know is they’re a Star Alliance partner too. And that same EWR-LHR United business class seat is still available for 60k Avianca Lifemiles. Not as amazing as the Turkish redemption, but still a nice discount from the United MileagePlus one! Found on the Avianca Lifemiles award search tool here. You will need to create a Lifemiles account to access. (As you can see, it does pay to have exposure to various Big 5 programs so you can always get the optimal redemption.) Knowing how alliances work can lead to tremendous savings and help us easily maximize our points. It’s not always easy to find these redemptions though, and exploring the whole web of airlines alliances can get complicated. That’s why point hacking is a skill, and it definitely takes practice to get better at it! In the “Advanced” section below, I share a few tips for finding these redemptions, and I’ll share more in future issues too. By the way, that March 30th EWR-LHR flight I’ve been using as my example? That’s a real flight with actual award availability as of 6am this morning. Good points deals often get snapped up fast, so take a look if you’re interested! Like what you see so far? Subscribe for the next free issue, coming out in 2 weeks! Subscribe Some notes on redemption rates Typically you’ll see the really mouthwatering redemptions (>= 5¢/pt) on premium cabins. However, you can still find nice economy redemptions at a rate of 2-3¢/pt! For instance, our example EWR-LHR flight costs $460 for economy and is also available for 20k Avianca Lifemiles; that’s 2.3¢/pt. I’ve talked a lot about how you can get > 1¢/point by transferring points. But since the redemption rate isn’t fixed in most frequent flyer programs, the opposite can also be true. Sometimes you may see terrible redemptions of 0.5¢/point, in which case you need to look elsewhere, book via the credit card portal, or maybe even just book on cash. How do I actually transfer points? Usually you can transfer points in your credit card’s rewards portal. Look for words like “transfer to partners”. From here, you’ll be asked to link your frequent flyer account — ensure that you’re entering your member number accurately! Once you’ve done that, you’ll be able to transfer points, usually in increments of 1000 points. For Chase, you can go to the Ultimate Rewards portal here and click “Transfer points to partners” under the “Travel” tab. For most partners, the transfer is nearly instant. Go make a coffee and your freshly transferred miles should be deposited in your frequent flyer account by the time you’re back. On some occasions though, the transfer can take longer. This can be a bit inconvenient if you’re booking a particularly popular award ticket that may run out of space; I’ll talk about how to get around this in a future issue. Does this mean I should never use my points my credit card’s travel portal? Nope! If you’re trying to save cash, ultimately free travel is free travel. You might not be maximizing your points, but that might not be what matters then. However, be careful not to exhaust all your points in the portal; missing a killer partner redemption because you’re out of points is quite painful. Many portals also offer a combo of cash + points payment option. This can help take the edge off a particularly pricey flight by letting you, in effect, set your own preferred discount using points. I recently did this for a last-minute domestic flight; flights were $200 more than usual, so I used 13,000 points to offset the increase. Additionally, by using the Chase portal with my Chase Sapphire Reserve, my points were valued 50% higher (1.5¢/pt), and I earned 5x points on the cash portion— not bad! We were unable to load this poll. Please refresh the page. For experts: Two of my favorite underrated transfer partners As experts, you’ve probably used your fair share of transfer partners and gotten some awesome redemptions. There’s a few programs I don’t think get enough love, and I figure I’d talk about them below and exactly how you can add them to your repertoire. Types of award space (For some of you, this may be review; I just want to make sure we have a shared vocabulary here!) Not all award space is created equally. Usually when an airlines releases award tickets for a given flight, they release it into 4 buckets: Airline saver space Non-saver space Partner saver space Airline saver space is a special promotional rate offered for award tickets. If you can snag one of these rates, you know you’re getting the best points rate that program can offer. Often airlines will have a fixed rate for saver space (e.g. “one way US-Europe economy = 20k”), but unfortunately many US-based airlines have dynamic rates even for saver space. There’s very limited seats available in this bucket, and once it’s exhausted, you’re just left with non-saver space. Non-saver space is usually much pricier (think ~2x the cost), and is more likely to be dynamically priced based on demand (read: you’re not gonna get a stellar redemption rate here). Non-saver space can still be worth booking though if the cash fare for the flight is super expensive. Finally the partner saver space bucket is similar to airline saver space, but allocated for the airlines’ partners instead. The partner program is allowed to choose whatever pricing strategy they want for these seats, and often, the best deals come from partners that price their partner saver space cheaper than the airlines’ own saver space. One catch: the amount of partner saver seats is less than the amount of airline saver space, so if you find one, you better book fast. Turkish Airlines Miles&Smiles for domestic coast-to-coast trips on United The Sweet Spot Yes, weirdly enough the cheapest way to fly across the USA on points is through a non-US based airline! The Miles&Smiles program uses a region-based award chart where the point cost of a flight depends on your start and end region. Generally most programs using such charts tend to split the US into an East and a West region, which bumps up the cost of flying cross country. Fortunately, Turkish Airlines has a sweet spot here: flights within a single country count as flying within a single region, regardless of the size of the country. If we reference their award charts, we can see the saver (“promotional”) award ticket rate for domestic/intracountry flights is just: Economy one way for 7.5k miles Business one way for 12.5k miles (Turkish is in Star Alliance, so these flights are actually just United flights being cross-sold by Turkish.) This is such a ridiculously low cost award that has managed to stay under the radar for quite a while now. But there’s a good reason for that: for the longest time, the only way to transfer to Turkish was through Citi or Capital One, which aren’t as popular. But that’s all changed with the Bilt card; it’s one of the fastest growing cards in America, and they have recently become the 3rd transfer partner for Turkish. Now these deals are way more accessible to travelers! Finding Award Availability Unlike other airlines, Turkish Airlines unfortunately doesn’t let you see a calendar of available dates, which makes finding award availability hard. However, we can use a little trick: we can use a different Star Alliance partner with a better award search tool to find the available dates, and then pop those dates into the Turkish award search and book from there. This works because all Star Alliance partners will have access to the same partner saver space; it’s just a matter of finding it. Air Canada Aeroplan is known for having a really great award search tool for Star Alliance partner space, so we can just pop in our origin + destination city here and some rough idea of a date we want to travel on. Once you sign into your Aeroplan account, you’ll be able to see a 5 day availability calendar at the top. Generally you’re looking for anything that is priced low (like 15k miles or less), and on United metal — chances are that’s partner saver space. Let’s look for NYC > SFO for Feb 13 (perfect V-Day timing for all the cross-country long distance couples!). Found on the Air Canada Aeroplan award search tool here. Make sure to check the “Book with Aeroplan” box and make an Aeroplan account to see the calendar. According to the calendar at the top, we could also book on Feb 12 or Feb 14, but not Feb 11. Now that we’ve identified a date that has partner saver space, we can head back to Turkish and search there: And voila! We found Turkish partner saver space for this domestic United flight, and its just 7.5k Turkish miles compared to 12.5k Air Canada miles! One caveat: before you get too excited about the 12.5k mile domestic business class redemptions, I should say that it’s very very hard to find award availability for this one. I’ve never succeeded on it personally, and if you find it, you might wanna buy a lottery ticket. The economy tickets are usually very doable though. Air France/KLM Flying Blue for insanely cheap trips to Europe This one isn’t that underrated, and is actually one of the more popular redemptions for people who are getting started in the points game. It doesn’t hurt that Flying Blue is a transfer partner for each of the Big 5 credit card programs too! The reason I’ve still listed it here is many people tend to consider Flying Blue as just a good way to book Delta awards if you don’t have an Amex, but they’re missing the best part: Flying Blue promo rates. Every month, Flying Blue releases a new set of cities that they offer promotional pricing on (usually 25% off their regular partner saver rates). As long as you fly between any country in Europe and these cities, you’re eligible for the discounted pricing (while seats last of course). The discounted pricing is in effect for trips within 6 months of the current month, so the January promos are in effect for trips till June 30. Unfortunately there’s no US-based cities on this list for January, but in December, you could have booked flights from the following cities for a discount: Washington D.C. to Europe from 15k miles (25% off) Boston to Europe from 15k miles (25% off) This month there are lots of Canadian cities on the list though (Toronto, Montreal, Ottowa), so for my Canadian friends out there, it’s your time to shine! You can always see the list of cities here under “Long-Haul Flights” (I suggest bookmarking this link!) Let’s check out an example. Let’s say you’re looking to do V-Day in the city of love, Paris. We can pop in Toronto for the origin and Paris for the destination, and select Business. Seems there’s some partner saver space for Feb 13! You can tell because the button is in green; non-saver space is shown in blue. 50k ain’t bad for Air France business class! You will need to pay a bit of a higher fee here (220 euros), but this flight is going for $5526 right now, so you’re getting an insane 10.5¢/pt redemption here. What a steal for V-day in Paris. (Pro tip: You don’t have to reside in Toronto to take this flight…there’s dozens of NYC <> YYZ flights every day, and you could just book a cheap one like the one below, chill in the Air Canada lounge for free with your business class ticket, and hop over to Paris from there.) There’s so many more underrated transfer partners I could include, but this issue is getting kinda long, so I’ll throw ‘em in a future issue! We were unable to load this poll. Please refresh the page. Deals and Other Awesome Stuff Bilt Dining has 100 restaurants participating in NYC Restaurant Week! You’ll earn extra Bilt points on these restaurants, even if you don’t use your Bilt card (just make sure to register your other card in the Bilt wallet). Plus you can register any Mastercard here (including your Bilt one) to get $10 in statement credits per restaurant, up to $30. You can check your Bilt app for the full 100 restaurant list. Chase Offers has a few cool promos running (may vary by card). Be sure to activate them in the Chase app! Here’s a few on the Chase Sapphire Reserve: 10% cash back on Liquid IV and McDonald’s for your next drunk night out wholesome night in. 10% back on various hotel chains, including Intercontinental, Crowne Plaza, Le Meridien, Kimpton, Hyatt Place, and Holiday Inn. $10 cash back on Turbotax: file your taxes early and feel like a true adult Since I’m a travel advisor working under a licensed travel agency, I can get you access to perks and rates that aren’t publicly available when you book through me. Virtually all of these options include free perks like buffet breakfast for 2, $100 hotel credit, and room upgrades! Here’s a few of the coolest ones: Park Hyatt Bangkok: Stay 3 nights, pay for 2 on stays till March 31. Also, stay 2 nights, pay for just 1 for specialty suites (with same perks) Andaz 5th Avenue (NYC): Stay 4 nights, pay for 3 on stays till March 31 (includes perks like free breakfast, $100 hotel credit, and room upgrade). The Andaz is one of my personal favorite hotels in NY! Thompson Denver: Stay 3 nights, pay for 2 for stays till March 10. Those of you going for a *cough* certain digital asset conference *cough* might find this one useful! (I’ve stayed there personally too for that same conference in the past) Grand Hyatt Playa del Carmen Resort: Stay 3 nights, pay for 2 for stays till June 30. Also, you’ll get an extra $50 to spend at the spa (on top of the $100 hotel credit). If you’re staying at a Kimpton hotel this month or next, say “Chalet All Day” to the front desk. You’ll be glad you did! Thanks for making it this far and I hope you’re enjoyed this first issue! It’s my first time doing anything like this, and I’d really appreciate your thoughts and feedback in my Google form here! Bon Voyage, Shrey Thanks for reading Shreycation! Subscribe for free to receive new posts and support my work. Subscribe 14 2 Share",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/i/140407300/air-franceklm-flying-blue-for-insanely-cheap-trips-to-europe"
    },
    {
      "title": "How to get 10x the value from your points - by Shrey G",
      "content": "How to get 10x the value from your points SHREY G JAN 11, 2024 14 2 Share Hi! I'm Shrey, and I'm a software engineer turned travel advisor. Back in March 2020, the travel bug bit me hard at probably the worst possible time. While the rest of the world was in quarantine picking up new hobbies, baking sourdough, and doing TikTok dances, I spent all my free time reading about the one thing I couldn’t do at the time: travel. Over the past two years, I've traveled hundreds of thousands of miles and redeemed tens of thousands of dollars in free travel. There’s a pervasive myth that traveling the world on points requires seven-figure spending or constantly hopping coast to coast for some big consulting firm. That hasn’t been my experience: I rarely traveled for work as an engineer and I’d like to think I spend frugally, yet I’ve learned to make these credit card and frequent flyer programs work for me. There’s no shortage of travel hacking content online, but points are a chaotic, complex web of unintuitive axioms and odd stipulations. I’ve always found that you can’t actually get anywhere without reading dozens of articles, and even then, it feels like you’re trying to clear a forest with a butter knife. In this Substack, my goal is to cut through the noise and clear the path for you. You’ll learn hacks that you can apply today, and hopefully over time, you’ll also develop an intuition for hacking on your own too. Today we’re tackling transfer partners, one of the most important and high impact topics that will show you the path to doing tons of free flights. I imagine people are at very different levels of familiarity with transfer partners, so if you’re new, keep reading, and if you’re a seasoned veteran, feel free to scroll down a bit unless you want a refresher! For beginners: Why do Transfer Partners matter? If you’ve seen people zipping around on free business class flights, chances are they’re not just secretly point millionaires. Instead, they’re stretching their credit card points by transferring them into specific airline frequent flyer programs. The major credit card programs for travel are Amex, Chase, Citi, Capital One, and Bilt — I’ll call these the Big 5. Most travelers know that the Big 5 programs each have a travel portal where you can easily redeem your points on flights. The catch is this usually involves spending your points at a fixed rate of 1-1.5¢/point. That means if you want a $1000 flight, you’re could be burning as much as 100k points — that’s more than most credit card sign up bonuses, just for one flight! What savvy travelers know is the Big 5 also allow you to transfer your points to specific frequent flyer partners, and this is the key to unlocking their true value. This is because unlike the Big 5 travel portals, most frequent flyer programs don’t set a fixed exchange rate. This means your points could be worth way more when you transfer! You can routinely find redemptions of 2-3¢/point, and if you’re really skilled or lucky, I’ve seen killer redemptions as high as 12¢/point! That same $1000 flight could cost you as little as 8k points — you might earn that in just a single month of smart spending. My free birthday trip last year, sponsored by my points! Also got to enjoy United's Polaris lounges which come with a free table service restaurant. I could probably write a PhD thesis on transfer partners, but for now I’ll try and give you my best 10 minutes on the topic. Rules of the Game Getting high redemptions doesn’t come for free, and it does involve a bit of a learning curve. First, a few ground rules for working with points: Transfers are one way. Once you transfer points from a credit card program to a frequent flyer program, you can’t go back. Only transfer if (a) you have a redemption in mind and are about to book or (b) there’s a great transfer bonus (we’ll talk about this in future issues). You can’t just transfer to any program. Each of the big 5 credit card programs partners with specific frequent flyer programs. This is why it’s best to own cards across various programs. You usually can’t transfer points across frequent flyer programs. For example, a mile in United MileagePlus usually can’t be transferred to Air Canada Aeroplan. (There are a few limited exceptions, but I’ll cover those in future issues.) Transfers are usually 1:1 but not always. For example, you can convert 1 Chase point into 1 United mile. While the majority of transfer partners for the Big 5 are 1:1, some have slightly unequal ratios like 1:2 or 2:1.5 for some of the less commonly used partners. A motivating example: Let’s go to London in the spring! Now for some examples! Let’s say you want to take advantage of the shoulder season for London in April — it’s starting to warm up but you’re not paying peak season prices. If you have a Chase Sapphire or Bilt card, you can transfer your credit card points to United MileagePlus and book a United Polaris business class flight departing March 30th from EWR to LHR for 80k miles. Found on the United Airlines award search tool here; just select “Pay with Miles”. The actual flight would cost $1988 if we bought outright in cash according to Google Flights: That means we’re redeeming our points at a rate of roughly 2.48¢/point! Compare this the quote of 132487 points we get from the Chase portal: Since I have the Chase Sapphire Reserve, my Chase points redeem at a fixed rate of 1.5¢/point in their portal (a signature benefit of that card), but just by transferring into United instead, I squeeze out 65% more value from my points! If you want to go far, go together: The magic of airline alliances As I mentioned earlier, each of the Big 5 programs has a designated list of transfer partners. Here’s the list for Bilt for example: It’s perfectly normal to look at this list and think “I’ve never heard of half of these airlines, let alone flown them.” But you don’t actually need to fly these airlines to get tremendous value out of their frequent flyer programs. Let me explain. Most airlines are part of a major airline alliance. You’ve probably heard of them: Star Alliance (cofounded by United) Skyteam (cofounded by Delta) Oneworld (cofounded by American) When an airline join an alliance, they agree to allow other airlines in the alliance sell tickets on their flights, and in return they get to sell tickets on their partners flights. When you go on the United website and you see an option to buy a ticket that’s actually operated by Turkish Airlines, that’s why — both of them are in Star Alliance. Fortunately for us, this cross-selling phenomenon isn’t just limited to tickets bought in cash (“revenue tickets”, in point hacker parlance). It also applies to tickets bought on points (“award tickets”)! In other words, Turkish Airlines can let members of their frequent flyer program, Miles&Smiles, book award tickets on United flights using their Turkish Airlines miles. Similarly, United MileagePlus members can often book Turkish Airlines flights using their United miles. This opens up a whole glorious world of possibilities and points arbitrage. Each frequent flyer program uses a different method to calculate how many points a given flight should cost. Some look at the flight distance, some look at which regions the flight transits between, and others look at how much demand exists for that seat. This means you can sometimes find the exact same flight and cabin for fewer points in a partner program! So let’s go back to our example: EWR-LHR in business class on flight UA 110. If we check the Turkish Airlines award search, we can find that same exact seat for just 45k Turkish miles. That’s a whopping 4.97¢/point! Found on the Turkish Airlines award search tool here. (You will need to make a Turkish Airlines account to access this.) If you’ll recall, this same flight would have cost 80k United miles or just above 130k Chase points — we’ve literally gotten 2-3x the value just by going through a United partner. You may think “but wait, I don’t have any Turkish miles.” But if you have a Bilt card (or selected Citi or Capital One cards), your credit card points can transfer at a 1:1 ratio into Turkish Airlines Miles&Smiles. This is why these transferrable points programs are so powerful: you can use them to book flights in programs you don’t regular use. Now let’s say you only have an Amex. You wouldn’t be able to transfer to Turkish Airlines unfortunately, but there’s still a deal for you! Chances are you’ve never flown or even heard of Avianca, but all you need to know is they’re a Star Alliance partner too. And that same EWR-LHR United business class seat is still available for 60k Avianca Lifemiles. Not as amazing as the Turkish redemption, but still a nice discount from the United MileagePlus one! Found on the Avianca Lifemiles award search tool here. You will need to create a Lifemiles account to access. (As you can see, it does pay to have exposure to various Big 5 programs so you can always get the optimal redemption.) Knowing how alliances work can lead to tremendous savings and help us easily maximize our points. It’s not always easy to find these redemptions though, and exploring the whole web of airlines alliances can get complicated. That’s why point hacking is a skill, and it definitely takes practice to get better at it! In the “Advanced” section below, I share a few tips for finding these redemptions, and I’ll share more in future issues too. By the way, that March 30th EWR-LHR flight I’ve been using as my example? That’s a real flight with actual award availability as of 6am this morning. Good points deals often get snapped up fast, so take a look if you’re interested! Like what you see so far? Subscribe for the next free issue, coming out in 2 weeks! Subscribe Some notes on redemption rates Typically you’ll see the really mouthwatering redemptions (>= 5¢/pt) on premium cabins. However, you can still find nice economy redemptions at a rate of 2-3¢/pt! For instance, our example EWR-LHR flight costs $460 for economy and is also available for 20k Avianca Lifemiles; that’s 2.3¢/pt. I’ve talked a lot about how you can get > 1¢/point by transferring points. But since the redemption rate isn’t fixed in most frequent flyer programs, the opposite can also be true. Sometimes you may see terrible redemptions of 0.5¢/point, in which case you need to look elsewhere, book via the credit card portal, or maybe even just book on cash. How do I actually transfer points? Usually you can transfer points in your credit card’s rewards portal. Look for words like “transfer to partners”. From here, you’ll be asked to link your frequent flyer account — ensure that you’re entering your member number accurately! Once you’ve done that, you’ll be able to transfer points, usually in increments of 1000 points. For Chase, you can go to the Ultimate Rewards portal here and click “Transfer points to partners” under the “Travel” tab. For most partners, the transfer is nearly instant. Go make a coffee and your freshly transferred miles should be deposited in your frequent flyer account by the time you’re back. On some occasions though, the transfer can take longer. This can be a bit inconvenient if you’re booking a particularly popular award ticket that may run out of space; I’ll talk about how to get around this in a future issue. Does this mean I should never use my points my credit card’s travel portal? Nope! If you’re trying to save cash, ultimately free travel is free travel. You might not be maximizing your points, but that might not be what matters then. However, be careful not to exhaust all your points in the portal; missing a killer partner redemption because you’re out of points is quite painful. Many portals also offer a combo of cash + points payment option. This can help take the edge off a particularly pricey flight by letting you, in effect, set your own preferred discount using points. I recently did this for a last-minute domestic flight; flights were $200 more than usual, so I used 13,000 points to offset the increase. Additionally, by using the Chase portal with my Chase Sapphire Reserve, my points were valued 50% higher (1.5¢/pt), and I earned 5x points on the cash portion— not bad! We were unable to load this poll. Please refresh the page. For experts: Two of my favorite underrated transfer partners As experts, you’ve probably used your fair share of transfer partners and gotten some awesome redemptions. There’s a few programs I don’t think get enough love, and I figure I’d talk about them below and exactly how you can add them to your repertoire. Types of award space (For some of you, this may be review; I just want to make sure we have a shared vocabulary here!) Not all award space is created equally. Usually when an airlines releases award tickets for a given flight, they release it into 4 buckets: Airline saver space Non-saver space Partner saver space Airline saver space is a special promotional rate offered for award tickets. If you can snag one of these rates, you know you’re getting the best points rate that program can offer. Often airlines will have a fixed rate for saver space (e.g. “one way US-Europe economy = 20k”), but unfortunately many US-based airlines have dynamic rates even for saver space. There’s very limited seats available in this bucket, and once it’s exhausted, you’re just left with non-saver space. Non-saver space is usually much pricier (think ~2x the cost), and is more likely to be dynamically priced based on demand (read: you’re not gonna get a stellar redemption rate here). Non-saver space can still be worth booking though if the cash fare for the flight is super expensive. Finally the partner saver space bucket is similar to airline saver space, but allocated for the airlines’ partners instead. The partner program is allowed to choose whatever pricing strategy they want for these seats, and often, the best deals come from partners that price their partner saver space cheaper than the airlines’ own saver space. One catch: the amount of partner saver seats is less than the amount of airline saver space, so if you find one, you better book fast. Turkish Airlines Miles&Smiles for domestic coast-to-coast trips on United The Sweet Spot Yes, weirdly enough the cheapest way to fly across the USA on points is through a non-US based airline! The Miles&Smiles program uses a region-based award chart where the point cost of a flight depends on your start and end region. Generally most programs using such charts tend to split the US into an East and a West region, which bumps up the cost of flying cross country. Fortunately, Turkish Airlines has a sweet spot here: flights within a single country count as flying within a single region, regardless of the size of the country. If we reference their award charts, we can see the saver (“promotional”) award ticket rate for domestic/intracountry flights is just: Economy one way for 7.5k miles Business one way for 12.5k miles (Turkish is in Star Alliance, so these flights are actually just United flights being cross-sold by Turkish.) This is such a ridiculously low cost award that has managed to stay under the radar for quite a while now. But there’s a good reason for that: for the longest time, the only way to transfer to Turkish was through Citi or Capital One, which aren’t as popular. But that’s all changed with the Bilt card; it’s one of the fastest growing cards in America, and they have recently become the 3rd transfer partner for Turkish. Now these deals are way more accessible to travelers! Finding Award Availability Unlike other airlines, Turkish Airlines unfortunately doesn’t let you see a calendar of available dates, which makes finding award availability hard. However, we can use a little trick: we can use a different Star Alliance partner with a better award search tool to find the available dates, and then pop those dates into the Turkish award search and book from there. This works because all Star Alliance partners will have access to the same partner saver space; it’s just a matter of finding it. Air Canada Aeroplan is known for having a really great award search tool for Star Alliance partner space, so we can just pop in our origin + destination city here and some rough idea of a date we want to travel on. Once you sign into your Aeroplan account, you’ll be able to see a 5 day availability calendar at the top. Generally you’re looking for anything that is priced low (like 15k miles or less), and on United metal — chances are that’s partner saver space. Let’s look for NYC > SFO for Feb 13 (perfect V-Day timing for all the cross-country long distance couples!). Found on the Air Canada Aeroplan award search tool here. Make sure to check the “Book with Aeroplan” box and make an Aeroplan account to see the calendar. According to the calendar at the top, we could also book on Feb 12 or Feb 14, but not Feb 11. Now that we’ve identified a date that has partner saver space, we can head back to Turkish and search there: And voila! We found Turkish partner saver space for this domestic United flight, and its just 7.5k Turkish miles compared to 12.5k Air Canada miles! One caveat: before you get too excited about the 12.5k mile domestic business class redemptions, I should say that it’s very very hard to find award availability for this one. I’ve never succeeded on it personally, and if you find it, you might wanna buy a lottery ticket. The economy tickets are usually very doable though. Air France/KLM Flying Blue for insanely cheap trips to Europe This one isn’t that underrated, and is actually one of the more popular redemptions for people who are getting started in the points game. It doesn’t hurt that Flying Blue is a transfer partner for each of the Big 5 credit card programs too! The reason I’ve still listed it here is many people tend to consider Flying Blue as just a good way to book Delta awards if you don’t have an Amex, but they’re missing the best part: Flying Blue promo rates. Every month, Flying Blue releases a new set of cities that they offer promotional pricing on (usually 25% off their regular partner saver rates). As long as you fly between any country in Europe and these cities, you’re eligible for the discounted pricing (while seats last of course). The discounted pricing is in effect for trips within 6 months of the current month, so the January promos are in effect for trips till June 30. Unfortunately there’s no US-based cities on this list for January, but in December, you could have booked flights from the following cities for a discount: Washington D.C. to Europe from 15k miles (25% off) Boston to Europe from 15k miles (25% off) This month there are lots of Canadian cities on the list though (Toronto, Montreal, Ottowa), so for my Canadian friends out there, it’s your time to shine! You can always see the list of cities here under “Long-Haul Flights” (I suggest bookmarking this link!) Let’s check out an example. Let’s say you’re looking to do V-Day in the city of love, Paris. We can pop in Toronto for the origin and Paris for the destination, and select Business. Seems there’s some partner saver space for Feb 13! You can tell because the button is in green; non-saver space is shown in blue. 50k ain’t bad for Air France business class! You will need to pay a bit of a higher fee here (220 euros), but this flight is going for $5526 right now, so you’re getting an insane 10.5¢/pt redemption here. What a steal for V-day in Paris. (Pro tip: You don’t have to reside in Toronto to take this flight…there’s dozens of NYC <> YYZ flights every day, and you could just book a cheap one like the one below, chill in the Air Canada lounge for free with your business class ticket, and hop over to Paris from there.) There’s so many more underrated transfer partners I could include, but this issue is getting kinda long, so I’ll throw ‘em in a future issue! We were unable to load this poll. Please refresh the page. Deals and Other Awesome Stuff Bilt Dining has 100 restaurants participating in NYC Restaurant Week! You’ll earn extra Bilt points on these restaurants, even if you don’t use your Bilt card (just make sure to register your other card in the Bilt wallet). Plus you can register any Mastercard here (including your Bilt one) to get $10 in statement credits per restaurant, up to $30. You can check your Bilt app for the full 100 restaurant list. Chase Offers has a few cool promos running (may vary by card). Be sure to activate them in the Chase app! Here’s a few on the Chase Sapphire Reserve: 10% cash back on Liquid IV and McDonald’s for your next drunk night out wholesome night in. 10% back on various hotel chains, including Intercontinental, Crowne Plaza, Le Meridien, Kimpton, Hyatt Place, and Holiday Inn. $10 cash back on Turbotax: file your taxes early and feel like a true adult Since I’m a travel advisor working under a licensed travel agency, I can get you access to perks and rates that aren’t publicly available when you book through me. Virtually all of these options include free perks like buffet breakfast for 2, $100 hotel credit, and room upgrades! Here’s a few of the coolest ones: Park Hyatt Bangkok: Stay 3 nights, pay for 2 on stays till March 31. Also, stay 2 nights, pay for just 1 for specialty suites (with same perks) Andaz 5th Avenue (NYC): Stay 4 nights, pay for 3 on stays till March 31 (includes perks like free breakfast, $100 hotel credit, and room upgrade). The Andaz is one of my personal favorite hotels in NY! Thompson Denver: Stay 3 nights, pay for 2 for stays till March 10. Those of you going for a *cough* certain digital asset conference *cough* might find this one useful! (I’ve stayed there personally too for that same conference in the past) Grand Hyatt Playa del Carmen Resort: Stay 3 nights, pay for 2 for stays till June 30. Also, you’ll get an extra $50 to spend at the spa (on top of the $100 hotel credit). If you’re staying at a Kimpton hotel this month or next, say “Chalet All Day” to the front desk. You’ll be glad you did! Thanks for making it this far and I hope you’re enjoyed this first issue! It’s my first time doing anything like this, and I’d really appreciate your thoughts and feedback in my Google form here! Bon Voyage, Shrey Thanks for reading Shreycation! Subscribe for free to receive new posts and support my work. Subscribe 14 2 Share",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/i/140407300/turkish-airlines-miles-and-smiles-for-domestic-coast-to-coast-trips-on-united"
    },
    {
      "title": "Why you need a Bilt card in your wallet - by Shrey G",
      "content": "Why you need a Bilt card in your wallet SHREY G JAN 17, 2024 6 1 Share One of the biggest questions I’ve gotten this past year is what in the **** is a Bilt card? It’s a justified question: their ads are everywhere from airports to subways, and they’ve quickly become one of the hottest credit cards on the market. In my opinion they very much deserve the hype. I was a skeptic when I first heard of the card, but their team continues to deliver tremendous value. Here’s a few reasons why Bilt has quickly reached the top of my card stack. Points on Rent The marquee benefit of Bilt is the ability to earn 1x points on rent without paying the credit card transaction fees. Technically, you can earn 1x points on rent on many other cards too (rent would just fall in the “other” purchases category) but you’d have to pay a ~3% transaction fee, which wouldn’t be worth it in most cases. Bilt lets you bypass those fees and feasibly earn points on your rent. If you’re living in a typical US metro area, you’ll easily earn tens of thousands of free points per year this way! Given this is the only card product on the market that does this, it’s natural to have some questions: “So wait are they just fronting the transaction fee?”: Nope, Bilt spins up a special bank account that has your rent preloaded, and you use that to pay for your rent instead of your personal bank account. Your online rent payment portal will omit the standard credit card fee since you’re technically paying via bank transfer, and Bilt will charge you for the debited amount. “What if I don’t have an online rent portal?”: Bilt can send a check, PayPal, or Venmo to your landlord. This requires a bit of one-time setup, but you’ll earn points all the same. They don’t support Zelle yet unfortunately. “What if I Venmo my share of the rent to my roommate? How about subletting?”: Bilt can handle this too. You can set your special Bilt bank account as a payment option in Venmo and use that to pay your roommate. Bilt may ask for lease verification if you go this route though, which means YMMV for sublet situations. “Any catch?”: You need to use your Bilt card 5x a month to earn points on rent, but that’s about it! As you’ll see below, you’ll want to use it way more than that anyway. The card isn’t just a one trick pony, and you’ll also earn 3x points on dining and 2x on travel. The dining multiplier rivals the best cards on the market, but that travel multiplier is middle of pack; I’d use other premium travel cards like the Amex Platinum card to book travel if you have them. Surprisingly Good Transfer Partners Cool, so you can earn points on rent, but that’s only worth something if the points are useful. As we discussed in Issue 1, points are only as good as their transfer partners, and honestly, I’ve been shocked by how good the list is for Bilt: That’s a pretty impressive list. Here’s some highlights: Bilt is the ONLY card program that transfers to American. Oneworld loyalists rejoice! Also, American has been putting up some impressively cheap award tickets for Asia travel lately, but more on that in a future issue. Bilt also covers United, which makes them the only card program that partners with 2 major US airlines. If you’re also sitting on an Amex, note that this gives you direct point transfers to the full US trifecta: United, American, and Delta. I’ve written about Air France/KLM before, and it’s a fantastic program for dirt cheap Europe trips. Air Canada, British Airways, Virgin Atlantic are also fantastic for a whole variety of partner awards, and I’ll certainly write about them soon. Most major card programs are partnered with these four airlines though, so this isn’t a unique benefit. Turkish Airlines and Avianca are stellar options for rare but super high value redemptions within Star Alliance. If you’re curious, you can learn how I saved 70k-90k points using these programs for an EWR-LHR trip, and how I used Turkish to fly cross country for a mere 7.5k miles. Turkish isn’t partnered with Amex or Chase, and Avianca isn’t partnered with Chase, so if you’re holding these cards, Bilt helps round out your transfer partner portfolio. Honestly, their BizDev team must be doing the most. I’ve personally been very invested in the Chase ecosystem, yet I’ve found myself spending more on Bilt lately because Bilt has access to killer partners I just don’t have on Chase. Learning something from this post? Subscribe for more weekly travel tips and tricks! Subscribe Rent Day Promotions Paying your landlord isn’t typically something to celebrate, but Bilt makes the first of the month a little sweeter with their “Rent Day” bonuses. Every Rent Day, Bilt provides some wildly good deal or transfer bonus or status trial that’s usually hard or even impossible to find otherwise. Here’s some examples from the past: Up to 150% transfer bonuses for frequent flyer programs like Air France/KML Flying Blue, Emirates Skywards, and Virgin Atlantic Flying Club. Up to 18x on restaurants partnered with Bilt (more on that below). Complimentary United Silver or Gold status for 120 days, with the potential to retain it for a full year. 90 day free trial of World of Hyatt Explorist status, Hyatt’s 2nd best status tier providing complimentary room upgrades and late checkouts. Transfer bonuses of 150% are absolutely unprecedented in the points world; usually people would rejoice over a 30% transfer bonus on the other major card programs. And re: the restaurant points boost, I have a friend who put his Bilt card down on a $750 friends’ dinner and walked away with a whopping 12k points — a free cross-country flight right there. (Note that some bonuses scale with your Bilt status tier. I won’t get into it this time, but Bilt has their own status program and you earn status based on the points you’ve earned. But even the entry-level tier got 75% transfer bonuses; still an insane deal.) Bilt is perhaps the most gamified, content-forward, and youthful of the Big 5 credit card programs, and as such they have some fun Rent day programming too: Point Quest: A trivia show where you earn up to 250 points for answering current events questions. (They also release their content on TikTok!) HQ Trivia is back, but with points?? RentFree: A Family Feud-style game show where you enter a drawing to get your rent paid for by Bilt. Complimentary spots at local SoulCycle classes. All spend categories (besides rent) earn double points! Dining goes from 3x to 6x, Travel goes from 2x to 4x, and all other non-rent spending goes from 1x to 2x. Bilt Dining Bilt has partnered with a whole variety of restaurants in major US metro cities, and you’ll earn anywhere from 2x to 10x extra points per dollar when you dine there. That’s on top of the 3x points you earn from any dining transaction on your Bilt. One of the coolest parts of this program is you don’t even need to use your Bilt card; you can register other cards you own into your “Bilt Wallet” and you’ll still earn the extra Bilt points! I’ve registered my Chase Sapphire Reserve in my Bilt Wallet. Now let’s say I go eat at one of my new favorite NYC spots, 8282 in Lower East Side. 8282 is listed as a +3x Bilt Dining partner. I’ve got two options to earn points on my meal: As you can see, Bilt Dining affords you flexibility on how you earn points on your nights out, which can be very useful as you try to build up points balances in multiple programs. You can see the full list of Bilt Dining restaurants here. Bilt Dining has restaurants in many major cities like NYC, Boston, San Francisco, Seattle, Atlanta, Miami, and more, but I will say that some cities definitely have a more developed list of restaurant choices. Also, as of yesterday it’s officially NYC restaurant week, and there’s plenty of Bilt Dining restaurants on the list right now! If you’ve already got the card, there’s a whole list of them in the app. Bilt Experiences Many major credit card programs technically offer “exclusive experiences” for cardholders, but it’s often hard to access these, and they’re typically quite niche. Bilt has a significantly better experience program with events you’ll likely want to go to. In the past, they’ve offered unique dining experiences and even box tickets at NFL games bookable on points. I went to one of their events in November at Meduza, an up-and-coming mediterranean restaurant that had literally just opened a few days prior! It was a lovely 5 course menu with a cocktail pairing, and the vibes were excellent. They had all the guests sit on a long table together, so everyone got to socialize and become friends while drinking way too much. Plus they had some of the Bilt team at the event too, and I got to ask a bunch of my prying questions about the card. 5 course menu in a super vibey spot. The bluefin tuna tartare topped with caviar was definitely one of my faves. The dining experiences were bookable in the Bilt app for $150/seat or 12,500 Bilt points; I personally opted for the former because I know I can extract more than 1.2¢ of value per point. They’ve also run dining experiences in Miami, Dallas, and Boston. I’m not personally the biggest football fan, but back in September, they also let cardholders book spots in a box suite for a Jets vs. Chiefs game. The cost was just 10k Bilt points — given that a typical box suite goes from $5-25k for 20 people, this was quite the steal! Plus apparently Taylor Swift attended that game to cheer on Travis Kelce, so who knows, you could have bumped into her at the stadium too. Peace of Mind + Protections Because the Bilt card is also a World Elite Mastercard, you get some additional travel protections for peace of mind: Auto rental collision damage waiver: Rent a car and you can decline the extra collision insurance from the rental company. Trip delay reimbursement: If your trip gets delayed 6+ hrs, they’ll help cover costs. Trip cancellation protection: If your trip gets cancelled due to medical reasons, they’ll reimburse you even for non-refundable plans. Cellphone protection: If you pay your phone bill with Bilt, they’ll pay you if you phone gets destroyed or stolen. Purchase protection: Buy something recently and it got destroyed or stolen? Bilt will reimburse you. I’m being a bit vague on the exact terms and reimbursements deliberately, since that deserves its own post. Most travel-focused cards have these protections too, but not all protections are created equal. The devil tends to be in the details, and having reviewed the fine print myself, I’ll say Bilt is probably below average in terms of the quality of these protections. Still, something is better than nothing, but if you’ve got cards like a Chase Sapphire or Capital One VentureX, I’d rely more on those protections instead. I’ll do a proper deep dive that compares the different cards and their protections in a future issue. Best Part: $0 Annual Fee All of this comes for a $0 annual fee, which is honestly a bit wild. This makes it a super friendly “first travel card” for beginners, and an easy addition for experts. We were unable to load this poll. Please refresh the page. My Verdict Friends have been asking me for years about the best card to start travel hacking with, and I used to say the Chase Sapphire Preferred. While that’s still an awesome card, it has a $95 annual fee, and Bilt is free with amazing benefits and partners to boot. I would highly recommend this card for beginners, but as I discussed above, there’s plenty of perks even for seasoned veterans. Even if you don’t pay rent, the rent day bonuses and transfer partners alone make the card worth it. The card is definitely targeted towards younger generations living in major US metro cities, which is a refreshing positioning compared to some of the other cards. If you’re based in NYC, Bilt has an especially strong presence here (they’re based here after all), but you’ll also get a decently fulfilling set of perks and benefits on Bilt Dining and Bilt Experiences in other major US cities. From a business perspective, I’m also generally amazed at how fast their team has been building and how they’ve carved out a growing wedge in an otherwise oligopolized market run by legacy players. More than other cards, they’ve been focusing a lot on strategic partnerships that lend the card more utility, revenue streams, and virality. I have to imagine Bilt has identified fairly diverse revenue streams given their $0 fee strategy. This all means there’s likely more to come with this card! If you do decide to get a Bilt, I would appreciate if you use my referral link below! It gets me some extra points which I can use to travel more and power more issues of Shreycation. I only provide this because Bilt is a product I’m personally a huge fan of (can you tell?), and I hope you enjoy it too! Apply for Bilt (Disclaimer: This post is not financial advice and you should do your own research to ensure this card is right for you, and that you have a reasonable chance of being accepted. Applying will likely affect your credit score. I’ll do a post later with tips on getting and maintaining high credit scores to maximize your chances of getting good cards and getting high limits.) If you enjoyed this issue of Shreycation, please subscribe and share it with a friend! Share Shreycation If you’d like to help make the next issue of Shreycation better, fill out my feedback form here. 6 1 Share",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/i/140605279/rent-day-promotions"
    },
    {
      "title": "How to get 10x the value from your points - by Shrey G",
      "content": "How to get 10x the value from your points SHREY G JAN 11, 2024 14 2 Share Hi! I'm Shrey, and I'm a software engineer turned travel advisor. Back in March 2020, the travel bug bit me hard at probably the worst possible time. While the rest of the world was in quarantine picking up new hobbies, baking sourdough, and doing TikTok dances, I spent all my free time reading about the one thing I couldn’t do at the time: travel. Over the past two years, I've traveled hundreds of thousands of miles and redeemed tens of thousands of dollars in free travel. There’s a pervasive myth that traveling the world on points requires seven-figure spending or constantly hopping coast to coast for some big consulting firm. That hasn’t been my experience: I rarely traveled for work as an engineer and I’d like to think I spend frugally, yet I’ve learned to make these credit card and frequent flyer programs work for me. There’s no shortage of travel hacking content online, but points are a chaotic, complex web of unintuitive axioms and odd stipulations. I’ve always found that you can’t actually get anywhere without reading dozens of articles, and even then, it feels like you’re trying to clear a forest with a butter knife. In this Substack, my goal is to cut through the noise and clear the path for you. You’ll learn hacks that you can apply today, and hopefully over time, you’ll also develop an intuition for hacking on your own too. Today we’re tackling transfer partners, one of the most important and high impact topics that will show you the path to doing tons of free flights. I imagine people are at very different levels of familiarity with transfer partners, so if you’re new, keep reading, and if you’re a seasoned veteran, feel free to scroll down a bit unless you want a refresher! For beginners: Why do Transfer Partners matter? If you’ve seen people zipping around on free business class flights, chances are they’re not just secretly point millionaires. Instead, they’re stretching their credit card points by transferring them into specific airline frequent flyer programs. The major credit card programs for travel are Amex, Chase, Citi, Capital One, and Bilt — I’ll call these the Big 5. Most travelers know that the Big 5 programs each have a travel portal where you can easily redeem your points on flights. The catch is this usually involves spending your points at a fixed rate of 1-1.5¢/point. That means if you want a $1000 flight, you’re could be burning as much as 100k points — that’s more than most credit card sign up bonuses, just for one flight! What savvy travelers know is the Big 5 also allow you to transfer your points to specific frequent flyer partners, and this is the key to unlocking their true value. This is because unlike the Big 5 travel portals, most frequent flyer programs don’t set a fixed exchange rate. This means your points could be worth way more when you transfer! You can routinely find redemptions of 2-3¢/point, and if you’re really skilled or lucky, I’ve seen killer redemptions as high as 12¢/point! That same $1000 flight could cost you as little as 8k points — you might earn that in just a single month of smart spending. My free birthday trip last year, sponsored by my points! Also got to enjoy United's Polaris lounges which come with a free table service restaurant. I could probably write a PhD thesis on transfer partners, but for now I’ll try and give you my best 10 minutes on the topic. Rules of the Game Getting high redemptions doesn’t come for free, and it does involve a bit of a learning curve. First, a few ground rules for working with points: Transfers are one way. Once you transfer points from a credit card program to a frequent flyer program, you can’t go back. Only transfer if (a) you have a redemption in mind and are about to book or (b) there’s a great transfer bonus (we’ll talk about this in future issues). You can’t just transfer to any program. Each of the big 5 credit card programs partners with specific frequent flyer programs. This is why it’s best to own cards across various programs. You usually can’t transfer points across frequent flyer programs. For example, a mile in United MileagePlus usually can’t be transferred to Air Canada Aeroplan. (There are a few limited exceptions, but I’ll cover those in future issues.) Transfers are usually 1:1 but not always. For example, you can convert 1 Chase point into 1 United mile. While the majority of transfer partners for the Big 5 are 1:1, some have slightly unequal ratios like 1:2 or 2:1.5 for some of the less commonly used partners. A motivating example: Let’s go to London in the spring! Now for some examples! Let’s say you want to take advantage of the shoulder season for London in April — it’s starting to warm up but you’re not paying peak season prices. If you have a Chase Sapphire or Bilt card, you can transfer your credit card points to United MileagePlus and book a United Polaris business class flight departing March 30th from EWR to LHR for 80k miles. Found on the United Airlines award search tool here; just select “Pay with Miles”. The actual flight would cost $1988 if we bought outright in cash according to Google Flights: That means we’re redeeming our points at a rate of roughly 2.48¢/point! Compare this the quote of 132487 points we get from the Chase portal: Since I have the Chase Sapphire Reserve, my Chase points redeem at a fixed rate of 1.5¢/point in their portal (a signature benefit of that card), but just by transferring into United instead, I squeeze out 65% more value from my points! If you want to go far, go together: The magic of airline alliances As I mentioned earlier, each of the Big 5 programs has a designated list of transfer partners. Here’s the list for Bilt for example: It’s perfectly normal to look at this list and think “I’ve never heard of half of these airlines, let alone flown them.” But you don’t actually need to fly these airlines to get tremendous value out of their frequent flyer programs. Let me explain. Most airlines are part of a major airline alliance. You’ve probably heard of them: Star Alliance (cofounded by United) Skyteam (cofounded by Delta) Oneworld (cofounded by American) When an airline join an alliance, they agree to allow other airlines in the alliance sell tickets on their flights, and in return they get to sell tickets on their partners flights. When you go on the United website and you see an option to buy a ticket that’s actually operated by Turkish Airlines, that’s why — both of them are in Star Alliance. Fortunately for us, this cross-selling phenomenon isn’t just limited to tickets bought in cash (“revenue tickets”, in point hacker parlance). It also applies to tickets bought on points (“award tickets”)! In other words, Turkish Airlines can let members of their frequent flyer program, Miles&Smiles, book award tickets on United flights using their Turkish Airlines miles. Similarly, United MileagePlus members can often book Turkish Airlines flights using their United miles. This opens up a whole glorious world of possibilities and points arbitrage. Each frequent flyer program uses a different method to calculate how many points a given flight should cost. Some look at the flight distance, some look at which regions the flight transits between, and others look at how much demand exists for that seat. This means you can sometimes find the exact same flight and cabin for fewer points in a partner program! So let’s go back to our example: EWR-LHR in business class on flight UA 110. If we check the Turkish Airlines award search, we can find that same exact seat for just 45k Turkish miles. That’s a whopping 4.97¢/point! Found on the Turkish Airlines award search tool here. (You will need to make a Turkish Airlines account to access this.) If you’ll recall, this same flight would have cost 80k United miles or just above 130k Chase points — we’ve literally gotten 2-3x the value just by going through a United partner. You may think “but wait, I don’t have any Turkish miles.” But if you have a Bilt card (or selected Citi or Capital One cards), your credit card points can transfer at a 1:1 ratio into Turkish Airlines Miles&Smiles. This is why these transferrable points programs are so powerful: you can use them to book flights in programs you don’t regular use. Now let’s say you only have an Amex. You wouldn’t be able to transfer to Turkish Airlines unfortunately, but there’s still a deal for you! Chances are you’ve never flown or even heard of Avianca, but all you need to know is they’re a Star Alliance partner too. And that same EWR-LHR United business class seat is still available for 60k Avianca Lifemiles. Not as amazing as the Turkish redemption, but still a nice discount from the United MileagePlus one! Found on the Avianca Lifemiles award search tool here. You will need to create a Lifemiles account to access. (As you can see, it does pay to have exposure to various Big 5 programs so you can always get the optimal redemption.) Knowing how alliances work can lead to tremendous savings and help us easily maximize our points. It’s not always easy to find these redemptions though, and exploring the whole web of airlines alliances can get complicated. That’s why point hacking is a skill, and it definitely takes practice to get better at it! In the “Advanced” section below, I share a few tips for finding these redemptions, and I’ll share more in future issues too. By the way, that March 30th EWR-LHR flight I’ve been using as my example? That’s a real flight with actual award availability as of 6am this morning. Good points deals often get snapped up fast, so take a look if you’re interested! Like what you see so far? Subscribe for the next free issue, coming out in 2 weeks! Subscribe Some notes on redemption rates Typically you’ll see the really mouthwatering redemptions (>= 5¢/pt) on premium cabins. However, you can still find nice economy redemptions at a rate of 2-3¢/pt! For instance, our example EWR-LHR flight costs $460 for economy and is also available for 20k Avianca Lifemiles; that’s 2.3¢/pt. I’ve talked a lot about how you can get > 1¢/point by transferring points. But since the redemption rate isn’t fixed in most frequent flyer programs, the opposite can also be true. Sometimes you may see terrible redemptions of 0.5¢/point, in which case you need to look elsewhere, book via the credit card portal, or maybe even just book on cash. How do I actually transfer points? Usually you can transfer points in your credit card’s rewards portal. Look for words like “transfer to partners”. From here, you’ll be asked to link your frequent flyer account — ensure that you’re entering your member number accurately! Once you’ve done that, you’ll be able to transfer points, usually in increments of 1000 points. For Chase, you can go to the Ultimate Rewards portal here and click “Transfer points to partners” under the “Travel” tab. For most partners, the transfer is nearly instant. Go make a coffee and your freshly transferred miles should be deposited in your frequent flyer account by the time you’re back. On some occasions though, the transfer can take longer. This can be a bit inconvenient if you’re booking a particularly popular award ticket that may run out of space; I’ll talk about how to get around this in a future issue. Does this mean I should never use my points my credit card’s travel portal? Nope! If you’re trying to save cash, ultimately free travel is free travel. You might not be maximizing your points, but that might not be what matters then. However, be careful not to exhaust all your points in the portal; missing a killer partner redemption because you’re out of points is quite painful. Many portals also offer a combo of cash + points payment option. This can help take the edge off a particularly pricey flight by letting you, in effect, set your own preferred discount using points. I recently did this for a last-minute domestic flight; flights were $200 more than usual, so I used 13,000 points to offset the increase. Additionally, by using the Chase portal with my Chase Sapphire Reserve, my points were valued 50% higher (1.5¢/pt), and I earned 5x points on the cash portion— not bad! We were unable to load this poll. Please refresh the page. For experts: Two of my favorite underrated transfer partners As experts, you’ve probably used your fair share of transfer partners and gotten some awesome redemptions. There’s a few programs I don’t think get enough love, and I figure I’d talk about them below and exactly how you can add them to your repertoire. Types of award space (For some of you, this may be review; I just want to make sure we have a shared vocabulary here!) Not all award space is created equally. Usually when an airlines releases award tickets for a given flight, they release it into 4 buckets: Airline saver space Non-saver space Partner saver space Airline saver space is a special promotional rate offered for award tickets. If you can snag one of these rates, you know you’re getting the best points rate that program can offer. Often airlines will have a fixed rate for saver space (e.g. “one way US-Europe economy = 20k”), but unfortunately many US-based airlines have dynamic rates even for saver space. There’s very limited seats available in this bucket, and once it’s exhausted, you’re just left with non-saver space. Non-saver space is usually much pricier (think ~2x the cost), and is more likely to be dynamically priced based on demand (read: you’re not gonna get a stellar redemption rate here). Non-saver space can still be worth booking though if the cash fare for the flight is super expensive. Finally the partner saver space bucket is similar to airline saver space, but allocated for the airlines’ partners instead. The partner program is allowed to choose whatever pricing strategy they want for these seats, and often, the best deals come from partners that price their partner saver space cheaper than the airlines’ own saver space. One catch: the amount of partner saver seats is less than the amount of airline saver space, so if you find one, you better book fast. Turkish Airlines Miles&Smiles for domestic coast-to-coast trips on United The Sweet Spot Yes, weirdly enough the cheapest way to fly across the USA on points is through a non-US based airline! The Miles&Smiles program uses a region-based award chart where the point cost of a flight depends on your start and end region. Generally most programs using such charts tend to split the US into an East and a West region, which bumps up the cost of flying cross country. Fortunately, Turkish Airlines has a sweet spot here: flights within a single country count as flying within a single region, regardless of the size of the country. If we reference their award charts, we can see the saver (“promotional”) award ticket rate for domestic/intracountry flights is just: Economy one way for 7.5k miles Business one way for 12.5k miles (Turkish is in Star Alliance, so these flights are actually just United flights being cross-sold by Turkish.) This is such a ridiculously low cost award that has managed to stay under the radar for quite a while now. But there’s a good reason for that: for the longest time, the only way to transfer to Turkish was through Citi or Capital One, which aren’t as popular. But that’s all changed with the Bilt card; it’s one of the fastest growing cards in America, and they have recently become the 3rd transfer partner for Turkish. Now these deals are way more accessible to travelers! Finding Award Availability Unlike other airlines, Turkish Airlines unfortunately doesn’t let you see a calendar of available dates, which makes finding award availability hard. However, we can use a little trick: we can use a different Star Alliance partner with a better award search tool to find the available dates, and then pop those dates into the Turkish award search and book from there. This works because all Star Alliance partners will have access to the same partner saver space; it’s just a matter of finding it. Air Canada Aeroplan is known for having a really great award search tool for Star Alliance partner space, so we can just pop in our origin + destination city here and some rough idea of a date we want to travel on. Once you sign into your Aeroplan account, you’ll be able to see a 5 day availability calendar at the top. Generally you’re looking for anything that is priced low (like 15k miles or less), and on United metal — chances are that’s partner saver space. Let’s look for NYC > SFO for Feb 13 (perfect V-Day timing for all the cross-country long distance couples!). Found on the Air Canada Aeroplan award search tool here. Make sure to check the “Book with Aeroplan” box and make an Aeroplan account to see the calendar. According to the calendar at the top, we could also book on Feb 12 or Feb 14, but not Feb 11. Now that we’ve identified a date that has partner saver space, we can head back to Turkish and search there: And voila! We found Turkish partner saver space for this domestic United flight, and its just 7.5k Turkish miles compared to 12.5k Air Canada miles! One caveat: before you get too excited about the 12.5k mile domestic business class redemptions, I should say that it’s very very hard to find award availability for this one. I’ve never succeeded on it personally, and if you find it, you might wanna buy a lottery ticket. The economy tickets are usually very doable though. Air France/KLM Flying Blue for insanely cheap trips to Europe This one isn’t that underrated, and is actually one of the more popular redemptions for people who are getting started in the points game. It doesn’t hurt that Flying Blue is a transfer partner for each of the Big 5 credit card programs too! The reason I’ve still listed it here is many people tend to consider Flying Blue as just a good way to book Delta awards if you don’t have an Amex, but they’re missing the best part: Flying Blue promo rates. Every month, Flying Blue releases a new set of cities that they offer promotional pricing on (usually 25% off their regular partner saver rates). As long as you fly between any country in Europe and these cities, you’re eligible for the discounted pricing (while seats last of course). The discounted pricing is in effect for trips within 6 months of the current month, so the January promos are in effect for trips till June 30. Unfortunately there’s no US-based cities on this list for January, but in December, you could have booked flights from the following cities for a discount: Washington D.C. to Europe from 15k miles (25% off) Boston to Europe from 15k miles (25% off) This month there are lots of Canadian cities on the list though (Toronto, Montreal, Ottowa), so for my Canadian friends out there, it’s your time to shine! You can always see the list of cities here under “Long-Haul Flights” (I suggest bookmarking this link!) Let’s check out an example. Let’s say you’re looking to do V-Day in the city of love, Paris. We can pop in Toronto for the origin and Paris for the destination, and select Business. Seems there’s some partner saver space for Feb 13! You can tell because the button is in green; non-saver space is shown in blue. 50k ain’t bad for Air France business class! You will need to pay a bit of a higher fee here (220 euros), but this flight is going for $5526 right now, so you’re getting an insane 10.5¢/pt redemption here. What a steal for V-day in Paris. (Pro tip: You don’t have to reside in Toronto to take this flight…there’s dozens of NYC <> YYZ flights every day, and you could just book a cheap one like the one below, chill in the Air Canada lounge for free with your business class ticket, and hop over to Paris from there.) There’s so many more underrated transfer partners I could include, but this issue is getting kinda long, so I’ll throw ‘em in a future issue! We were unable to load this poll. Please refresh the page. Deals and Other Awesome Stuff Bilt Dining has 100 restaurants participating in NYC Restaurant Week! You’ll earn extra Bilt points on these restaurants, even if you don’t use your Bilt card (just make sure to register your other card in the Bilt wallet). Plus you can register any Mastercard here (including your Bilt one) to get $10 in statement credits per restaurant, up to $30. You can check your Bilt app for the full 100 restaurant list. Chase Offers has a few cool promos running (may vary by card). Be sure to activate them in the Chase app! Here’s a few on the Chase Sapphire Reserve: 10% cash back on Liquid IV and McDonald’s for your next drunk night out wholesome night in. 10% back on various hotel chains, including Intercontinental, Crowne Plaza, Le Meridien, Kimpton, Hyatt Place, and Holiday Inn. $10 cash back on Turbotax: file your taxes early and feel like a true adult Since I’m a travel advisor working under a licensed travel agency, I can get you access to perks and rates that aren’t publicly available when you book through me. Virtually all of these options include free perks like buffet breakfast for 2, $100 hotel credit, and room upgrades! Here’s a few of the coolest ones: Park Hyatt Bangkok: Stay 3 nights, pay for 2 on stays till March 31. Also, stay 2 nights, pay for just 1 for specialty suites (with same perks) Andaz 5th Avenue (NYC): Stay 4 nights, pay for 3 on stays till March 31 (includes perks like free breakfast, $100 hotel credit, and room upgrade). The Andaz is one of my personal favorite hotels in NY! Thompson Denver: Stay 3 nights, pay for 2 for stays till March 10. Those of you going for a *cough* certain digital asset conference *cough* might find this one useful! (I’ve stayed there personally too for that same conference in the past) Grand Hyatt Playa del Carmen Resort: Stay 3 nights, pay for 2 for stays till June 30. Also, you’ll get an extra $50 to spend at the spa (on top of the $100 hotel credit). If you’re staying at a Kimpton hotel this month or next, say “Chalet All Day” to the front desk. You’ll be glad you did! Thanks for making it this far and I hope you’re enjoyed this first issue! It’s my first time doing anything like this, and I’d really appreciate your thoughts and feedback in my Google form here! Bon Voyage, Shrey Thanks for reading Shreycation! Subscribe for free to receive new posts and support my work. Subscribe 14 2 Share",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/i/140407300/the-sweet-spot"
    },
    {
      "title": "Using Air Canada to fly cross-country for just 5k miles",
      "content": "Snacks: fly cross-country for just 5k points?! Deal of the month courtesy of Air Canada 🤝 Bilt SHREY G JAN 30, 2024 5 Share This snack covers a Bilt-specific deal, but if you don’t have one, scroll down because there’s still a bonus snack for you to nibble on! I’ve mentioned before that one of the best ways to fly cross-country routes like NYC <> SFO/LAX is via Turkish Airlines for 7.5k points. But on February 1, we get to breathe rare air and go up to 33% cheaper. Bilt has a habit of pulling out some killer transfer bonuses on the 1st of the month, and February is no exception. On February 1, Bilt is offering a whopping 75-150% transfer bonus to Air Canada’s Aeroplan frequent flyer program. Your exact bonus depends on your status level with Bilt, which you can check in the app. Higher status in Bilt gets you higher transfer bonuses on Rent Day. Makes it worth getting Bilt status! I want to emphasize how crazy this deal is. In the past, programs like Chase have offered a 20% bonus; even the lowest-tier Bilt members get almost 4 times that here! Now here’s how you turn that into the cheapest cross-country flight I’ve ever seen. We can go on the Air Canada Aeroplan site and look up EWR <> SFO flights on March 5 and we’ll see these options: This is a live example, and chances are you’ll still be able to book it on Feb 1. Flying cross-country takes 12.5k Aeroplan miles on a typical day, which usually means transferring 12.5k Bilt points. But on Feb 1 we’re armed with a huge transfer bonus from Bilt, which means it could cost as low as 12.5/2.5 = 5k Bilt points if you’re Bilt Platinum. But even if you’re just Bilt Blue, it’s still just 7.2k points — strictly better than transferring 7.5k points to Turkish! Also, the cash value of regular economy on these flights is $165. That values your Bilt points as much as 3.3¢/point. That’s pretty darn good, especially for economy! This deal is ONLY available on Feb 1, so make sure not to miss out! Aeroplan is quickly becoming one of the most compelling Star Alliance programs, and I’m not sure when we’ll be lucky enough to see an Aeroplan bonus this crazy again. Subscribe so you can stay in the know next time a great deal comes around! Subscribe But Shrey, I can’t really commit to a flight today. That’s fine! All you need to do on Feb 1 is transfer some miles. You can book later. Do Aeroplan miles expire? That is a great question. Aeroplan miles do expire 18 months after you receive them, but only if you have zero activity on your Aeroplan account. Basically anything you do with Aeroplan resets the clock, including transferring more points. So if you’re worried about forgetting, you can add yourself to this calendar invite for July 2025, which will remind you to transfer the minimal amount of points to Aeroplan to delay expiration. Is NYC <> SFO the only good route to book? Nope! You can use this transfer bonus to book any of the awesome routes in the bonus snack below. If this article made you curious about the Bilt card, you can learn more in my review here. If you do end up getting it, I would appreciate you using my referral link. It gets me some extra points which I can use to power more issues of Shreycation! Apply for Bilt (Disclaimer: This post is not financial advice and you should do your own research to ensure this card is right for you. Applying will likely affect your credit score.) Bonus Snack: Air Canada vs. United You know how your Chipotle bowl costs 20% more because of inflation? Turns out points are affected by inflation too, and in summer 2023, United devalued their points program. Routes that may have cost just 35k United miles now cost upwards of 55k. This opens the field for other programs to offer some great deals. United MileagePlus used to be one of the most cost-effective ways to book many Star Alliance flights on points, but now Air Canada Aeroplan is eyeing that crown. Let’s analyze some of the most popular travel routes: Aeroplan outperforms in the vast majority of routes except for West Coast <> Europe. Especially great savings come from the short-haul North American routes, North America <> West/South Asia routes, and North America <> South America routes. POLL What do you want to learn next from Shreycation? When should I use points over cash? 100% What card should I get next? 0% How do I actually book using points 0% POLL CLOSED Eagle-eyed readers will notice that Air Canada levies higher cash fees on their award flights. But don’t worry, the math is mathing. Let’s take North America <> East Asia for example: 50k miles + 77 CAD on Aeroplan vs. 55k miles + 6 USD on United. 77 CAD is about 56 USD, meaning there’s a difference of +50 USD and -5k miles between the two. 5k miles is worth just 50 USD only if you’re a points novice and value each mile at 1¢/point. But the whole point of Shreycation is to help you get way more value from your points than the default 1¢/point, so just by subscribing, you’re making those 5k miles worth way more than 50 USD! The math indeed maths. And if you’re wondering why the Delhi route is so cheap, it’s because Air Canada considers India part of the “Atlantic” region, along with all of Europe and Africa. Air Canada is filled with fun sweet spots like this that I’ll cover in depth in the future. Thanks for reading! Wielding the point-hacking force is a lot more fun with friends. Plus, if you refer 3 friends, I’ll send you my exclusive, comprehensive guide on stopover programs so you can hack multi-city trips. (And if you don’t know what stopovers are, boy are you missing out.) Refer a friend 5 Likes 5 Share",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/i/141141065/bonus-snack-air-canada-vs-united"
    },
    {
      "title": "How to get 10x the value from your points - by Shrey G",
      "content": "How to get 10x the value from your points SHREY G JAN 11, 2024 14 2 Share Hi! I'm Shrey, and I'm a software engineer turned travel advisor. Back in March 2020, the travel bug bit me hard at probably the worst possible time. While the rest of the world was in quarantine picking up new hobbies, baking sourdough, and doing TikTok dances, I spent all my free time reading about the one thing I couldn’t do at the time: travel. Over the past two years, I've traveled hundreds of thousands of miles and redeemed tens of thousands of dollars in free travel. There’s a pervasive myth that traveling the world on points requires seven-figure spending or constantly hopping coast to coast for some big consulting firm. That hasn’t been my experience: I rarely traveled for work as an engineer and I’d like to think I spend frugally, yet I’ve learned to make these credit card and frequent flyer programs work for me. There’s no shortage of travel hacking content online, but points are a chaotic, complex web of unintuitive axioms and odd stipulations. I’ve always found that you can’t actually get anywhere without reading dozens of articles, and even then, it feels like you’re trying to clear a forest with a butter knife. In this Substack, my goal is to cut through the noise and clear the path for you. You’ll learn hacks that you can apply today, and hopefully over time, you’ll also develop an intuition for hacking on your own too. Today we’re tackling transfer partners, one of the most important and high impact topics that will show you the path to doing tons of free flights. I imagine people are at very different levels of familiarity with transfer partners, so if you’re new, keep reading, and if you’re a seasoned veteran, feel free to scroll down a bit unless you want a refresher! For beginners: Why do Transfer Partners matter? If you’ve seen people zipping around on free business class flights, chances are they’re not just secretly point millionaires. Instead, they’re stretching their credit card points by transferring them into specific airline frequent flyer programs. The major credit card programs for travel are Amex, Chase, Citi, Capital One, and Bilt — I’ll call these the Big 5. Most travelers know that the Big 5 programs each have a travel portal where you can easily redeem your points on flights. The catch is this usually involves spending your points at a fixed rate of 1-1.5¢/point. That means if you want a $1000 flight, you’re could be burning as much as 100k points — that’s more than most credit card sign up bonuses, just for one flight! What savvy travelers know is the Big 5 also allow you to transfer your points to specific frequent flyer partners, and this is the key to unlocking their true value. This is because unlike the Big 5 travel portals, most frequent flyer programs don’t set a fixed exchange rate. This means your points could be worth way more when you transfer! You can routinely find redemptions of 2-3¢/point, and if you’re really skilled or lucky, I’ve seen killer redemptions as high as 12¢/point! That same $1000 flight could cost you as little as 8k points — you might earn that in just a single month of smart spending. My free birthday trip last year, sponsored by my points! Also got to enjoy United's Polaris lounges which come with a free table service restaurant. I could probably write a PhD thesis on transfer partners, but for now I’ll try and give you my best 10 minutes on the topic. Rules of the Game Getting high redemptions doesn’t come for free, and it does involve a bit of a learning curve. First, a few ground rules for working with points: Transfers are one way. Once you transfer points from a credit card program to a frequent flyer program, you can’t go back. Only transfer if (a) you have a redemption in mind and are about to book or (b) there’s a great transfer bonus (we’ll talk about this in future issues). You can’t just transfer to any program. Each of the big 5 credit card programs partners with specific frequent flyer programs. This is why it’s best to own cards across various programs. You usually can’t transfer points across frequent flyer programs. For example, a mile in United MileagePlus usually can’t be transferred to Air Canada Aeroplan. (There are a few limited exceptions, but I’ll cover those in future issues.) Transfers are usually 1:1 but not always. For example, you can convert 1 Chase point into 1 United mile. While the majority of transfer partners for the Big 5 are 1:1, some have slightly unequal ratios like 1:2 or 2:1.5 for some of the less commonly used partners. A motivating example: Let’s go to London in the spring! Now for some examples! Let’s say you want to take advantage of the shoulder season for London in April — it’s starting to warm up but you’re not paying peak season prices. If you have a Chase Sapphire or Bilt card, you can transfer your credit card points to United MileagePlus and book a United Polaris business class flight departing March 30th from EWR to LHR for 80k miles. Found on the United Airlines award search tool here; just select “Pay with Miles”. The actual flight would cost $1988 if we bought outright in cash according to Google Flights: That means we’re redeeming our points at a rate of roughly 2.48¢/point! Compare this the quote of 132487 points we get from the Chase portal: Since I have the Chase Sapphire Reserve, my Chase points redeem at a fixed rate of 1.5¢/point in their portal (a signature benefit of that card), but just by transferring into United instead, I squeeze out 65% more value from my points! If you want to go far, go together: The magic of airline alliances As I mentioned earlier, each of the Big 5 programs has a designated list of transfer partners. Here’s the list for Bilt for example: It’s perfectly normal to look at this list and think “I’ve never heard of half of these airlines, let alone flown them.” But you don’t actually need to fly these airlines to get tremendous value out of their frequent flyer programs. Let me explain. Most airlines are part of a major airline alliance. You’ve probably heard of them: Star Alliance (cofounded by United) Skyteam (cofounded by Delta) Oneworld (cofounded by American) When an airline join an alliance, they agree to allow other airlines in the alliance sell tickets on their flights, and in return they get to sell tickets on their partners flights. When you go on the United website and you see an option to buy a ticket that’s actually operated by Turkish Airlines, that’s why — both of them are in Star Alliance. Fortunately for us, this cross-selling phenomenon isn’t just limited to tickets bought in cash (“revenue tickets”, in point hacker parlance). It also applies to tickets bought on points (“award tickets”)! In other words, Turkish Airlines can let members of their frequent flyer program, Miles&Smiles, book award tickets on United flights using their Turkish Airlines miles. Similarly, United MileagePlus members can often book Turkish Airlines flights using their United miles. This opens up a whole glorious world of possibilities and points arbitrage. Each frequent flyer program uses a different method to calculate how many points a given flight should cost. Some look at the flight distance, some look at which regions the flight transits between, and others look at how much demand exists for that seat. This means you can sometimes find the exact same flight and cabin for fewer points in a partner program! So let’s go back to our example: EWR-LHR in business class on flight UA 110. If we check the Turkish Airlines award search, we can find that same exact seat for just 45k Turkish miles. That’s a whopping 4.97¢/point! Found on the Turkish Airlines award search tool here. (You will need to make a Turkish Airlines account to access this.) If you’ll recall, this same flight would have cost 80k United miles or just above 130k Chase points — we’ve literally gotten 2-3x the value just by going through a United partner. You may think “but wait, I don’t have any Turkish miles.” But if you have a Bilt card (or selected Citi or Capital One cards), your credit card points can transfer at a 1:1 ratio into Turkish Airlines Miles&Smiles. This is why these transferrable points programs are so powerful: you can use them to book flights in programs you don’t regular use. Now let’s say you only have an Amex. You wouldn’t be able to transfer to Turkish Airlines unfortunately, but there’s still a deal for you! Chances are you’ve never flown or even heard of Avianca, but all you need to know is they’re a Star Alliance partner too. And that same EWR-LHR United business class seat is still available for 60k Avianca Lifemiles. Not as amazing as the Turkish redemption, but still a nice discount from the United MileagePlus one! Found on the Avianca Lifemiles award search tool here. You will need to create a Lifemiles account to access. (As you can see, it does pay to have exposure to various Big 5 programs so you can always get the optimal redemption.) Knowing how alliances work can lead to tremendous savings and help us easily maximize our points. It’s not always easy to find these redemptions though, and exploring the whole web of airlines alliances can get complicated. That’s why point hacking is a skill, and it definitely takes practice to get better at it! In the “Advanced” section below, I share a few tips for finding these redemptions, and I’ll share more in future issues too. By the way, that March 30th EWR-LHR flight I’ve been using as my example? That’s a real flight with actual award availability as of 6am this morning. Good points deals often get snapped up fast, so take a look if you’re interested! Like what you see so far? Subscribe for the next free issue, coming out in 2 weeks! Subscribe Some notes on redemption rates Typically you’ll see the really mouthwatering redemptions (>= 5¢/pt) on premium cabins. However, you can still find nice economy redemptions at a rate of 2-3¢/pt! For instance, our example EWR-LHR flight costs $460 for economy and is also available for 20k Avianca Lifemiles; that’s 2.3¢/pt. I’ve talked a lot about how you can get > 1¢/point by transferring points. But since the redemption rate isn’t fixed in most frequent flyer programs, the opposite can also be true. Sometimes you may see terrible redemptions of 0.5¢/point, in which case you need to look elsewhere, book via the credit card portal, or maybe even just book on cash. How do I actually transfer points? Usually you can transfer points in your credit card’s rewards portal. Look for words like “transfer to partners”. From here, you’ll be asked to link your frequent flyer account — ensure that you’re entering your member number accurately! Once you’ve done that, you’ll be able to transfer points, usually in increments of 1000 points. For Chase, you can go to the Ultimate Rewards portal here and click “Transfer points to partners” under the “Travel” tab. For most partners, the transfer is nearly instant. Go make a coffee and your freshly transferred miles should be deposited in your frequent flyer account by the time you’re back. On some occasions though, the transfer can take longer. This can be a bit inconvenient if you’re booking a particularly popular award ticket that may run out of space; I’ll talk about how to get around this in a future issue. Does this mean I should never use my points my credit card’s travel portal? Nope! If you’re trying to save cash, ultimately free travel is free travel. You might not be maximizing your points, but that might not be what matters then. However, be careful not to exhaust all your points in the portal; missing a killer partner redemption because you’re out of points is quite painful. Many portals also offer a combo of cash + points payment option. This can help take the edge off a particularly pricey flight by letting you, in effect, set your own preferred discount using points. I recently did this for a last-minute domestic flight; flights were $200 more than usual, so I used 13,000 points to offset the increase. Additionally, by using the Chase portal with my Chase Sapphire Reserve, my points were valued 50% higher (1.5¢/pt), and I earned 5x points on the cash portion— not bad! We were unable to load this poll. Please refresh the page. For experts: Two of my favorite underrated transfer partners As experts, you’ve probably used your fair share of transfer partners and gotten some awesome redemptions. There’s a few programs I don’t think get enough love, and I figure I’d talk about them below and exactly how you can add them to your repertoire. Types of award space (For some of you, this may be review; I just want to make sure we have a shared vocabulary here!) Not all award space is created equally. Usually when an airlines releases award tickets for a given flight, they release it into 4 buckets: Airline saver space Non-saver space Partner saver space Airline saver space is a special promotional rate offered for award tickets. If you can snag one of these rates, you know you’re getting the best points rate that program can offer. Often airlines will have a fixed rate for saver space (e.g. “one way US-Europe economy = 20k”), but unfortunately many US-based airlines have dynamic rates even for saver space. There’s very limited seats available in this bucket, and once it’s exhausted, you’re just left with non-saver space. Non-saver space is usually much pricier (think ~2x the cost), and is more likely to be dynamically priced based on demand (read: you’re not gonna get a stellar redemption rate here). Non-saver space can still be worth booking though if the cash fare for the flight is super expensive. Finally the partner saver space bucket is similar to airline saver space, but allocated for the airlines’ partners instead. The partner program is allowed to choose whatever pricing strategy they want for these seats, and often, the best deals come from partners that price their partner saver space cheaper than the airlines’ own saver space. One catch: the amount of partner saver seats is less than the amount of airline saver space, so if you find one, you better book fast. Turkish Airlines Miles&Smiles for domestic coast-to-coast trips on United The Sweet Spot Yes, weirdly enough the cheapest way to fly across the USA on points is through a non-US based airline! The Miles&Smiles program uses a region-based award chart where the point cost of a flight depends on your start and end region. Generally most programs using such charts tend to split the US into an East and a West region, which bumps up the cost of flying cross country. Fortunately, Turkish Airlines has a sweet spot here: flights within a single country count as flying within a single region, regardless of the size of the country. If we reference their award charts, we can see the saver (“promotional”) award ticket rate for domestic/intracountry flights is just: Economy one way for 7.5k miles Business one way for 12.5k miles (Turkish is in Star Alliance, so these flights are actually just United flights being cross-sold by Turkish.) This is such a ridiculously low cost award that has managed to stay under the radar for quite a while now. But there’s a good reason for that: for the longest time, the only way to transfer to Turkish was through Citi or Capital One, which aren’t as popular. But that’s all changed with the Bilt card; it’s one of the fastest growing cards in America, and they have recently become the 3rd transfer partner for Turkish. Now these deals are way more accessible to travelers! Finding Award Availability Unlike other airlines, Turkish Airlines unfortunately doesn’t let you see a calendar of available dates, which makes finding award availability hard. However, we can use a little trick: we can use a different Star Alliance partner with a better award search tool to find the available dates, and then pop those dates into the Turkish award search and book from there. This works because all Star Alliance partners will have access to the same partner saver space; it’s just a matter of finding it. Air Canada Aeroplan is known for having a really great award search tool for Star Alliance partner space, so we can just pop in our origin + destination city here and some rough idea of a date we want to travel on. Once you sign into your Aeroplan account, you’ll be able to see a 5 day availability calendar at the top. Generally you’re looking for anything that is priced low (like 15k miles or less), and on United metal — chances are that’s partner saver space. Let’s look for NYC > SFO for Feb 13 (perfect V-Day timing for all the cross-country long distance couples!). Found on the Air Canada Aeroplan award search tool here. Make sure to check the “Book with Aeroplan” box and make an Aeroplan account to see the calendar. According to the calendar at the top, we could also book on Feb 12 or Feb 14, but not Feb 11. Now that we’ve identified a date that has partner saver space, we can head back to Turkish and search there: And voila! We found Turkish partner saver space for this domestic United flight, and its just 7.5k Turkish miles compared to 12.5k Air Canada miles! One caveat: before you get too excited about the 12.5k mile domestic business class redemptions, I should say that it’s very very hard to find award availability for this one. I’ve never succeeded on it personally, and if you find it, you might wanna buy a lottery ticket. The economy tickets are usually very doable though. Air France/KLM Flying Blue for insanely cheap trips to Europe This one isn’t that underrated, and is actually one of the more popular redemptions for people who are getting started in the points game. It doesn’t hurt that Flying Blue is a transfer partner for each of the Big 5 credit card programs too! The reason I’ve still listed it here is many people tend to consider Flying Blue as just a good way to book Delta awards if you don’t have an Amex, but they’re missing the best part: Flying Blue promo rates. Every month, Flying Blue releases a new set of cities that they offer promotional pricing on (usually 25% off their regular partner saver rates). As long as you fly between any country in Europe and these cities, you’re eligible for the discounted pricing (while seats last of course). The discounted pricing is in effect for trips within 6 months of the current month, so the January promos are in effect for trips till June 30. Unfortunately there’s no US-based cities on this list for January, but in December, you could have booked flights from the following cities for a discount: Washington D.C. to Europe from 15k miles (25% off) Boston to Europe from 15k miles (25% off) This month there are lots of Canadian cities on the list though (Toronto, Montreal, Ottowa), so for my Canadian friends out there, it’s your time to shine! You can always see the list of cities here under “Long-Haul Flights” (I suggest bookmarking this link!) Let’s check out an example. Let’s say you’re looking to do V-Day in the city of love, Paris. We can pop in Toronto for the origin and Paris for the destination, and select Business. Seems there’s some partner saver space for Feb 13! You can tell because the button is in green; non-saver space is shown in blue. 50k ain’t bad for Air France business class! You will need to pay a bit of a higher fee here (220 euros), but this flight is going for $5526 right now, so you’re getting an insane 10.5¢/pt redemption here. What a steal for V-day in Paris. (Pro tip: You don’t have to reside in Toronto to take this flight…there’s dozens of NYC <> YYZ flights every day, and you could just book a cheap one like the one below, chill in the Air Canada lounge for free with your business class ticket, and hop over to Paris from there.) There’s so many more underrated transfer partners I could include, but this issue is getting kinda long, so I’ll throw ‘em in a future issue! We were unable to load this poll. Please refresh the page. Deals and Other Awesome Stuff Bilt Dining has 100 restaurants participating in NYC Restaurant Week! You’ll earn extra Bilt points on these restaurants, even if you don’t use your Bilt card (just make sure to register your other card in the Bilt wallet). Plus you can register any Mastercard here (including your Bilt one) to get $10 in statement credits per restaurant, up to $30. You can check your Bilt app for the full 100 restaurant list. Chase Offers has a few cool promos running (may vary by card). Be sure to activate them in the Chase app! Here’s a few on the Chase Sapphire Reserve: 10% cash back on Liquid IV and McDonald’s for your next drunk night out wholesome night in. 10% back on various hotel chains, including Intercontinental, Crowne Plaza, Le Meridien, Kimpton, Hyatt Place, and Holiday Inn. $10 cash back on Turbotax: file your taxes early and feel like a true adult Since I’m a travel advisor working under a licensed travel agency, I can get you access to perks and rates that aren’t publicly available when you book through me. Virtually all of these options include free perks like buffet breakfast for 2, $100 hotel credit, and room upgrades! Here’s a few of the coolest ones: Park Hyatt Bangkok: Stay 3 nights, pay for 2 on stays till March 31. Also, stay 2 nights, pay for just 1 for specialty suites (with same perks) Andaz 5th Avenue (NYC): Stay 4 nights, pay for 3 on stays till March 31 (includes perks like free breakfast, $100 hotel credit, and room upgrade). The Andaz is one of my personal favorite hotels in NY! Thompson Denver: Stay 3 nights, pay for 2 for stays till March 10. Those of you going for a *cough* certain digital asset conference *cough* might find this one useful! (I’ve stayed there personally too for that same conference in the past) Grand Hyatt Playa del Carmen Resort: Stay 3 nights, pay for 2 for stays till June 30. Also, you’ll get an extra $50 to spend at the spa (on top of the $100 hotel credit). If you’re staying at a Kimpton hotel this month or next, say “Chalet All Day” to the front desk. You’ll be glad you did! Thanks for making it this far and I hope you’re enjoyed this first issue! It’s my first time doing anything like this, and I’d really appreciate your thoughts and feedback in my Google form here! Bon Voyage, Shrey Thanks for reading Shreycation! Subscribe for free to receive new posts and support my work. Subscribe 14 2 Share",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/i/140407300/types-of-award-space"
    },
    {
      "title": "How to get 10x the value from your points - by Shrey G",
      "content": "How to get 10x the value from your points SHREY G JAN 11, 2024 14 2 Share Hi! I'm Shrey, and I'm a software engineer turned travel advisor. Back in March 2020, the travel bug bit me hard at probably the worst possible time. While the rest of the world was in quarantine picking up new hobbies, baking sourdough, and doing TikTok dances, I spent all my free time reading about the one thing I couldn’t do at the time: travel. Over the past two years, I've traveled hundreds of thousands of miles and redeemed tens of thousands of dollars in free travel. There’s a pervasive myth that traveling the world on points requires seven-figure spending or constantly hopping coast to coast for some big consulting firm. That hasn’t been my experience: I rarely traveled for work as an engineer and I’d like to think I spend frugally, yet I’ve learned to make these credit card and frequent flyer programs work for me. There’s no shortage of travel hacking content online, but points are a chaotic, complex web of unintuitive axioms and odd stipulations. I’ve always found that you can’t actually get anywhere without reading dozens of articles, and even then, it feels like you’re trying to clear a forest with a butter knife. In this Substack, my goal is to cut through the noise and clear the path for you. You’ll learn hacks that you can apply today, and hopefully over time, you’ll also develop an intuition for hacking on your own too. Today we’re tackling transfer partners, one of the most important and high impact topics that will show you the path to doing tons of free flights. I imagine people are at very different levels of familiarity with transfer partners, so if you’re new, keep reading, and if you’re a seasoned veteran, feel free to scroll down a bit unless you want a refresher! For beginners: Why do Transfer Partners matter? If you’ve seen people zipping around on free business class flights, chances are they’re not just secretly point millionaires. Instead, they’re stretching their credit card points by transferring them into specific airline frequent flyer programs. The major credit card programs for travel are Amex, Chase, Citi, Capital One, and Bilt — I’ll call these the Big 5. Most travelers know that the Big 5 programs each have a travel portal where you can easily redeem your points on flights. The catch is this usually involves spending your points at a fixed rate of 1-1.5¢/point. That means if you want a $1000 flight, you’re could be burning as much as 100k points — that’s more than most credit card sign up bonuses, just for one flight! What savvy travelers know is the Big 5 also allow you to transfer your points to specific frequent flyer partners, and this is the key to unlocking their true value. This is because unlike the Big 5 travel portals, most frequent flyer programs don’t set a fixed exchange rate. This means your points could be worth way more when you transfer! You can routinely find redemptions of 2-3¢/point, and if you’re really skilled or lucky, I’ve seen killer redemptions as high as 12¢/point! That same $1000 flight could cost you as little as 8k points — you might earn that in just a single month of smart spending. My free birthday trip last year, sponsored by my points! Also got to enjoy United's Polaris lounges which come with a free table service restaurant. I could probably write a PhD thesis on transfer partners, but for now I’ll try and give you my best 10 minutes on the topic. Rules of the Game Getting high redemptions doesn’t come for free, and it does involve a bit of a learning curve. First, a few ground rules for working with points: Transfers are one way. Once you transfer points from a credit card program to a frequent flyer program, you can’t go back. Only transfer if (a) you have a redemption in mind and are about to book or (b) there’s a great transfer bonus (we’ll talk about this in future issues). You can’t just transfer to any program. Each of the big 5 credit card programs partners with specific frequent flyer programs. This is why it’s best to own cards across various programs. You usually can’t transfer points across frequent flyer programs. For example, a mile in United MileagePlus usually can’t be transferred to Air Canada Aeroplan. (There are a few limited exceptions, but I’ll cover those in future issues.) Transfers are usually 1:1 but not always. For example, you can convert 1 Chase point into 1 United mile. While the majority of transfer partners for the Big 5 are 1:1, some have slightly unequal ratios like 1:2 or 2:1.5 for some of the less commonly used partners. A motivating example: Let’s go to London in the spring! Now for some examples! Let’s say you want to take advantage of the shoulder season for London in April — it’s starting to warm up but you’re not paying peak season prices. If you have a Chase Sapphire or Bilt card, you can transfer your credit card points to United MileagePlus and book a United Polaris business class flight departing March 30th from EWR to LHR for 80k miles. Found on the United Airlines award search tool here; just select “Pay with Miles”. The actual flight would cost $1988 if we bought outright in cash according to Google Flights: That means we’re redeeming our points at a rate of roughly 2.48¢/point! Compare this the quote of 132487 points we get from the Chase portal: Since I have the Chase Sapphire Reserve, my Chase points redeem at a fixed rate of 1.5¢/point in their portal (a signature benefit of that card), but just by transferring into United instead, I squeeze out 65% more value from my points! If you want to go far, go together: The magic of airline alliances As I mentioned earlier, each of the Big 5 programs has a designated list of transfer partners. Here’s the list for Bilt for example: It’s perfectly normal to look at this list and think “I’ve never heard of half of these airlines, let alone flown them.” But you don’t actually need to fly these airlines to get tremendous value out of their frequent flyer programs. Let me explain. Most airlines are part of a major airline alliance. You’ve probably heard of them: Star Alliance (cofounded by United) Skyteam (cofounded by Delta) Oneworld (cofounded by American) When an airline join an alliance, they agree to allow other airlines in the alliance sell tickets on their flights, and in return they get to sell tickets on their partners flights. When you go on the United website and you see an option to buy a ticket that’s actually operated by Turkish Airlines, that’s why — both of them are in Star Alliance. Fortunately for us, this cross-selling phenomenon isn’t just limited to tickets bought in cash (“revenue tickets”, in point hacker parlance). It also applies to tickets bought on points (“award tickets”)! In other words, Turkish Airlines can let members of their frequent flyer program, Miles&Smiles, book award tickets on United flights using their Turkish Airlines miles. Similarly, United MileagePlus members can often book Turkish Airlines flights using their United miles. This opens up a whole glorious world of possibilities and points arbitrage. Each frequent flyer program uses a different method to calculate how many points a given flight should cost. Some look at the flight distance, some look at which regions the flight transits between, and others look at how much demand exists for that seat. This means you can sometimes find the exact same flight and cabin for fewer points in a partner program! So let’s go back to our example: EWR-LHR in business class on flight UA 110. If we check the Turkish Airlines award search, we can find that same exact seat for just 45k Turkish miles. That’s a whopping 4.97¢/point! Found on the Turkish Airlines award search tool here. (You will need to make a Turkish Airlines account to access this.) If you’ll recall, this same flight would have cost 80k United miles or just above 130k Chase points — we’ve literally gotten 2-3x the value just by going through a United partner. You may think “but wait, I don’t have any Turkish miles.” But if you have a Bilt card (or selected Citi or Capital One cards), your credit card points can transfer at a 1:1 ratio into Turkish Airlines Miles&Smiles. This is why these transferrable points programs are so powerful: you can use them to book flights in programs you don’t regular use. Now let’s say you only have an Amex. You wouldn’t be able to transfer to Turkish Airlines unfortunately, but there’s still a deal for you! Chances are you’ve never flown or even heard of Avianca, but all you need to know is they’re a Star Alliance partner too. And that same EWR-LHR United business class seat is still available for 60k Avianca Lifemiles. Not as amazing as the Turkish redemption, but still a nice discount from the United MileagePlus one! Found on the Avianca Lifemiles award search tool here. You will need to create a Lifemiles account to access. (As you can see, it does pay to have exposure to various Big 5 programs so you can always get the optimal redemption.) Knowing how alliances work can lead to tremendous savings and help us easily maximize our points. It’s not always easy to find these redemptions though, and exploring the whole web of airlines alliances can get complicated. That’s why point hacking is a skill, and it definitely takes practice to get better at it! In the “Advanced” section below, I share a few tips for finding these redemptions, and I’ll share more in future issues too. By the way, that March 30th EWR-LHR flight I’ve been using as my example? That’s a real flight with actual award availability as of 6am this morning. Good points deals often get snapped up fast, so take a look if you’re interested! Like what you see so far? Subscribe for the next free issue, coming out in 2 weeks! Subscribe Some notes on redemption rates Typically you’ll see the really mouthwatering redemptions (>= 5¢/pt) on premium cabins. However, you can still find nice economy redemptions at a rate of 2-3¢/pt! For instance, our example EWR-LHR flight costs $460 for economy and is also available for 20k Avianca Lifemiles; that’s 2.3¢/pt. I’ve talked a lot about how you can get > 1¢/point by transferring points. But since the redemption rate isn’t fixed in most frequent flyer programs, the opposite can also be true. Sometimes you may see terrible redemptions of 0.5¢/point, in which case you need to look elsewhere, book via the credit card portal, or maybe even just book on cash. How do I actually transfer points? Usually you can transfer points in your credit card’s rewards portal. Look for words like “transfer to partners”. From here, you’ll be asked to link your frequent flyer account — ensure that you’re entering your member number accurately! Once you’ve done that, you’ll be able to transfer points, usually in increments of 1000 points. For Chase, you can go to the Ultimate Rewards portal here and click “Transfer points to partners” under the “Travel” tab. For most partners, the transfer is nearly instant. Go make a coffee and your freshly transferred miles should be deposited in your frequent flyer account by the time you’re back. On some occasions though, the transfer can take longer. This can be a bit inconvenient if you’re booking a particularly popular award ticket that may run out of space; I’ll talk about how to get around this in a future issue. Does this mean I should never use my points my credit card’s travel portal? Nope! If you’re trying to save cash, ultimately free travel is free travel. You might not be maximizing your points, but that might not be what matters then. However, be careful not to exhaust all your points in the portal; missing a killer partner redemption because you’re out of points is quite painful. Many portals also offer a combo of cash + points payment option. This can help take the edge off a particularly pricey flight by letting you, in effect, set your own preferred discount using points. I recently did this for a last-minute domestic flight; flights were $200 more than usual, so I used 13,000 points to offset the increase. Additionally, by using the Chase portal with my Chase Sapphire Reserve, my points were valued 50% higher (1.5¢/pt), and I earned 5x points on the cash portion— not bad! We were unable to load this poll. Please refresh the page. For experts: Two of my favorite underrated transfer partners As experts, you’ve probably used your fair share of transfer partners and gotten some awesome redemptions. There’s a few programs I don’t think get enough love, and I figure I’d talk about them below and exactly how you can add them to your repertoire. Types of award space (For some of you, this may be review; I just want to make sure we have a shared vocabulary here!) Not all award space is created equally. Usually when an airlines releases award tickets for a given flight, they release it into 4 buckets: Airline saver space Non-saver space Partner saver space Airline saver space is a special promotional rate offered for award tickets. If you can snag one of these rates, you know you’re getting the best points rate that program can offer. Often airlines will have a fixed rate for saver space (e.g. “one way US-Europe economy = 20k”), but unfortunately many US-based airlines have dynamic rates even for saver space. There’s very limited seats available in this bucket, and once it’s exhausted, you’re just left with non-saver space. Non-saver space is usually much pricier (think ~2x the cost), and is more likely to be dynamically priced based on demand (read: you’re not gonna get a stellar redemption rate here). Non-saver space can still be worth booking though if the cash fare for the flight is super expensive. Finally the partner saver space bucket is similar to airline saver space, but allocated for the airlines’ partners instead. The partner program is allowed to choose whatever pricing strategy they want for these seats, and often, the best deals come from partners that price their partner saver space cheaper than the airlines’ own saver space. One catch: the amount of partner saver seats is less than the amount of airline saver space, so if you find one, you better book fast. Turkish Airlines Miles&Smiles for domestic coast-to-coast trips on United The Sweet Spot Yes, weirdly enough the cheapest way to fly across the USA on points is through a non-US based airline! The Miles&Smiles program uses a region-based award chart where the point cost of a flight depends on your start and end region. Generally most programs using such charts tend to split the US into an East and a West region, which bumps up the cost of flying cross country. Fortunately, Turkish Airlines has a sweet spot here: flights within a single country count as flying within a single region, regardless of the size of the country. If we reference their award charts, we can see the saver (“promotional”) award ticket rate for domestic/intracountry flights is just: Economy one way for 7.5k miles Business one way for 12.5k miles (Turkish is in Star Alliance, so these flights are actually just United flights being cross-sold by Turkish.) This is such a ridiculously low cost award that has managed to stay under the radar for quite a while now. But there’s a good reason for that: for the longest time, the only way to transfer to Turkish was through Citi or Capital One, which aren’t as popular. But that’s all changed with the Bilt card; it’s one of the fastest growing cards in America, and they have recently become the 3rd transfer partner for Turkish. Now these deals are way more accessible to travelers! Finding Award Availability Unlike other airlines, Turkish Airlines unfortunately doesn’t let you see a calendar of available dates, which makes finding award availability hard. However, we can use a little trick: we can use a different Star Alliance partner with a better award search tool to find the available dates, and then pop those dates into the Turkish award search and book from there. This works because all Star Alliance partners will have access to the same partner saver space; it’s just a matter of finding it. Air Canada Aeroplan is known for having a really great award search tool for Star Alliance partner space, so we can just pop in our origin + destination city here and some rough idea of a date we want to travel on. Once you sign into your Aeroplan account, you’ll be able to see a 5 day availability calendar at the top. Generally you’re looking for anything that is priced low (like 15k miles or less), and on United metal — chances are that’s partner saver space. Let’s look for NYC > SFO for Feb 13 (perfect V-Day timing for all the cross-country long distance couples!). Found on the Air Canada Aeroplan award search tool here. Make sure to check the “Book with Aeroplan” box and make an Aeroplan account to see the calendar. According to the calendar at the top, we could also book on Feb 12 or Feb 14, but not Feb 11. Now that we’ve identified a date that has partner saver space, we can head back to Turkish and search there: And voila! We found Turkish partner saver space for this domestic United flight, and its just 7.5k Turkish miles compared to 12.5k Air Canada miles! One caveat: before you get too excited about the 12.5k mile domestic business class redemptions, I should say that it’s very very hard to find award availability for this one. I’ve never succeeded on it personally, and if you find it, you might wanna buy a lottery ticket. The economy tickets are usually very doable though. Air France/KLM Flying Blue for insanely cheap trips to Europe This one isn’t that underrated, and is actually one of the more popular redemptions for people who are getting started in the points game. It doesn’t hurt that Flying Blue is a transfer partner for each of the Big 5 credit card programs too! The reason I’ve still listed it here is many people tend to consider Flying Blue as just a good way to book Delta awards if you don’t have an Amex, but they’re missing the best part: Flying Blue promo rates. Every month, Flying Blue releases a new set of cities that they offer promotional pricing on (usually 25% off their regular partner saver rates). As long as you fly between any country in Europe and these cities, you’re eligible for the discounted pricing (while seats last of course). The discounted pricing is in effect for trips within 6 months of the current month, so the January promos are in effect for trips till June 30. Unfortunately there’s no US-based cities on this list for January, but in December, you could have booked flights from the following cities for a discount: Washington D.C. to Europe from 15k miles (25% off) Boston to Europe from 15k miles (25% off) This month there are lots of Canadian cities on the list though (Toronto, Montreal, Ottowa), so for my Canadian friends out there, it’s your time to shine! You can always see the list of cities here under “Long-Haul Flights” (I suggest bookmarking this link!) Let’s check out an example. Let’s say you’re looking to do V-Day in the city of love, Paris. We can pop in Toronto for the origin and Paris for the destination, and select Business. Seems there’s some partner saver space for Feb 13! You can tell because the button is in green; non-saver space is shown in blue. 50k ain’t bad for Air France business class! You will need to pay a bit of a higher fee here (220 euros), but this flight is going for $5526 right now, so you’re getting an insane 10.5¢/pt redemption here. What a steal for V-day in Paris. (Pro tip: You don’t have to reside in Toronto to take this flight…there’s dozens of NYC <> YYZ flights every day, and you could just book a cheap one like the one below, chill in the Air Canada lounge for free with your business class ticket, and hop over to Paris from there.) There’s so many more underrated transfer partners I could include, but this issue is getting kinda long, so I’ll throw ‘em in a future issue! We were unable to load this poll. Please refresh the page. Deals and Other Awesome Stuff Bilt Dining has 100 restaurants participating in NYC Restaurant Week! You’ll earn extra Bilt points on these restaurants, even if you don’t use your Bilt card (just make sure to register your other card in the Bilt wallet). Plus you can register any Mastercard here (including your Bilt one) to get $10 in statement credits per restaurant, up to $30. You can check your Bilt app for the full 100 restaurant list. Chase Offers has a few cool promos running (may vary by card). Be sure to activate them in the Chase app! Here’s a few on the Chase Sapphire Reserve: 10% cash back on Liquid IV and McDonald’s for your next drunk night out wholesome night in. 10% back on various hotel chains, including Intercontinental, Crowne Plaza, Le Meridien, Kimpton, Hyatt Place, and Holiday Inn. $10 cash back on Turbotax: file your taxes early and feel like a true adult Since I’m a travel advisor working under a licensed travel agency, I can get you access to perks and rates that aren’t publicly available when you book through me. Virtually all of these options include free perks like buffet breakfast for 2, $100 hotel credit, and room upgrades! Here’s a few of the coolest ones: Park Hyatt Bangkok: Stay 3 nights, pay for 2 on stays till March 31. Also, stay 2 nights, pay for just 1 for specialty suites (with same perks) Andaz 5th Avenue (NYC): Stay 4 nights, pay for 3 on stays till March 31 (includes perks like free breakfast, $100 hotel credit, and room upgrade). The Andaz is one of my personal favorite hotels in NY! Thompson Denver: Stay 3 nights, pay for 2 for stays till March 10. Those of you going for a *cough* certain digital asset conference *cough* might find this one useful! (I’ve stayed there personally too for that same conference in the past) Grand Hyatt Playa del Carmen Resort: Stay 3 nights, pay for 2 for stays till June 30. Also, you’ll get an extra $50 to spend at the spa (on top of the $100 hotel credit). If you’re staying at a Kimpton hotel this month or next, say “Chalet All Day” to the front desk. You’ll be glad you did! Thanks for making it this far and I hope you’re enjoyed this first issue! It’s my first time doing anything like this, and I’d really appreciate your thoughts and feedback in my Google form here! Bon Voyage, Shrey Thanks for reading Shreycation! Subscribe for free to receive new posts and support my work. Subscribe 14 2 Share",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/i/140407300/for-beginners-why-do-transfer-partners-matter"
    },
    {
      "title": "How to actually transfer your points - by Shrey G",
      "content": "How to actually transfer your points A button by button tutorial SHREY G FEB 16, 2024 5 Share Hi Shreycationers, We’ve been talking a lot about how you can use your credit card points to get outsized value on your points. Instead of just getting 1¢/point, you can squeeze out 3x, 5x, or even 10x the value just by transferring your points into airline mileage programs to book “award travel.” This also lets you book free flights on airlines where you might not otherwise have any miles; just transfer them over from a card! There are entire forums dedicated to going down the rabbit hole on strategies for optimally deploying your points. But if it’s your first rodeo, you’re probably hung up on a more fundamental question: how do I actually move the points from one program to another? The UIs for many of these credit card and airlines program are historically a bit lacking, so the process can be unintuitive. So without further ado, a play by play guide on how to actually transfer your points. Step 0: Identify your redemption One of my dear Shreycation readers was recently fed up with the 29 degree weather in NYC and needed to escape somewhere warm. He wanted to book a flight to Hawaii, so I helped him through the process. Now I’ll be walking you through that same process in this issue. Way better than 6 inches of snow… Before we can book our travel using points, we must pinpoint available award seats that can be redeemed with an airline's mileage program. It’s essential to ensure this award space exists BEFORE we transfer points from your credit card, as once points are transferred, there's no going back. Point transfers are one-way and irreversible. Finding ideal award space is the subject of Shreycation issues past, present, and future, but for the purpose of this example, we’ll work with one of my favorite award redemption paths. I’ve previously talked about how you can book dirt cheap domestic flights on United Airlines by redeeming miles in the Turkish Airlines Miles & Smiles program. (Turkish and United are partners, meaning I can redeem Turkish points on a United ticket.) Traveling to Hawaii counts as domestic travel in Turkish’s eyes, so we can take advantage of a sweet spot here and book a EWR (Newark) to HNL (Honolulu) flight for a very cheap 10k Turkish miles. (Booking this flight directly with United would cost 30k+ United miles.) Hard to see in this image, but there’s a very tiny little United logo in the search result that indicates this is a partner flight. Now I don’t have any Turkish miles since I rarely fly on Turkish in the first place, but there’s where our credit card points come in. We can mint miles in Turkish by transferring from points from a card. Step 1: Transfer the points Now that you know where you want to redeem your points, go to your credit card rewards portal to start the transfer. You’re looking for a button that says something like “Transfer points.” Note that you do NOT want to go through their “Book travel” feature; this is for booking travel on cash (or using your credit card points directly, which is usually a pretty poor use of points). Some quick links to your rewards portal: Chase, Amex, Capital One, Citi, Bilt (use app) Here’s where to find the magic “transfer points” button in a few major card portals: How to access the point transfer feature in various credit card rewards portals. In order: Chase, Amex, Bilt. Don't click the buttons marked with a red X; these are for regular cash travel. Tap images to see in more detail. Confirm your credit card is partnered with your desired airline mileage program Not all airlines are partnered with all credit card partners, so you’ll first need to make sure you use a credit card that can transfer to your desired airline mileage program. (This is also why I recommend having cards in multiple programs, even if it’s the entry level cards!) Here’s a handy diagram I made for y’all to see all the transfer partners at a glance: Print or download this for future reference! I made this diagram because I couldn’t find anything like it on the web. Going back to our EWR-HNL example, we’re booking through Turkish Airlines, so according to the diagram above, I’d need to use Bilt, Capital One, or Citi to transfer points. If I go the “Transfer” tab in the Bilt app, I can scroll down and select Turkish: If you haven’t made an account with the target mileage program yet, you’ll need to do that first and enter your account number when transferring. Calculate how many points you need to transfer Most of the time, this is dead simple. The vast majority of points transfer tend to be at a 1:1 ratio, so if you need 10k airline miles, just transfer 10k credit card points. That means I just need to transfer 10k Bilt points into Turkish Airlines to book my EWR-HNL flight. A few caveats: There are some rare exceptions to the 1:1 transfer ratio, like transferring to EVA Air via Capital One. Credit card programs often run transfer bonuses where you get more miles per point you transfer. You can take advantage of these bonuses to get hilariously cheap award travel, like many Shreycation readers did on Air Canada earlier this month. Bilt is renowned for their killer 75-150% transfer bonuses on the 1st of each month, and other programs like Chase and Amex have run 30-60% bonuses in the past. Learning how to finally use that small fortune of points you’ve been sitting on? Send this article to a friend who desperately needs some help! (We have a referral program here at Shreycation that’ll score you some dope content and perks; use the button below to make sure your referral counts.) Refer a friend Step 2: Wait Many point transfers are nearly instant. Once you’ve triggered the request from the credit card portal, you can usually make a quick coffee and by the time you’re back, the miles will be credited to your airline mileage account. For example, my points took 10 minutes to transfer from Bilt to Turkish, and I got an email confirmation from Bilt telling me the deed was done. After 10 mins of waiting, I got an email from Bilt… And sure enough, they’re right there in my Turkish account! Sometimes, the transfers can take longer though. For example, transferring Bilt points to American AAdvantage or Amex points to Singapore KrisFlyer can take up to 24 hours. Good award tickets tend to go away quickly, so if you’re dealing with a partner that has a transfer delay, you can often call up the airline to “hold” the award for you. This lets you rest easy knowing someone else won’t swoop your spot just because your points were in transit. Step 3: Book it Now that you’ve transferred the points, you can return back to the portal for the airline you’re booking through and complete your booking! Wait why am I being charged cash too? Often when booking award travel, you might notice you’ll still need to enter your credit card and pay some cash. This is because most award travel has a few taxes and surcharges, on top of the miles you’re redeeming. You can’t pay for these extra fees in miles unfortunately. The surcharges vary pretty significantly across different mileage programs. Some programs like United charge a nominal amount of $5.60 (to cover the TSA security fee). However, others may charge you the dreaded “fuel surcharge”, a fee that often scales by distance and cabin class and can add hundreds to the flight cost. Air France is known for doing this: Sample economy class award from Air France with a hefty $166 fuel surcharge. Since these fuel surcharges can be hefty, it’s important to consider those when valuing your redemption — spending 27k miles to get a $400 flight for free is less compelling if you’re spending $170 in surcharges. We were unable to load this poll. Please refresh the page. Step 4: Manage your flight Now that you have your flight booked, you might be wondering how to manage your flight (e.g. check in, change your seat, upgrade, etc.). This differs based on whether you booked your award directly with the airline or if you booked via a partner. If you booked an award with the airline directly If you booked an award ticket with the same airline that’s operating the flight (e.g. you booked on United and you’re flying United), it’s business as usual. Once you book, you’ll already see your flight linked to your mileage account and in your app, no action required. You’ll also be able to change seats, upgrade, check in, etc. like it’s a normal flight. If you have an issue, you just take it up with the airline. If you booked an award via a partner In our example though, we’re using Turkish to book a ticket on a United flight, so things get a little more complicated since there’s 2 airlines involved: the one we booked from (Turkish), and the one we’re actually flying (United). Upon booking, Turkish will send me an email with a confirmation number. FAKENO is a dummy reference number for example sake. Now I can enter that confirmation on the United website and it should link the reservation to my MileagePlus account (sometimes you may need to contact them if this doesn’t work automatically though). United may assign me a different confirmation number than the one Turkish gave me, but rest assured, it’s the same flight. On the left, I opened the United app and linked my trip to my United account using the code Turkish gave me. On the right, you can see United successfully retrieved my flight details. Since I have United status, linking my trip to my United account lets me enjoy my United perks on the flight (e.g. picking a Economy Plus seat for free). To be clear, I won’t earn any United miles or status points on this flight, but I will get to enjoy my existing perks. What if I need to make changes or need customer support? If you need help with the booking (e.g. cancel/change flight), contact the airlines you booked through (Turkish in this case). If you need help with the flight (delays, missed flight, seat change), contact the airline you’re actually flying on (United in this case). Putting it together We’ve now gone through the full process of transferring points to get killer redemptions. It may seem like a lot at first, but after a few redemptions, it’ll be second nature to you! As I mentioned earlier, this article is inspired by an actual Hawaii trip I was helping a Shreycation reader with. The golden rule of free travel is to earn lots of points per dollar and redeem them for lots of cents per point. Using tips and tricks we’ve covered in previous issues, he executed this to a T. He earned 10k miles from a single fancy dinner with friends because he took advantage of a whopping 16x bonus on Bilt Dining on the 1st of the month. He then identified a Turkish airlines redemption for his Hawaii trip for just 10k miles. Just by strategically earning and deploying points, his one dinner from 2 months ago paid for his Hawaii flight today. (That flight would have cost $775 by the way. That’s 7.75¢/point — insane value, especially for economy.) Note for the Eagle Eyed: Turkish Devaluations Those of you who have been following along with previous Shreycation issues might have noticed that the Turkish redemption here is 2.5k miles more than expected. After all, just 1 month ago I wrote that all domestic redemptions were 7.5k miles. Unfortunately, this week Turkish has finally succumbed to inflation the same way United and many others have, and they made various routes more expensive (sometimes as much as 90% higher). The silver lining is domestic trip awards only increased 33% from 7.5k to 10k, so it’s still one of the best deals out there for domestic travel. Thanks for reading! I know it’s been a minute. I’ve been working on something new and exciting in the travel space, and y’all will be the first to hear about it once it’s up. It’s the culmination of months of work, and I’m excited to share it soon! Shreycation has received so much love and support from y’all, and I’d love to keep that going. Share with a friend, and if this is your first time reading Shreycation, subscribe for more. Share Shreycation Subscribe 5 Likes 5 Share",
      "content_type": "other",
      "source_url": "https://shreycation.substack.com/i/141743217/wait-why-am-i-being-charged-cash-too"
    }
  ]
}