{
  "site": "https://www.thebluedot.co/",
  "items": [
    {
      "title": "Bluedot for EV Driver and Fleet Manager",
      "content": "Seamless charging and management for your EV fleet Access over 80% of chargers in the US. Manage and track your fleet wherever it goes. Get Started Backed by PUBLIC CHARGING ACCESS Access over 80% of chargers in the U.S. Your drivers can see all the chargers near them, plus real-time visibility and speeds. They can start charging and pay, all with Bluedot. AUTOMATED BILLING Enable instant payments for all charging sessions Fleet drivers can pay for any charging session quickly and easily with Bluedot. Drivers can then be billed daily, or the fleet can be billed at the end of the month. HOME CHARGING REIMBURSEMENT Easily track and reimburse home charging activities Monitor drivers' home charging sessions via the Bluedot dashboard. Customize your reimbursement rates. We provide you with IRS-complaint reimbursement receipts. FLEET TELEMATICS View all your fleet’s data in an easy-to-use analytics dashboard Make the most of your fleet's charger use. Analyze and optimize kWh delivered and total cost of ownership on a per driver or fleet-wide basis. Businesses across various industries rely on Bluedot to manage their electric vehicles. Corporate fleets Corporate car rental fleets Delivery and postal fleets Electric car rental fleets Taxi and TNC vehicle fleets Government fleets Bluedot has been a huge help in organizing our operations, managing our charging infrastructure, and providing telematics for our fleet. Their multi-OEM system allows us to manage our Chevy Bolts, BMWs, Fords, and Teslas all in one place. Justin Pappan (Founder and CEO of EV Access) Growth +125K Vehicles +250 Your electric vehicle charging hub: simplified Welcome to our premier charging hub, tailored for EV drivers seeking simplicity and efficiency. Our focus is on providing you with quick and straightforward access to charging stations, ensuring your vehicle is charged and ready for whatever lies ahead. +120k Public charging stations $75k+ Charging cost savings 1.4k+ Tons of CO2 emissions averted +10k Satisfied drivers We’d love to show you around With Bluedot you can: Seamlessly provide access to public charging for your fleet drivers Automate charging payments Track your fleet's charging behavior Track at-home charging for reimbursements Recent updates and resources Check all resources -> Bluedot Now Powers Rivian’s Service Fleet Charging Experience By streamlining access to chargers, automating reimbursement, and simplifying tracking, Bluedot helps Rivian focus on what matters most—delivering world-class service. Bluedot is Now SOC 2 Compliant Bluedot is proud to announce that we are now SOC 2 compliant, validating our commitment to the highest standards of data security and privacy for our users and partners. As we play an innovative role in the electric vehicle ecosystem, ensuring the security of our users' and partners' data is one of our top priorities. That's why Bluedot has obtained SOC 2 certification. This certification demonstrates our efforts to meet the highest standards for security and privacy. Bluedot and Zeti Announce Strategic Partnership to Enhance Electric Fleet Financing and Operational Solutions Bluedot and Zeti combine fleet management tools and flexible financing, offering real-time insights, transparent costs, and better cash-flow management to simplify EV adoption for fleet operators.",
      "content_type": "other",
      "source_url": "https://www.thebluedot.co/"
    }
  ]
}